[
  {
    "id": 1,
    "title": "حمدباری تعالیٰ",
    "description": "میٹھی نیند سلاتا ہے ہر روز خدا\nخود ہی مجھے جگاتا ہے ہر روز خدا\n\nاپنے سارے بھولے بھٹکے بندوں کو\nاپنی سمت بلاتا ہے ہر روز خدا\n\nمیں اس کے محبوب کی نعتیں لکھتا ہوں\nیہ تحریک دلاتا ہے ہر روز خدا\n\nمیری سوچ کی دنیا روشن رہتی ہے\nنیا خیال سمجھاتا ہے ہر روز خدا\n\nدن اور رات کی آمد کے آئینے میں\nاپنی شان دکھاتا ہے ہر روز خدا\n\nہم اس سے ہر روز بغاوت کرتے ہیں\nپھر بھی ہمیں کھلاتا ہے ہر روز خدا\n\nاس کی ہے تعریف کہ ہم سے بندوں کو\nاپنے گھر بلواتا ہے ہر روز خدا\n\nکتنے نابینا لوگوں کو دنیا میں\nسیدھی راہ دکھاتا ہے ہر روز خدا\n\nجو اس کے عرفان کی خواہش رکھتے ہیں\nان سے پیار بڑھاتا ہے ہر روز خدا\n\nحمد و نعت کے زیور سے یوں لگتا ہے\nمجھ کو خوب سجاتا ہے ہر روز خدا\n\nدل کے آنگن میں شہزادؔ محبت کی\nاک قندیل جلاتا ہے ہر روز خدا"
  },
  {
    "id": 2,
    "title": "قطعہ",
    "description": "ظلمتوں کی طرف سے نور کی سمت\nفکر کے رخ کو کس نے موڑ دیا\n\nنعت کے گلشنوں کی سیر کے بعد\nمیں نے دشت غزل کو چھوڑ دیا"
  },
  {
    "id": 3,
    "title": "حمدباری تعالیٰ",
    "description": "پتھر میں تیرے فضل نے پودے اگا دیے\nتیرے کرم کی موج نے مردے جلا دیے\n\nکیا کیا نوازشات ہیں تیری جہان پر\nبندوں پہ نعت کے خزانے لٹا دیے\n\nپھولوں ، پھلوں سے بخش دی زینت زمین کو\nمہر و مہ و نجوم فلک پر سجا دیے\n\nپیدا ہمیں حضور کی امت میں کر دیا\nسوئے ہوئے نصیب ہمارے جگا دیے\n\nطبع بشر کا ان سے تعلق ہے اس لیے\nموسم یہ سرد گرم خدا نے بنا دیے\n\nدعوت ہے غوروفکر کی تخلیق روز و شب\nقدرت کے راز ارض و سما میں چھپا دیے\n\nاہل نظر کو بخش کر اپنی رضا کا شوق\nان کو حصول قرب کے نسخے بتا دیے\n\nفتح و ظفر ہے تیرے سپاہی کے سر کا تاج\nباطل کے تیری فوج نے چھکے چھڑا دیے\n\nبخشا ہے تو نے نعت کا شہزادؔ کو ہنر\nتو نے ہی اس کو حمد کے مضمون سجھا دیے"
  },
  {
    "id": 4,
    "title": "حمدباری تعالیٰ",
    "description": "دل کو لذت آشنا کرتا ہے تو\nعاصیوں کو باصفا کرتا ہے تو\n\nتیری رحمت کی کوئی حد ہی نہیں\nنعمتیں سب کو عطا کرتا ہے تو\n\nدوستوں سے ہو گا تیرا کیا سلوک\nدشمنوں کا جب بھلا کرتا ہے تو\n\nنفس امارہ کو کر دے مطمئن\nبادِ صرصر کو صبا کرتا ہے تو\n\nایک بچے کے لیے ماں باپ کو\nپرورش کا واسطہ کرتا ہے تو\n\nاس جہاں میں بھیج کر اپنے رسول\nحق و باطل کو جدا کرتا ہے تو\n\nاللہ اللہ تیری شفقت کا کمال\nبے وفائوں سے وفا کرتا ہے تو\n\nتو فقیروں کو بنا دیتا ہے شاہ\nبادشاہوں کو گدا کرتا ہے تو\n\nاے مرے مشکل کشا میرے کریم!\nدور مجھ سے ہر بلا کرتا ہے تو\n\nمرکز امید تیری ذات ہے\nعرض سائل کی سنا کرتا ہے تو\n\nجب کجی شہزادؔ پائے نفس میں\nاس کو سیدھا اے خدا کرتا ہے تو"
  },
  {
    "id": 5,
    "title": "قطعہ",
    "description": "وقف فساد جادئہ لطف و کرم پہ چل\nخواہش کو چھوڑ سیرت شاہِ امم پہ چل\n\nنکلیں گی آپ منزلیں تیری تلاش میں\nرہرو! ذرا حضور کے نقش قدم پہ چل"
  },
  {
    "id": 6,
    "title": "نعت شریف",
    "description": "سراپا فضائل حریص’‘ علینا\nکریم الخصائل حریص’‘ علینا\n\nرئوف’‘ ، رحیم’‘ ، صبیح’‘ ، قسیم’‘\nجمیل الشمائل حریص’‘ علینا\n\nبشیر’‘ ، نذیر’‘ ، حبیب’‘ ، طبیب’‘\nمحل المسائل حریص’‘ علینا\n\nمعلم ، مبلغ ، مدبر ، منظم\nامیر القبائل حریص’‘ علینا\n\nوہ کنزالحقائق وہ خیرالخلائق\nقوی الدلائل حریص’‘ علینا\n\nنہیں ان کا ثانی دو عالم میں کوئی\nزمانہ ہے قائل حریص’‘ علینا\n\nمیں گیت ان کے شہزادؔ کیونکر نہ گائوں\nوہ داتا میں سائل حریص’‘ علینا"
  },
  {
    "id": 7,
    "title": "نعت شریف",
    "description": "ان کی مدح و ثنا کرے گا کون\nنعت کا حق ادا کرے گا کون\n\nجیسے کرتے ہیں التفات حضور\nایسے لطف و عطا کرے گا کون\n\nاقتدائے شہ ہدیٰ کے بغیر\nجستجوئے خدا کرے گا کون\n\nیوں ازل تا ابد خشیت سے\nہاتھ اٹھا کر دعا کرے گا کون\n\nان سا عادل ہوا نہ ہے کوئی\nان سا اب فیصلہ کرے گا کون\n\nسرکشوں کو کرے گا کون اسیر\nآندھیوں کو صبا کرے گا کون\n\nکون بدلے گا دل کی دنیا کو\nخار کو گل ادا کرے گا کون\n\nہم سے شہزادؔ بے سہاروں پر\nلطف ان کے سوا کرے گا کون"
  },
  {
    "id": 8,
    "title": "نعت شریف",
    "description": "کوئی ایسا کمال ہو جائے\nعام طرزِ بلال ہو جائے\n\nفکر کو روشنی ملے ایسی\nنعت میرا خیال ہو جائے\n\nنعت گوئی اگر شعار نہ ہو\nمیرا جینا محال ہو جائے\n\nہجر کی قید کاٹ لی آقا\nاب میسر وصال ہو جائے\n\nسامنے ہو حضور کا روضہ\nاور وہ لمحہ سال ہو جائے\n\nجھلملاتا ہے جو سرمژگاں\nہر ستارہ سوال ہو جائے\n\nقرب شہزادؔ گر ملے ان کا\nزندگی لازوال ہو جائے"
  },
  {
    "id": 9,
    "title": "نعت شریف",
    "description": "جمال حریم دنیٰ دیکھ آئے\nخدا کو حبیب خدا دیکھ آئے\n\nازل سے ابد تک کے سارے مناظر\nنظام جزا و سزا دیکھ آئے\n\nتجلی سے جس کی ہوا طور سرمہ\nوہ اس نور کو برملا دیکھ آئے\n\nبھلا اس کا ثانی کہاں کوئی ہوگا\nجو خود جا کے اپنا خدا دیکھ آئے\n\nجو بالا ہیں وہم و گماں کی حدوں سے\nمقامات وہ مصطفی دیکھ آئے\n\nہوئے آپ دارالفنا سے روانہ\nگھڑی بھر میں دارالبقا دیکھ آئے\n\nیہ نکتہ بھی شہزادؔ معراج میں تھا\nکہ رستے کو خود رہنما دیکھ آئے"
  },
  {
    "id": 10,
    "title": "نعت شریف",
    "description": "یوں ہے ہمارے قلب کا طیبہ سے رابطہ\nجیسے جبین عجز کا کعبہ سے رابطہ\n\nہوتا رہے حضور کی مدحت سے فیضیاب\nقائم رہے غلام کا آقا سے رابطہ\n\nدنیا رہی حضور کے زیرنگیں مگر\nرکھا نہیں حضور نے دنیا سے رابطہ\n\nظاہر میں بندگانِ خدا سے ہے بات چیت\nباطن میں اپنے مالک و مولا سے رابطہ\n\nہر دم ہوں کشت روح پر رحمت کی بارشیں\nٹوٹے نہ تشنہ کام کا دریا سے رابطہ\n\nفیض نبی سے جسم میں ہونے کے باوجود\nرکھتی ہے روح عالم بالا سے رابطہ\n\nپاتا ہوں اپنے آپ کو شہزادؔ خلد میں\nہوتا ہے جب حضور کے روضہ سے رابطہ"
  },
  {
    "id": 11,
    "title": "نعت شریف",
    "description": "قربت کا شرف دے کر تصدیق وفا کر دو\nاے سرورِ دیں مجھ کو اک نعت عطا کر دو\n\nصدیق کے صدقے میں ہو جائے کرم ایسا\nہم نفس کے ماروں کو اخلاص نما کر دو\n\nہم بھول گئے آقا! فرق ابیض و اسود کا\nظلمت کو الگ کر دو انوار جدا کر دو\n\nگردن میں رہے ہر دم ، ڈورا تیری نسبت کا\nہم درد کے ماروں کے حق میں یہ دعا کر دو\n\nدیکھے جو مجھے کوئی ، یاد آئے تری سیرت\nخیرات مجھے اپنی سیرت کی عطا کردو\n\nانوارِ محبت سے ہو جائے منور دل\nہر ایک رگ جاں کو یوں نعت سرا کر دو\n\nشہزادؔ یہ نسخہ ہے ایماں کی حفاظت کا\nسرکار کی یادوں میں سوچوں کو فنا کر دو"
  },
  {
    "id": 12,
    "title": "نعت شریف",
    "description": "اے شاہِ زمن! تیرا ہر رنگ یگانہ ہے\nہر پل تیری رحمت کا محتاج زمانہ ہے\n\nمنظر میری نظروں میں ہے صبح مدینہ کا\nکیا خوب ہیں یہ لمحے کیا وقت سہانا ہے\n\nاسرار الٰہی کا بنتا ہے وہ دل مخزن\nاس نور مجسم کا جس دل میں ٹھکانا ہے\n\nسنت میں تری آقا ہے زینت و رعنائی\nاپنا کے تری سنت کردار سجانا ہے\n\nبے مانگے اسی در سے پاتے ہیں جہاں والے\nسرکار کے دامن میں رحمت کا خزانہ ہے\n\nمقصود تھا دنیا میں شہزادؔ ظہور ان کا\nتخلیق دو عالم تو بس ایک بہانہ ہے"
  },
  {
    "id": 13,
    "title": "نعت شریف",
    "description": "سرورِ دیں رحمت کونین کی باتیں کریں\nآمنہ بی بی کے نور عین کی باتیں کریں\n\nچین ملتا ہے دلوں کو ذکر سے سرکار کے\nغم کے مارو آئو ہم سکھ چین کی باتیں کریں\n\nبادشاہوں کے سروں پر تاج ہیں جس کے طفیل\nسید سادات کے نعلین کی باتیں کریں\n\nاہل بیت مصطفی کے ذکر سے گرمائیں دل\nفاطمہ، زہرا، علی، حسنین کی باتیں کریں\n\nعرش والے جھوم اٹھتے ہیں وفور شوق سے\nفرش والے جب شہ کونین کی باتیں کریں\n\nیاد آ جاتی ہیں اس دم بنتین مصطفی\nجب بھی ہم عثمان ذوالنورین کی باتیں کریں\n\nآئو اے شہزادؔ ہم بغض و حسد کو چھوڑ کر\nہر گھڑی اس محسن دارین کی باتیں کریں"
  },
  {
    "id": 14,
    "title": "نعت شریف",
    "description": "در سے آقا کے خیرات لے کر اٹھا\nجب بھی بیٹھا میں سوغات لے کر اٹھا\n\nرات سویا جو ان کا تصور لیے\nصبح روشن خیالات لے کر اٹھا\n\nجب بھی بیٹھا تفکر کا کاسہ لیے\nان کے در سے نئی نعت لے کر اٹھا\n\nسرور دیں کو اس کی خبر ہو گئی\nدل میں جب بھی کوئی بات لے کر اٹھا\n\nپڑھتے پڑھتے لگی آنکھ صل علیٰ\nلب پہ حمد و مناجات لے کر اٹھا\n\nپھر ستایا ہے محبوب کی یاد نے\nپھر میں شوق ملاقات لے کر اٹھا\n\nبارگاہِ صحابہ میں جب بھی گیا\nجذبۂ حب سادات لے کر اٹھا\n\nدل میں شہزادؔ جتنے سوالات تھے\nدر سے ان کے جوابات لے کر اٹھا"
  },
  {
    "id": 15,
    "title": "نعت شریف",
    "description": "تیرے ہر ایک پل میں زمانہ دکھائی دے\nسارا جہان تیرا گھرانہ دکھائی دے\n\nمحو سفر ہے وقت کے ہمراہ تیری ذات\nہر ہر گھڑی میں تیرا ٹھکانہ دکھائی دے\n\nتیری ہر اک دلیل کے آگے شہ شعور!\nباطل کا ہر جواز بہانہ دکھائی دے\n\nممکن نہیں حضور کے فیضان کے بغیر\nمجھ سا ضعیف شخص توانا دکھائی دے\n\nشہزادؔ تو بھی جنت طیبہ میں کر قیام\nمنظر جہاں ہر ایک سہانا دکھائی دے"
  },
  {
    "id": 16,
    "title": "نعت شریف",
    "description": "سکون جاں ہے خیال تیرا\nنظر کی ٹھنڈک جمال تیرا\n\nتو میرے دل کا مکیں ہے لیکن\nمیں پھر بھی چاہوں وصال تیرا\n\nجو تو نے رخ سے نقاب اٹھایا\nسہوں گا کیسے جلال تیرا\n\nکنیز تیری ہر ایک ساعت\nغلام ہر ایک سال تیرا\n\nاے وجہ تحریک نبض ہستی\nہر اک عمل بے مثال تیرا\n\nنہ کیوں ہو مقبول قدسیوں میں\nغلام جو ہے بلال تیرا\n\nتری حقیقت خدا ہی جانے\nخدا ہی جانے کمال تیرا\n\nرگوں میں شہزادؔ کی رواں ہے\nلہو کے ہمرہ خیال تیرا"
  },
  {
    "id": 17,
    "title": "نعت شریف",
    "description": "تسکین دل خستہ دلاں رحمت عالم\nہے نام ترا راحت جاں رحمت عالم\n\nلاریب ترے لطف کا انداز ہے یہ بھی\nآنکھوں سے جو ہیں اشک رواں رحمت عالم\n\nدنیا میں ترا شہر ہے بس جس میں ہمیشہ\nہوتا ہے دل افروز سماں رحمت عالم\n\nحرکت میں ترے لطف سے ہے نبض زمانہ\nقائم ہے ترے دم سے جہاں رحمت عالم\n\nکرتی ہے ترے لطف مسلسل پہ دلالت\nموجودگیٔ کون و مکاں رحمت عالم\n\nہر پھول ہے تازہ ترے گلزار کا اب تک\nتیرا ہے ہر اک نقش جواں رحمت عالم\n\nاللہ رے یہ لطف و کرم ، بندہ نوازی\nہے عبد سے معبود عیاں رحمت عالم\n\nمحور ہے تری ذات مرے فکر و سخن کا\nہے نعت تری میرا نشاں رحمت عالم\n\nمحتاج ہے شہزادؔ تری چشم کرم کا\nاے سرور دیں! شاہِ شہاں رحمت عالم"
  },
  {
    "id": 18,
    "title": "نعت شریف",
    "description": "فرش تا عرش ہے جو حسن و جمال اچھا ہے\nسب خیالوں سے محمد کا خیال اچھا ہے\n\nہجر لاحق ہو تو لیتے ہیں مزہ دوری کا\nقرب حاصل ہو تو کہتے ہیں وصال اچھا ہے\n\nیادِ سرکار میں جو رہتا ہے دل پر طاری\nساری خوشیوں سے وہی حزن و ملال اچھا ہے\n\nگلشن جاں میں مہکتے ہیں در و دوں کے گلاب\nاس لیے مجھ سے گنہگار کا حال اچھا ہے\n\nفیض سے جس کی فصاحت نے تعارف پایا\nوہ شہ اہل سخن، شیریں مقال اچھا ہے\n\nان کی آمد سے ہلے قیصر و کسریٰ کے مکاں\nدبدبہ، رعب یہ ہیبت یہ جلال اچھا ہے\n\nجس کے اسہد کو ہے اشہد پہ تفوق حاصل\nسارے اصحاب میں کیا نطق بلال اچھا ہے\n\nشہر طیبہ کی فضائوں میں جو ہو جائے بسر\nوہ مہینہ، وہی ہفتہ، وہی سال اچھا ہے\n\nآپ سے آپ کو شہزادؔ نے مانگا آقا\nسائل اچھا نہیں سائل کا سوال اچھا ہے"
  },
  {
    "id": 19,
    "title": "نعت شریف",
    "description": "محمد کا در ہے دعا مانگ لوں میں\nسماں پُراَثر ہے دعا مانگ لوں میں\n\nملے گا یہیں سے سکونِ دل و جاں\nسخاوت کا گھر ہے دعا مانگ لوں میں\n\nلگا دیں گے مہر اجابت وہ خود ہی\nیہ طیبہ نگر ہے دعا مانگ لوں میں\n\nملا تو ہے وقت زیارت و لیکن\nبڑا مختصر ہے دعا مانگ لوں میں\n\nہے رقت سی طاری دل مضطرب پر\nمری آنکھ تر ہے دعا مانگ لوں میں\n\nمدینہ سے رخصت ہوا چاہتا ہوں\nسفر پھر سفر ہے دعا مانگ لوں میں\n\nمری سانس لے لے فضائوں کے بوسے\nگھڑی بھر اگر ہے دعا مانگ لوں میں\n\nتصور میں شہزادؔ ہے ان کا روضہ\nیہ ان کی نظر ہے دعا مانگ لوں میں"
  },
  {
    "id": 20,
    "title": "نعت شریف",
    "description": "قافلہ زائروں کی راہ میں ہے\nسبز گنبد مری نگاہ میں ہے\n\nذہن فارغ ہے فکر دنیا سے\nسوچ تک بھی تری پناہ میں ہے\n\nفیض ہے تاجدار بطحا کا\nیہ جو تاثیر میری آہ میں ہے\n\nآشنائی غموں سے تیرے لیے\nآبلہ پائی تیری چاہ میں ہے\n\nناز کرتے ہیں اس پہ کون و مکاں\nجو بھی شامل تری سپاہ میں ہے\n\nمسجد و خانقاہ میں بھی نہیں\nلطف جو تیری بارگاہ میں ہے\n\nنعت سرور کی روشنی کے سوا\nاور کیا دفتر سیاہ میں ہے\n\nخوبیاں ان پہ ختم ہیں شہزادؔ\nوصف ہر ایک ذات شاہ میں ہے"
  },
  {
    "id": 21,
    "title": "نعت شریف",
    "description": "جن و انسان و ملائک کا وظیفہ نعت ہے\nسرورِ دیں تک رسائی کا وسیلہ نعت ہے\n\nامتی کے لب پہ رہنی چاہیے مدح رسول\nمذہب عشاق میں پہلا فریضہ نعت ہے\n\nراحت قلب و نظر ، تسکین جاں کے واسطے\nکاملوں کا آزمودہ خاص نسخہ نعت ہے\n\nحج ہو میقات ہو زم زم کہ تلبیہ و رمی\nمیرا مزدلفہ، منیٰ، صفا و مروہ نعت ہے\n\nخوش نصیبی سے ملا کرتی ہیں ایسی نعمتیں\nورثۂ اہل نظر رب کا عطیہ نعت ہے\n\nکشت قلب و جاں ہوئی سیراب جس کے فیض سے\nآب کوثر کا وہ ٹھنڈا میٹھا چشمہ نعت ہے\n\nہر گھڑی شہزادؔ میری سوچ ہے محو طواف\nمیرے فکر و فن کا قبلہ اور کعبہ نعت ہے"
  },
  {
    "id": 22,
    "title": "نعت شریف",
    "description": "حد محسوسات سے آگے لطافت آپ کی\nقدسیوں میں بھی مروج ہے ثقافت آپ کی\n\nآپ ہی پر ختم ہیں سب خوبیاں بعد از خدا\nسب رسولوں میں مسلم ہے امامت آپ کی\n\nدیکھتے ہیں سوئے طیبہ مشرقین و مغربین\nمانتے ہیں عرش والے بھی قیادت آپ کی\n\nآپ کی تعلیم غالب ساری تعلیمات پر\nپتھروں پر بھی موثر ہے خطابت آپ کی\n\nدست بستہ سارا عالم ہے کھڑا دربار میں\nجلسۂ کونین میں آقا! صدارت آپ کی\n\nہم سیہ کاروں کی بخشش کا وسیلہ ہے فقط\nحشر کے دن یارسول اللہ! شفاعت آپ کی\n\nآپ ہی کی پیروی میں ہے فلاح دوجہاں\nحق تعالیٰ کی اطاعت ہے اطاعت آپ کی\n\nکیجیے امداد میری اہل باطل کے خلاف\nاہل حق کے ساتھ ہوتی ہے حمایت آپ کی\n\nمیں رہا ہو جائوں زندان رواج و رسم سے\nاپنے ہر انداز میں پائوں شباہت آپ کی\n\nبے بسی شہزادؔ کی فریاد کرتی ہے حضور\nبے کسوں پر رحم فرمانا ہے عادت آپ کی"
  },
  {
    "id": 23,
    "title": "قطعہ",
    "description": "غریق بحر عصیاں پر نگاہِ التفات آقا\nمری  مضطر  خیالی کو  عطا  کیجے ثبات آقا\n\nمجھے ملتی رہے مدحت کی کرنوں سے توانائی\nرہے سر سبز بس یونہی مری شاخ حیات آقا"
  },
  {
    "id": 24,
    "title": "نعت شریف",
    "description": "شان محبوب خدا ہے منفرد\nمصطفی کی ہر ادا ہے منفرد\n\nمنفرد ہیں سرورِ کونین بھی\nاور ان کا ہر گدا ہے منفرد\n\nگلستان عشق کے نغمات میں\nنغمہ صل علیٰ ہے منفرد\n\nمانگنا سرکار سے سرکار کو\nسب دعائوں میں دعا ہے منفرد\n\nسر جھکایا اور طیبہ میں گئے\nعاشقوں کا راستہ ہے منفرد\n\nحضرت صدیق اکبر کے طفیل\nنقشبندی سلسلہ ہے منفرد\n\nباغ جنت میں بھی ہے تسکیں مگر\nشہر طیبہ کی فضا ہے منفرد\n\nظرف سے بڑھ کر بھی کرتے ہیں عطا\nآپ کا جود و سخا ہے منفرد\n\nانبیاء شہزادؔ سب ہیں باکمال\nسب میں ذات مصطفی ہے منفرد"
  },
  {
    "id": 25,
    "title": "نعت شریف",
    "description": "خالق انوار کی تخلیق پتلا نور کا\nآ گیا شکل بشر میں وہ سراپا نور کا\n\nعرش والے رشک کرتے ہیں یہ منظر دیکھ کر\nآدمی کے سر پہ رکھا حق نے سہرا نور کا\n\nنعت کے ہر شعر میں پنہاں ہے ایسی روشنی\nجیسے شاخ جاں پہ پھوٹا ہو شگوفہ نور کا\n\nمہر و مہ میں ہے شہ کونین کے رخ کی ضیاء\nنور کو خیرات دیتا ہے یہ چہرہ نور کا\n\nنور کے اصحاب اہلبیت اور ازواج نور\nنور ہی کے ساتھ ہو سکتا ہے رشتہ نور کا\n\nکہکشائیں گم ہیں شہر نور کے ذرات میں\nبھیک لیتا ہے انہیں سے ہر ستارہ نور کا\n\nظلمتوں کو کر دیا ہے روشنی سے آشنا\nآدمی کو آپ نے بخشا ہے تحفہ نور کا\n\nنقش پائے مصطفی ہے منزل اہل نظر\nسیرت سرکار ہے دراصل رستہ نور کا\n\nنعت لکھتا نور کے الفاظ سے شہزادؔ میں\nکاش میرے پاس ہوتا کوئی خامہ نور کا"
  },
  {
    "id": 26,
    "title": "نعت شریف",
    "description": "جب ارادہ ثنا کا کرتا ہوں\nحرف لکھتے ہوئے میں ڈرتا ہوں\n\nان کی خدمت میں پیش کرنے کو\nاپنے دامن میں اشک بھرتا ہوں\n\nیاد خلوت میں کرکے آقا کو\nجانے کس کیف سے گزرتا ہوں\n\nمیری جانب ہے ایک پاک نگاہ\nاس لیے ہی تو میں سنورتا ہوں\n\nذکر سرکار کی یہ برکت ہے\nمیں خزاں رت میں جو نکھرتا ہوں\n\nکشتیٔ نعت کا سوار ہوں میں\nدیکھیے پار کب اترتا ہوں"
  },
  {
    "id": 27,
    "title": "نعت شریف",
    "description": "کون جانے یہ کیسی نعمت ہے\nنعت میں اک عجیب لذت ہے\n\nبات کرتا ہوں اس طرح ان کی\nجیسے حاصل مجھے وہ صحبت ہے\n\nذکر سرکار جا بجا کرنا!\nعشق والوں کی یہ تو عادت ہے\n\nشہر طیبہ کو سوچتے رہنا\nمستقل یہ میری عبادت ہے\n\nیاد کر کے حضور کو رونا!\nقرب سرکار کی علامت ہے\n\nسبز گنبد کی تابناک شعاع\nزندگی کے لیے غنیمت ہے\n\nآپ مالک ہیں آپ ہی جانیں\nہم غلاموں کی کتنی قیمت ہے\n\nعاصیوں کے لیے پیام سکوں\nشافع حشر کی شفاعت ہے\n\nدیکھتے ہیں رخ رسول کریم\nاللہ والوں کو یہ سہولت ہے\n\nخوف شہزادؔ موت سے کیسا\nیہ تو میرے نبی کی سنت ہے"
  },
  {
    "id": 28,
    "title": "قطعہ",
    "description": "آ گئے کونین کے سرتاج غارِ ثور میں\nنعمت عظمیٰ بٹے گی آج غار ثور میں\n\nتین دن اور تین راتیں ساتھ خلوت میں رہے\nہو گئی صدیق کی معراج غار ثور میں"
  },
  {
    "id": 29,
    "title": "نعت شریف",
    "description": "رواں ہوں سوئے زوال آقا\nمیں گر رہا ہوں سنبھال آقا\n\nمیں ناقصوں میں مثال آقا\nتو کاملوں میں کمال آقا\n\nتری ثنا کی تجلیوں سے\nچمک رہا ہے خیال آقا\n\nفنا کے منصب پہ کر کے فائز\nبھلا دے قیل و مقال آقا\n\nہوئے ہیں تخلیق تیری خاطر\nیہ روز و شب ، ماہ و سال آقا\n\nازل سے شہزادؔ تشنہ لب ہے\nپلا دے جام وصال آقا"
  },
  {
    "id": 30,
    "title": "نعت شریف",
    "description": "شانِ پروردگار کے صدقے\nمصطفائی وقار کے صدقے\n\nہجر میں آپ کے جو ہو بے چین\nاس دل بے قرار کے صدقے\n\nجس کے باعث ہے اہتمام سجود\nاس تہجد شعار کے صدقے\n\nراہ حق کے ہر اک شہید کا خون\nبدر کے شہسوار کے صدقے\n\nشرق تا غرب جس کی شاہی ہے\nاس شہ انکسار کے صدقے\n\nسنت مصطفی پہ جان نثار\nاسوئہ پائدار کے صدقے\n\nآپ کے نقش پا پہ ہم قربان\nآپ کی رہگزار کے صدقے\n\nان سے شہزادؔ جس کو نسبت ہے\nایسی ہر یادگار کے صدقے"
  },
  {
    "id": 31,
    "title": "نعت شریف",
    "description": "مصطفی کا دیار دیکھیں گے\nگلشن پر بہار دیکھیں گے\n\nحسن کا شاہکار دیکھیں گے\nروضۂ پروقار دیکھیں گے\n\nسرورِ دیں کی بارگاہ میں ہم\nدل کو ہوتے نثار دیکھیں گے\n\nروبرو ان کے ہم جھکا کر سر\nشانِ پروردگار دیکھیں گے\n\nحکمرانی دلوں پہ ہے جس کی\nہم بھی وہ تاجدار دیکھیں گے\n\nسبز گنبد کا دلنشیں منظر\nجھوم کر بار بار دیکھیں گے\n\nہم پہنچ کر فضائے طیبہ میں\nہر سو بے اختیار دیکھیں گے\n\nوادیٔ لذت و سکون میں ہم\nنور کی آبشار دیکھیں گے\n\nمسجد خاتم الرسل کی طرف\nہم تو دیوانہ وار دیکھیں گے\n\nاذن شہزادؔ گر ملا ہم کو\nجا کے پردے کے پار دیکھیں گے"
  },
  {
    "id": 32,
    "title": "نعت شریف",
    "description": "دنیا جو چاہے اس کو خدائی نصیب ہو\nمجھ کو درِ نبی کی گدائی نصیب ہو\n\nمدت سے ہوں حضور میں اپنی تلاش میں\nمجھ تک مجھے بھی اب تو رسائی نصیب ہو\n\nرائی کی مثل ہاتھ پہ پائوں جہان کو\nقلب و نظر کو ایسی صفائی نصیب ہو\n\nسوتے ہوئے تو اور بھی ہوتے ہیں فیضیاب\nبیداریوں میں جلوہ نمائی نصیب ہو\n\nاس پر نثار خلد کی رنگینیاں تمام\nجس کو نبی کی مدح سرائی نصیب ہو\n\nدامن رسول پاک کا چھوٹے نہ ہاتھ سے\nچاہے جہان بھر سے جدائی نصیب ہو\n\nشہزادؔ کچھ ہو سنت سرکار کے بغیر\nممکن نہیں کہ ہم کو بھلائی نصیب ہو"
  },
  {
    "id": 33,
    "title": "نعت شریف",
    "description": "شہر طیبہ میں نظر آئے در و دیوار مست\nقربت سرکار سے ہیں گنبد و مینار مست\n\nلوگ چاہے کچھ کریں میرے جنوں پر تبصرہ\nمیں ہوں یادِ مصطفی میں برسر بازار مست\n\nشہر طیبہ کی فضائوں میں کچھ ایسا ہے اثر\nجائے جتنی بار کوئی ہو گا اتنی بار مست\n\nخرقہ پوشان حرم کا وجد تو جو ہے سو ہے\nاس جگہ دیکھے ہیں اہل جبہ و دستار مست\n\nروح میری مائل پرواز ہے سوئے حجاز\nفرطِ راحت سے ہوا ہے ، طائر رفتار مست\n\nاللہ اللہ ان کی آمد سوئے گلشن دیکھئے\nجھومتے ہیں لالہ و گل سرو قد گلزار مست\n\nپھر رہا ہے ان کی الفت میں فلک دیوانہ وار\nان کی چاہت میں زمیں، پتھر، ثمر، اشجار مست\n\nدیکھ لیتا ہے مجھے جو مست ہو جاتا ہے وہ\nآپ نے اس درجہ مجھ کو کر دیا سرکار مست\n\nآپ کی آمد سے آ جائے دل و جاں کو قرار\nآپ کی برکت سے ہو جائے مرا گھر بار مست\n\nگہ جلالی گہ جمالی نور کی برسات ہے\nجالیوں گے گرد آتے ہیں نظر انوار مست\n\nدر حقیقت عشق میں سرکار کے سچا ہے وہ\nسن کے ان کا نام نامی جو ہوا ہر بار مست\n\nنعت ہی شہزادؔ ساری مستیوں میں ڈھل گئی\nفیض تذکار نبی سے ہیں سبھی اشعار مست"
  },
  {
    "id": 34,
    "title": "نعت شریف",
    "description": "ب بسم اللہ میم محمد ا\nآدم کی تکریم محمد ا\n\nخالق کے عرفان کا باعث، تنزیل قرآن کا باعث\nوجہ ہفت اقلیم محمد ا\n\nتیرے صدقے قلب مصفّٰی، روح منور، نفس مزکی\nصدق تری تعلیم محمد ا\n\nاللہ اللہ تیری عظمت تیری حرمت تیری رفعت\nسب نے کی تسلیم محمد ا\n\nسرکش تیری جانب مائل ، کفر تری تاثیر سے گھائل\nتیرا خلق عظیم محمد ا\n\nجن و انس ملائک سارے روشن سورج چاند ستارے\nتیری ہے تنظیم محمد ا\n\nتیرا عشق ایمان کی جاں ہے تیری عظمت روح جہان ہے\nدین تیری تعظیم محمد ا\n\nاب میرے حالات ہیں ایسے ظلمت نور کو ڈھونڈے جیسے\nکھول در تفہیم محمد ا\n\nسنتا ہے فریاد خدا ہی دیتا ہے شہزادؔ خدا ہی\nکرتے ہیں تقسیم محمد ا"
  },
  {
    "id": 35,
    "title": "نعت شریف",
    "description": "سر کی آنکھوں سے شانِ خدا دیکھئے\nچشم دل سے رخ مصطفی دیکھئے\n\nکیجئے مانگنے کا ارادہ ادھر\nپھر ادھر سے عطا پر عطا دیکھئے\n\nجس نے مانگا اسے رشک حاتم کیا\nشاہ طیبہ کا جود و سخا دیکھئے\n\nبھول جائیں گے جتنے حسیں عکس ہیں\nسبز گنبد کا منظر ذرا دیکھئے\n\nمیرے آقا کی رفتار کو دیکھ کر\nاک طرف ہٹ گیا راستہ دیکھئے\n\nعقل کی انتہا دیکھنے کے لیے\nسیر معراج کی ابتدا دیکھئے\n\nدشمنوں کے لیے بھی سراپا کرم\nشفقت خاتم الانبیاء دیکھئے\n\nشہر سرکار میں ایسی تاثیر ہے\nبے وفا کر رہے ہیں وفا دیکھئے\n\nآفتاب رسالت کے انوار سے\nبجھ گیا کفر کا ہر دیا دیکھئے\n\nبارگاہِ نبی میں عجب کیف ہے\nہو رہے ہیں ملائک فدا دیکھئے\n\nجس کی تعظیم شہزادؔ ایمان ہے\nکر کے اس ذات سے رابطہ دیکھئے"
  },
  {
    "id": 36,
    "title": "نعت شریف",
    "description": "میں ، مری سوچیں، جوانی اور نعت\nپاک جذبوں کی گرانی اور نعت\n\nفکر و فن کی پاسبانی اور نعت\nرحمتوں کی میزبانی اور نعت\n\nسوچتا ہوں کس طرح یکجا ہوئے\nباد ، مٹی، آگ ، پانی اور نعت\n\nساتھ دیتی ہیں یہ کب تک دیکھئے\nمیری سانسیں، عمر فانی اور نعت\n\nایک ہی تصویر کے دو رُخ ہیں یہ\nمیرے بچپن کی کہانی اور نعت\n\nاک طرف ساحل پہ میں اور اک طرف\nریت ، موجوں کی روانی اور نعت\n\nہو گئے شہزادؔ لمحے یادگار!\nآنکھ پرنم ، شب سہانی اور نعت"
  },
  {
    "id": 37,
    "title": "نعت شریف",
    "description": "جب سے دل ان کا مستقر ٹھہرا\nگفتگو میں مری اثر ٹھہرا\n\nکھل گیا اس پہ راز صبح حیات\nجو مدینے میں رات بھر ٹھہرا\n\nنسبت فخر انبیاء کے طفیل\nمیں زمانے میں معتبر ٹھہرا\n\nمیری معراج ہوگئی جب سے\nان کے نقش قدم پہ سر ٹھہرا\n\nجونہی پہنچا ریاض طیبہ میں\nخشک پتہ ہرا شجر ٹھہرا\n\nراستہ گو طویل تھا لیکن\nمیری منزل انہیں کا در ٹھہرا\n\nنقش پائے حضور پہ چل کر\nآدمی رب سے باخبر ٹھہرا\n\nسر پہ ہے نقش نعل سرور دیں\nمیں بھی شہزادؔ تاجور ٹھہرا"
  },
  {
    "id": 38,
    "title": "نعت شریف",
    "description": "ہے ایک مدت سے یہ تمنا\nکہ مطلعٔ جاں پہ نام تیرا\n\nہمیشہ سورج کی مثل چمکے\nجو میری ہستی میں کج روی ہے\n\nجو کم نگاہی ہے بے حسی ہے\nجو ضعف ارادوں میں رچ چکا ہے\n\nجو نفس میں سرکشی ہے میرے\nہیں خواہشوں کے پہاڑ اندر\n\nیہ لمحے لمحے کی بے یقینی\nکہ میری رگ رگ میں بس چکی ہے\n\nکچھ ایسی چشم کرم ہو آقا\nکچھ ایسا بدلے نظام باطن\n\nکہ استقامت کی ایک زندہ\nمثال بن جائوں میں جہاں میں"
  },
  {
    "id": 39,
    "title": "نعت شریف",
    "description": "رشک خوبی مری خطا ہو جائے\nنعت تازہ اگر عطا ہو جائے\n\nگفتگو کر رہی ہو خاموشی!\nاشک آئینۂ دعا ہو جائے\n\nایسی روحانیت عطا ہو حضور\nمجھ سے نفسانیت جدا ہو جائے\n\nجب بھی پڑھتا ہوں میں درود و سلام\nساتھ شامل مرے خدا ہو جائے\n\nنعت لکھنے کو بیٹھ جاتا ہوں\nضبط کی جب بھی انتہا ہو جائے\n\nمصطفی سے رہوں میں وابستہ\nزندگی پیکر وفا ہو جائے\n\nیہ بھی ان کے کرم سے ممکن ہے\nمجھ سے مدحت کا حق ادا ہو جائے\n\nتذکرہ جب ہو شاہِ بطحا کا\nہر نفس شامل ثنا ہو جائے\n\nہر عمل میں چمک دمک ہو تری\nدل کا آئینہ حق نما ہو جائے\n\nمیرا ہر ہر قدم ہو تیرے لیے\nہر عمل میرا بے ریا ہو جائے\n\nاس کو حاجت نہیں کوئی رہتی\nجو بھی سرکار کا گدا ہو جائے\n\nروح آلائشوں سے پاک رہے\nذات میری بھی باصفا ہو جائے\n\nآپ کی قید میں رہے یہ غلام\nاور ہر قید سے رہا ہو جائے\n\nکاش شہزادؔ کا ہر ایک خیال\nآپ کی ذات میں فنا ہو جائے"
  },
  {
    "id": 40,
    "title": "نعت شریف",
    "description": "دن ہو یا رات ہو ہی جاتی ہے\nروز اک نعت ہو ہی جاتی ہے\n\nبات مجھ سے کوئی کرے نہ کرے\nان سے تو بات ہو ہی جاتی ہے\n\nجب بھی پڑھتے ہیں ہم درود و سلام\nمدح سادات ہو ہی جاتی ہے\n\nسامنے جب بھی کوئی مشکل ہو\nساتھ وہ ذات ہو ہی جاتی ہے\n\nان کی خدمت میں پیش کرنے کو\nکوئی سوغات ہو ہی جاتی ہے\n\nسرور دیں کی اک توجہ سے\nنفس کو مات ہو ہی جاتی ہے\n\nسنت مصطفی سے پیار تو ہو\nترک عادات ہو ہی جاتی ہے\n\nجتنا شہزادؔ ظرف ہے میرا\nاتنی خیرات ہو ہی جاتی ہے"
  },
  {
    "id": 41,
    "title": "نعت شریف",
    "description": "میرے فکر و شعور کی دنیا\nبن گئی رنگ و نور کی دنیا\n\nفیض مدحت سے ہے جہان دل\nاطمینان و سرور کی دنیا\n\nآئو جھک جائیں ان کی چوکھٹ پر\nچھوڑ کر یہ غرور کی دنیا\n\nآسمان و زمین کے اندر\nہے نرالی حضور کی دنیا\n\nان کے صدقے کلیم اور کلام\nان کے صدقے ہے طور کی دنیا\n\nسایۂ رحمت دو عالم میں\nہے وحوش و طیور کی دنیا\n\nخادم ان کے ملائکہ شہزادؔ\nان کے تابع ہے حور کی دنیا"
  },
  {
    "id": 42,
    "title": "نعت شریف",
    "description": "احاطہ ہو نہیں سکتا کمالات محمد کا\nشناسا کیا کوئی ہو گا مقامات محمد کا\n\nاجابت منتظر رہتی تھی استقبال کی خاطر\nخدا سے پوچھئے رتبہ مناجات محمد کا\n\nدرود پاک سے ہوتی ہے باطن کی صفائی بھی\nذریعہ بھی یہ اچھا ہے ملاقات محمد کا\n\nہنر کیا کیا عطا فرما دیے ہم سے نکموں کو\nبیاں ہو ہی نہیں سکتا عنایات محمد کا\n\nمیرے لب پہ رہیں ہر دم رسول پاک کی باتیں\nرہوں راوی خدایا میں روایات محمد کا\n\nقلم میرا لکھے تو بس نبی کی نعت ہی لکھے\nمرے شعروں میں ہو چرچا حکایات محمد کا\n\nکسی کو ہو اگر دعویٰ فصاحت اور بلاغت کا\nتو وہ لے کر جواب آئے سوالات محمد کا\n\nسواری پر ہے خادم اور آقا پاپیادہ ہیں\nیہ اک روشن نمونہ ہے مساوات محمد کا\n\nمیں ہوں شہزادؔ وصاف النبی اللہ کی رحمت سے\nمرا ہر شعر مظہر ہے ، فیوضات محمد کا"
  },
  {
    "id": 43,
    "title": "نعت شریف",
    "description": "جس کی لغت سے لفظ مدینہ نکل گیا\nجنت کا اس کے ہاتھ سے زینہ نکل گیا\n\nعشق نبی میں ذرہ برابر جو ہو کمی!\nسمجھو کہ زندگی سے قرینہ نکل گیا\n\nخوشبو رچی جو قلب میں حب رسول کی\nسارا دل و نگاہ سے کینہ نکل گیا\n\nکر ہی نہ پائے خلد مدینہ میں اعتکاف\nایسے ہی رحمتوں کا مہینہ نکل گیا\n\nشہر رسول پاک کے ذروں کو دیکھ کر\nدل سے مرے خیال نگینہ نکل گیا\n\nساحل پہ رہ گیا میں اکیلا بچشم نم\nلے کر سواریوں کو سفینہ نکل گیا\n\nاتنے گناہ دھل گئے شہزادؔ جسم سے\nشہر نبی میں جتنا پسینہ نکل گیا"
  },
  {
    "id": 44,
    "title": "نعت شریف",
    "description": "بلبل باغ خلد ہے نغمہ سرائے مصطفی\nحور و ملک ہیں عرش پر محو ثنائے مصطفی\n\nحق کی رضا وہ پا گیا بگڑی ہوئی بنا گیا\nفضل خدا سے مل گئی جس کو ر ضائے مصطفی\n\nدامن نبی کا تھام کر مست کچھ ایسا ہو گیا\nعالم سے بے نیاز ہے دیکھو گدائے مصطفی\n\nایک طرف ہے مستجاب، دوسری سمت ہے مجیب\nشان قبولیت لیے نکلی دعائے مصطفی\n\nظلمت کفر و شرک سے بچ کر رہیں گے بس وہی\nجن کے دلوں میں جاگزیں ہوگی ولائے مصطفی\n\nفتنوں کا زور و شور ہے چاروں طرف جہان میں\nآئو پناہ ڈھونڈ لیں زیر ردائے مصطفی\n\nدر پہ رسول پاک کے دامن بھی تنگ پڑ گئے\nاور رہا عروج پر جود و سخائے مصطفی\n\nنعت نبی کا فیض ہے شعر و سخن کی روشنی\nمیرا کمال کچھ نہیں یہ ہے عطائے مصطفی"
  },
  {
    "id": 45,
    "title": "نعت شریف",
    "description": "کتنی عظیم سرور عالم ہے تیری ذات\nروشن ہے تیرے نور سے ہر دم یہ کائنات\n\nدونوں جہاں ہیں سیرت اطہر سے مستنیر\nدریا ہے رنگ و نور کا آقا تری حیات\n\nتیرا کرم کنارے لگاتا ہے کشتیاں\nتیری نگاہ لطف سے ٹلتی ہیں مشکلات\n\nجن و بشر ، ملائکہ رکھتے ہیں احتیاج\nپاتے ہیں فیض شہر مدینہ سے شش جہات\n\nروشن ہے ان کی یاد سے میرا ہر ایک دن\nتاباں ہے نور نعت سے میری ہر ایک رات\n\nبزم خیال یونہی ابد تک سجی رہے\nطاری رہیں ہر آن حضوری کی کیفیات\n\nمرنے کے بعد زندگی دیتا ہے تیرا عشق\nفانی جہاں میں تیری محبت کو ہے ثبات\n\nجن کے اثر سے آئینہ دل کا چمک اٹھے\nباطن پہ میرے ڈال دو ایسی تجلیات\n\nدامن شفیع حشر کا شہزادؔ تھام لیں\nحسن عمل کے زور پہ ممکن نہیں نجات"
  },
  {
    "id": 46,
    "title": "نعت شریف",
    "description": "خوشبو جمال نور نشانی حضور کی\nہر اک ادائے پاک سہانی حضور کی\n\nحرفوں میں ہے مٹھاس اور باتوں میں چاشنی\nاللہ رے گفتگو میں روانی حضور کی\n\nبھولی نہیں ہے وادیٔ بطحا کو آج تک\nحق کے لیے وہ شعلہ بیانی حضور کی\n\nایسا مقام دے دیا اپنے حبیب کو\nکی ہے خدا نے بات زبانی حضور کی\n\nسارا حرم ہے سرور عالم سے مستفید\nکرتا ہے یاد رکن یمانی حضور کی\n\nمانند عندلیب ، ریاض رسول میں\nکرتا رہوں میں زمزمہ خوانی حضور کی\n\nاس کی ہر ایک بات میں ہوتی ہیں حکمتیں\nجس نے ہر ایک بات ہے مانی حضور کی\n\nحج کا سفر نصیب میں شہزادؔ گر ہوا\nکعبہ سے ہم سنیں گے کہانی حضور کی"
  },
  {
    "id": 47,
    "title": "نعت شریف",
    "description": "جلوہ فرما ہوں خیرالبشر خواب میں\nعمر ہو جائے ساری بسر خواب میں\n\nسامنے آنکھ کے ہو رخ مصطفی\nدیکھ لوں میں دعا کا اثر خواب میں\n\nشہر طیبہ میں ہو جائے یوں حاضری\nدیں دکھائی وہ دیوار و در خواب میں\n\nسبز گنبد کی چھائوں میں بیٹھا رہوں\nان کی چوکھٹ پہ ہو میرا سر خواب میں\n\nروضۂ پاک کی جالیاں چوم لوں\nہو میسر مجھے یہ اگر خواب میں\n\nچومتی تھی جو نعلین سرکار کو\nدیکھ لیں ہم بھی وہ رہگزر خواب میں\n\nآنے والے ہیں شاید زیارت کے دن\nخود کو دیکھا ہے باچشم تر خواب میں\n\nمجھ کو نسبت ریاض مدینہ سے ہے\nدیکھتا ہوں میں برگ و شجر خواب میں\n\nشاہِ طیبہ کی شہزادؔ قربت ملے\nآہ و زاری کا پائوں ثمر خواب میں"
  },
  {
    "id": 48,
    "title": "نعت شریف",
    "description": "دل سے آلودگی کو صاف کریں\nآئو طیبہ میں اعتکاف کریں\n\nرات بھر ہو مراقبہ میں بسر\nدن میں کعبے کا ہم طواف کریں\n\nان کی سیرت سے فیض لے لے کر\nنت نئے روز انکشاف کریں\n\nلاتعلق ہیں حسن فطرت سے\nجو شہ دیں سے اختلاف کریں\n\nپیروی میں رسول اکرم کی\nدشمن جاں کو ہم معاف کریں\n\nروح سے دور ہر کثافت ہو\nنعت کو روح کا غلاف کریں\n\nعشق شہزادؔ خام ہے ان کا\nکام سنت کے جو خلاف کریں"
  },
  {
    "id": 49,
    "title": "نعت شریف",
    "description": "در سے نبی کے دولت گفتار مل گئی\nمجھ ناتواں کو قدرت اظہار مل گئی\n\nبخشش گلے لگائے گی اس خوش نصیب کو\nمحشر میں جس کو قربت سرکار مل گئی\n\nکرتے ہیں بادشاہ بھی اس کی گداگری\nجس بے نوا کو دولت دیدار مل گئی\n\nاس پاک باز روح کی عظمت نہ پوچھئے\nجس روح کو حضوریٔ دربار مل گئی\n\nمیں بھی لکھوں گا مدحت محبوب کبریا\nشہزادؔ جب لطافت افکار مل گئی"
  },
  {
    "id": 50,
    "title": "نعت شریف",
    "description": "بیٹھے بیٹھے جو ان کی یاد آئی\nظلمت جاں نے روشنی پائی\n\nعارض شام سرخ ہے ان سے\nان سے چشم سحر میں بینائی\n\nسبز گنبد میں ہے عجیب کشش\nجس کو دیکھا ہے اس کا شیدائی\n\nنقرئی جالیاں وہ روضے کی\nدے رہی ہیں نظر کو رعنائی\n\nزیر سایہ ہیں سبز گنبد کے\nکتنے خوش بخت ہیں یہ صحرائی\n\nمسئلہ کوئی مسئلہ نہ رہا\nآپ نے جب نگاہ فرمائی\n\nنعت اتری جو خلوت جاں میں\nساتھ پیغام جانفزا لائی\n\nموت کو زندگی بنا ڈالا\nاللہ اللہ یہ مسیحائی\n\nمجھ گنہگار کے لیے شہزادؔ\nنعت کتنی بشارتیں لائی"
  },
  {
    "id": 51,
    "title": "نعت شریف",
    "description": "لے کے رحمت شہ ابرار چلے آتے ہیں\nدیکھئے دیکھئے سرکار چلے آتے ہیں\n\nظلمت جاں کے لیے نور کا ساماں بن کر\nوہ مرے پیکر انوار چلے آتے ہیں\n\nبیٹھ جاتا ہوں لیے سوچ کا خالی کاسہ\nغیب سے نعت کے اشعار چلے آتے ہیں\n\nشدت غم سے نہ گھبرائو اے غم کے مارو\nاک ذرا صبر کہ غم خوار چلے آتے ہیں\n\nدیکھنے شان شفاعت کا حسیں نظارہ\nجوق در جوق گنہگار چلے آتے ہیں\n\nجن و انسان و ملک جن کے مطیع و تابع\nساری مخلوق کے سردار چلے آتے ہیں\n\nزور جب بڑھنے لگے وقت کے فرعونوں کا\nمصطفی بن کے مددگار چلے آتے ہیں\n\nروضۂ پاک پہ بے سمجھے نہیں آ جاتے\nفیض ملتا ہے تو بیمار چلے آتے ہیں\n\nبھول ہو جاتی ہے شہزادؔ ہمیشہ مجھ سے\nدستگیری کو وہ ہر بار چلے آتے ہیں"
  },
  {
    "id": 52,
    "title": "نعت شریف",
    "description": "طور کے طالبوں کو طور ملے\nہم کو بس قربت حضور ملے\n\nمجھ سے کم فہم کو بھی میرے حضور\nآپ کی ذات کا شعور ملے\n\nفرش تا عرش جس سے دیکھ سکوں\nیا نبی! آنکھ کو وہ نور ملے\n\nروح میری رہے بس آپ کے پاس\nقبر مجھ کو اگرچہ دور ملے\n\nاس کے ایمان کا میں شاھد ہوں\nنعت سن کر جسے سرور ملے\n\nذکر شہزادؔ جب چھڑے ان کا\nقلب بیتاب کو سرور ملے"
  },
  {
    "id": 53,
    "title": "نعت شریف",
    "description": "ترے در کی گدائی مل گئی ہے\nہر اک غم سے رہائی مل گئی ہے\n\nتری خوشبو رچی باطن میں جب سے\nدل و جاں کو صفائی مل گئی ہے\n\nترے لطف و کرم سے عاصیوں کو\nردائے پارسائی مل گئی ہے\n\nحضوری ہو اگر ان کی میسر\nتو یوں سمجھو خدائی مل گئی ہے\n\nملے ہیں جب سے سرکارِ دو عالم\nمجھے ساری خدائی مل گئی ہے"
  },
  {
    "id": 54,
    "title": "نعت شریف",
    "description": "جوق در جوق آئے نظر قافلے\nسوئے طیبہ ہیں محو سفر قافلے\n\nآئو آئو سلامی کو ان کی چلیں\nجا رہے ہیں نبی کے نگر قافلے\n\nکھو گئے جلوئہ نور میں سربسر\nدیکھ کر نور والے کا گھر قافلے\n\nبڑھتا جاتا ہے اتنا ہی ذوق سفر\nجتنا کرتے ہیں طے رہگزر قافلے\n\nلوٹ آئے تو ہیں شہر سرکار سے\nدل وہیں چھوڑ آئے مگر قافلے\n\nجب نظر سے وہ شہزادؔ اوجھل ہوئے\nکر گئے میری آنکھوں کو تر قافلے"
  },
  {
    "id": 55,
    "title": "نعت شریف",
    "description": "مہر و مہ میں تری نظر سے نور\nتارے لیتے ہیں تیرے گھر سے نور\n\nگلستانِ نبی کا کیا کہنا!\nپھوٹتا ہے ہر اک شجر سے نور\n\nمصطفی کے قدم لگے ہیں اسے\nکیسے نکلے نہ رہگزر سے نور\n\nمختصر قصۂ شب معراج\nنور سے تا بشر ، بشر سے نور\n\nپہلے پھٹتی ہے پو مدینہ میں\nپھر نکلتا ہے ہر سحر سے نور\n\nہو عطا مجھ کو نور سیرت کا\nتیرگی ہو مرے اثر سے نور\n\nشمع دل میں جلائی ہے شہزادؔ\nلے کے بطحا کے تاجور سے نور"
  },
  {
    "id": 56,
    "title": "نعت شریف",
    "description": "بہاروں کی جاں ہے بہار مدینہ\nہے جنت سے بڑھ کر دیارِ مدینہ\n\nعجب حق نے رکھی ہے تاثیر اس میں\nشفا ہی شفا ہے غبار مدینہ\n\nفرانس اور لندن سے کیا کام مجھ کو\nمیں ہوں رہرو رہگزار مدینہ\n\nدھنک ، روشنی ، رنگ انوار ، خوشبو\nگل و گلستاں سب نثار مدینہ\n\nملے مجھ کو زندانِ غم سے رہائی\nہو چشم کرم تاجدار مدینہ\n\nتصور میں شہزادؔ ہے سبز گنبد\nنگاہوں میں نقش و نگارِ مدینہ"
  },
  {
    "id": 57,
    "title": "نعت شریف",
    "description": "مدینے کے شام و سحر اللہ اللہ\nوہ پرنور دیوار و در اللہ اللہ\n\nمری رات مکے کی گلیوں میں گزرے\nمدینہ میں دن ہو بسر اللہ اللہ\n\nنبی کے نشان قدم کی بدولت\nہے روشن مری رہگزر اللہ اللہ\n\nسکھایا نبی کا ادب خود خدا نے\nیہ تعظیم خیرالبشر ، اللہ اللہ\n\nسفر ہیں حسیں سے حسیں ترجہاں میں\nمدینے کا لیکن سفر ، اللہ اللہ\n\nخدا کے خزانے کے قاسم ہیں لیکن\nنہیں پاس کچھ مال و زر اللہ اللہ\n\nمہینوں نہ جلتا تھا چولہا جہاں پر\nوہ شاہِ دو عالم کا گھر اللہ اللہ\n\nوہ شہزادؔ شاہد ہیں از روئے قرآں\nنہیں کس پہ ان کی نظر اللہ اللہ"
  },
  {
    "id": 58,
    "title": "نعت شریف",
    "description": "ان کے بارے سوچنا اچھا ہے بس\nان کی جانب دیکھنا اچھا ہے بس\n\nکارواں کی کوئی کل سیدھی نہیں\nکارواں کا رہنما اچھا ہے بس\n\nاور سارے راستے باطل ہوئے\nاک نبی کا راستہ اچھا ہے بس\n\nآپ ہی سے ہے مری وابستگی\nآپ ہی سے رابطہ اچھا ہے بس\n\nمانگنے سے کر دیا ہے بے نیاز\nاب اسی در پر گدا اچھا ہے بس\n\nنعت کہتا ہے شہ کونین کی\nیہ عمل شہزادؔ کا اچھا ہے بس"
  },
  {
    "id": 59,
    "title": "نعت شریف",
    "description": "کیا لکھے کوئی بشر شان رسول\nہے خدا ہی مرتبہ دان رسول\n\nوہ پریشاں حال ہو ممکن نہیں\nہاتھ میں جس کے ہے دامانِ رسول\n\nیاالٰہی! آج کیوں مظلوم ہیں\nساری دنیا میں غلامان رسول\n\nحیدر و صدیق و فاروق و بلال\nایسے ہیروں سے ہے پُر کانِ رسول\n\nمست رہتے ہیں فرشتے بھی یہاں\nمصدر فرحت ہے ایوان رسول\n\nقرۃ العین نبی ہیں فاطمہ\nعائشہ ہیں راحت جان رسول\n\nوالدین و جان و مال اولاد سب\nکیجئے شہزادؔ قربان رسول"
  },
  {
    "id": 60,
    "title": "نعت شریف",
    "description": "جس میں ان کی رضا نہیں ہوتی\nوہ عبادت روا نہیں ہوتی\n\nنیکیاں اور رہ بھی جاتی ہیں\nنعت لیکن قضا نہیں ہوتی\n\nدل میں یوں بس گئی ہے یادِ نبی\nاب تو پل بھر جدا نہیں ہوتی\n\nہائے افسوس ایسی محفل پر\nجس میں ان کی ثنا نہیں ہوتی\n\nحسرت اس دن پہ آتی ہے جس دن\nنعت خیرالوریٰ نہیں ہوتی\n\nلذت نفس جس کا باعث ہو\nہم سے ایسی وفا نہیں ہوتی\n\nجس میں شامل نہ ہو درود و سلام\nوہ دعا تو دعا نہیں ہوتی\n\nہو نہ شہزادؔ گر خدا کا کرم\nمدحت مصطفی نہیں ہوتی"
  },
  {
    "id": 61,
    "title": "نعت شریف",
    "description": "کرم ان کا جو ہوتا جا رہا ہے\nدلوں سے زنگ اترا جا رہا ہے\n\nنگاہیں سبز گنبد پر جمی ہیں\nیہیں مرنے کا سوچا جا رہا ہے\n\nمیں جو ہوں میرے آقا جانتے ہیں\nنہیں ہوں وہ جو سمجھا جا رہا ہے\n\nکوئی ثانی نہیں شاہِ زمن کا\nہر اک لمحہ یہ کہتا جا رہا ہے\n\nچلو بک جائیں ہم جا کر مدینے\nسنا ہے بھائو اچھا جا رہا ہے\n\nعنایات در خیرالوریٰ سے\nرخ ہستی نکھرتا جا رہا ہے\n\nقدم کا کام لو شہزادؔ سر سے\nمدینے کو یہ رستہ جا رہا ہے"
  },
  {
    "id": 62,
    "title": "درود پاک",
    "description": "کیوں کر نہ ہم ہوں وقف برائے درود پاک\nپڑھتا ہے خود درود خدائے درود پاک\n\nچہرہ ہے نور سنت آقا سے مستنیر\nجلوہ نما ہے دل میں ضیائے درود پاک\n\nاللہ رے یہ ذکر محمد کی رفعتیں\nمسجد سے آ رہی ہے صدائے درود پاک\n\nصل علیٰ کا ذکر ہی ہونٹوں پہ ہو مدام\nکر دیں تمام ورد فدائے درود پاک\n\nبخشش ، خدا کی رحمتیں دید رخ رسول\nکتنی عظیم تر ہے جزائے درود پاک\n\nلگتی نہیں ہیں تلخ زمانے کی سختیاں\nبے شک ہے یہ بھی ایک عطائے درود پاک\n\nخوف و خطر ہو کیا اسے دوزخ کی آگ کا\nاوڑھی ہوئی ہو جس نے ردائے درود پاک\n\nآتا ہے اس کے ساتھ عبادت پہ اک نکھار\nپھیکی دعا میں چاشنی لائے درود پاک\n\nاس گھر کے بام و درپہ برستی ہیں رحمتیں\nجس گھر سے اٹھ رہی ہو صدائے درود پاک\n\nہوتے ہیں خوش ملائکہ شہزادؔ عرش پر\nجب بھی کوئی کسی کو سنائے درود پاک"
  },
  {
    "id": 63,
    "title": "نعت شریف",
    "description": "شان شمس الضحیٰ لکھی جائے\nنعت خیرالوریٰ لکھی جائے\n\nسیرت و صورت رسول کی بات\nجا بجا جا بجا لکھی جائے\n\nایک چٹھی بنام شاہ عرب\nبرجبین صبا لکھی جائے\n\nان کی عظمت کا ہو بیاں کیوں کر\nکیسے ان کی ثنا لکھی جائے\n\nتھا یہ پروردگار کو منظور\nان کی ہر اک ادا لکھی جائے\n\nحرمت حرف کا تقاضا ہے\nنعت احمد سدا لکھی جائے\n\nنعت ہے بحر بیکراں شہزادؔ\nزکجا تا کجا لکھی جائے"
  },
  {
    "id": 64,
    "title": "نعت شریف",
    "description": "جنگ و جدل میں امن کا پرچم ہے تیری ذات\nزخم جگر کے واسطے مرہم ہے تیری ذات\n\nتیری تجلیات سے عالم ہے مستنیر\nمہر منیر ، نور مجسم ہے تیری ذات\n\nتیرا کرم ہے اپنے پرائے کے واسطے\nخیرالوریٰ و رحمت عالم ہے تیری ذات\n\nکیوں کر نہ ہو وہ شخص زمانے کا رہنما\nجس کی نظر کے سامنے ہر دم ہے تیری ذات\n\nمہکا ہے تیرے فیض سے گلشن کا پھول پھول\nسامان خوشگواریٔ موسم ہے تیری ذات\n\nآباد تیرے واسطے مکہ کیا گیا\nوجہ ظہور چشمۂ زم زم ہے تیری ذات\n\nرہتا ہے اس خیال سے شہزادؔ مطمئن\nاک مغفرت کے واسطے کیا کم ہے تیری ذات"
  },
  {
    "id": 65,
    "title": "نعت شریف",
    "description": "سوئے طیبہ چل پڑا اچھا ہوا\nدل جہاں سے اٹھ گیا اچھا ہوا\n\nان کی چشم لطف سے ہر اک عمل\nابتدا تا انتہا اچھا ہوا\n\nفرق اچھے اور برے اعمال میں\nان کے آنے سے ہوا اچھا ہوا\n\nبے مزہ تھی زندگی ان کے بغیر\nآ گئے خیرالوریٰ اچھا ہوا\n\nبندگی معیار سے واقف ہوئی\nاز طفیل مصطفی اچھا ہوا\n\nخوب ان کے لطف سے سب خوبیاں\nان سے ہر اک سلسلہ اچھا ہوا\n\nچھوڑ کر شہزادؔ شاہی کا خیال\nبن گیا ان کا گدا اچھا ہوا"
  },
  {
    "id": 66,
    "title": "خیرالانام",
    "description": "اے حبیب حق تعالیٰ الصلوۃ والسلام\nصاحب اخلاق اعلیٰ الصلوۃ والسلام\n\nماہ طیبہ مہر بطحا الصلوۃ والسلام\nاے ضیائے روئے کعبہ الصلوۃ والسلام\n\nاے مراد قلب موسیٰ الصلوۃ والسلام\nاے سکون روح عیسیٰ الصلوۃ والسلام\n\nگونج ہے صل علیٰ کی خلد کے باغات میں\nقدسیوں کا ہے ترانہ الصلوۃ والسلام\n\nتیری برکت سے مزّین ہو گیا صحن حرم\nتجھ سے روشن ہے مدینہ الصلوۃ والسلام\n\nہم گنہگاروں کو اپنے لطف کی خیرات دو\nدرد دل کا ہو مداوا الصلوۃ والسلام\n\nہم فقیروں کو خدا کے بعد ہے تم سے امید\nبے کسوں کو دو سہارا الصلوۃ والسلام\n\nجگمگاتی ہیں دلوں کی بستیاں اس ذکر سے\nہے محبت کا تقاضا الصلوۃ والسلام\n\nقبر میں میری جب آئیں گے رسولوں کے رسول\nمیں کھڑا ہو کر کہوں گا الصلوۃ والسلام\n\nخالق کون و مکاں کو ہے یہی نغمہ عزیز\nہے فرشتوں کا وظیفہ الصلوۃ والسلام\n\nفرش والوں کو ہے تیری اک جھلک کی آرزو\nعرش والوں کی تمنا الصلوۃ والسلام\n\nزندگی میں قبر میں محشر کے رنج و یاس میں\nکامیابی کا طریقہ الصلوۃ والسلام\n\nکیجئے شہزادؔ کی جانب سے یہ ہدیہ قبول\nمیرے مولا میرے آقا الصلوۃ والسلام"
  },
  { "id": 67, "title": "ثناء کا موسم", "description": "" }
]
