[
  {
    "id": 1,
    "title": "انتساب",
    "description": "اہلِ محاسن کے نام\nاُحِبُّ الصَّالِحِینَ وَ لَسْتُ مِنْہُم\n\nلَعَلَّ اللّٰہَ یَرْزُقُنِیْ صلاح\n_________________________________\n\nمیں صالحین سے محبت رکھتا ہوں گو ان میں سے نہیں ہوں شاید اللہ تعالیٰ(اس باعث) میری بھی اصلاح فرما دے\nمحاسن … ایک تاثر\n\nحضورِ اکرم اکی اتباع کرنے والے اور ان کے لائے ہوئے پیغام کو عملی شکل میں باقی رکھنے کی کوشش کرنے والے لوگ اللہ تعالیٰ کی محبت کے حق دار بن جاتے ہیں ۔اللہ تعالی جن لوگوں سے محبت فرماتا ہے ان کی محبت اپنی مخلوق کے دلوں میں بھی پیدا فرمادیتا ہے۔ اس لیے کہ اس نے پہلے تو اپنے حبیب جنابِ محمد مصطفیا کی زبانی یہ اعلان کروایا……:’’فَا تَّبِعُوْنِْی یُحْبِبْکُمُ اللّٰہُ……الخ ‘‘……(تم میرے فرمانبردار ہوجاؤ اللہ تمہیں دوست رکھے گا …آلِ عمران …آیت ۳۱)۔ پھر اللہ تعالیٰ نے یہ اعلان فرمادیا … اِنَّ الَّذِیْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ سَیَجْعَلُ لَھُمُ الرَّحْمٰنُ وُدًّاO ترجمہ:-بے شک وہ جو ایمان لائے اور اچھے کام کیے ان کے لیے رحمن محبت [عام] کردے گا ۔                                                                (سورہ مریم،آیت: ۹۶)\nاللہ تعالیٰ نے اپنے حبیب جنابِ محمدٌ رَّسول اکی نعت لکھنے کاذوق بھی شعراء میں اپنے اسی قانون کے تحت پیدا فرمایاجو ہر بالغ نظر اور سلیم الفطرت انسان کی طبیعت کا خاصہ بنادیا گیا ہے………یعنی ’’خیر‘‘ سے محبت کرنا………اور یہ طے ہے کہ اصل خیر صرف اور صرف انسان کی سیرت کے ذریعے ہی پھیلتا ہے۔ حضورِ اکرم  ا کی حیاتِ طیبہ سے خیر کی کرنیں پھوٹیں تو کائنات جگمگا گئی اور ان کی اتباع کرنے والوں کی سیرت سے جو خیرپھیلا اس نے دلوں کی کائنات کو روشن کردیا۔منقبت کی تخلیق اسی جذبہء خیرطلبی کے زیرِ اثر ہوتی ہے۔\n\nعلامہشہزاد مجددی نوجوان علماء میں ایک ثقہ عالم کے طورپر معروف ہیں ۔جب کوئی عالم شعر گوئی کی طرف متوجہ ہوتا ہے تو اکثر دو طرح کی صورتِ حال سامنے آتی ہے۔یا تو علم ،شاعری میں ڈھل کر شعر کے آفاق کو مزید وسعت دینے کا سبب بنتا ہے یا فنِ شاعری پر مسلط ہوکر شعریت کی موت کا سبب بنتا ہے۔مگر شہزاد مجددی کے ہاں علم اور شاعری کی خو ش آئند رفاقت نے سلیقے، قرینے اور توازن کی ایک ایسی مثال قائم کی ہے جس میں شعریت کا حسن بھی برقرار ہے اور علم کی روشنی بھی جزوِ شعر بن کے قاری کو متاثر کرتی ہے۔یہ بات میں نے ان کے مجموعی کلام کے تناظر میں کہی ہے۔ ان کے دو نعتیہ مجموعے میری نظر سے گزر چکے ہیں اور اب’’ محاسن ‘‘ اپنے پورے ادبی اور روحانی محاسن کے ساتھ پیشِ نظر ہے۔محاسن کا مطالعہ صرف ہمیں شاعر کے روحانی رشتوں سے آشنا نہیں کراتا بلکہ قرآنِ مجید ، احادیثِ نبوی اور مسلم تاریخ کا فہم و شعور بھی عطا کرتا ہے۔\nکتاب میں شامل مناقب میں شاعر کا اخلاص، محبت اور خیر طلبی کو عام کرنے کے جذبے کا شعری محاسن کے ساتھ نمایاں ہونا اس بات کی علامت ہے کہ شہزاد مجددی اپنے تخلیقی سفرمیں بھی اپنے ان تمام لوازمات کے ساتھ کامیابی سے ہم کنار ہوئے ہیں۔کتاب کے انتساب نے ان کی منقبت نگاری کی غایت کو جس خوبی سے اجاگر کیا ہے وہ سراسر اخلاص پر مبنی ہے اور اس سفر میں اخلاص ہی کامیابی کی ضمانت ہے۔\n\nسید صبیح الدین رحمانی\nمدیرــ’’ نعت رنگ‘‘\n\n(نعت ریسرچ سینٹر انٹرنیشنل)\nکراچی"
  },
  {
    "id": 2,
    "title": "تقریظ",
    "description": "علامہ شہزاد مجددی ابھی نوجوان ہیں لیکن ایک ہمہ صفت موصوف شخصیت کی حیثیت سے معروف ہوچکے ہیں ،یہ ایک مستند عالم ہیں لیکن انھوںنے صرف نصاب کی تحصیل پر اکتفاء نہیں کیابلکہ اپنے مطالعے کو بڑی وسعت دی ہے،جدید وقدیم علوم کی شناوری کے ساتھ ساتھ یہ عمل کی دشوار گزار گھاٹیوں سے بھی بڑی کامیابی سے گزرے ۔کسی شخصیت میںعلم اورزہد یکجاہو جائیںتو بسااوقات وہ اپنے بارے میں کسی مغالطے کا شکار بھی ہوجاتی ہے۔لیکن شہزاد مجددی فقرو درویشی کی طرف مائل ہوئے اوراس طرح اللہ تبارک وتعالیٰ نے انھیں زاہدِ خشک ہونے سے بچالیا۔صوفی عشق و محبت کی کیفیت سے سرشارہوتے ہیں اوریہ کیفیت اکثر اپنے اظہار کے لیے شعر کا اسلوب اختیار کرتی ہے۔شہزاد مجددی ایک معیاری اورصاحب اسلوب شاعر کی حیثیت سے بھی سامنے آئے ہیں۔\nزیر نظر مجموعہ ان کے اس کلام پر مشتمل ہے جو مختلف شخصیات کی مدح میں کہا گیا ہے،اس میں اردو ،فارسی اورپنجابی زبان میں کہے گئے مناقب یکجاکردیے گئے ہیں ۔منقبت کا دائرہ بظاہر محدود نظرآتا ہے لیکن شہزاد مجددی نے مناقب کہتے ہوئے بھی مضامین کے تنوع کو برقرار رکھا ،اورطبیعت کی سرشاری اورحسن تغزل کا بھرپور اظہارکیا ہے۔ان کا مطالعہ چونکہ بہت وسیع ہے تو جب وہ کسی بھی شخصیت کی مدح میں قلم اٹھاتے ہیں تو اس کی شخصیت، اس کے دور اوراس کے نمایاں کارنامے بڑی خوبصورت تلمیحات کے ساتھ سامنے لے آتے ہیں،ان کے ممدوح چونکہ کوئی ’’نوابانِ نان پارہ‘‘نہیں ہیں لہذا وہ جس شخصیت کا ذکر بھی کرتے ہیںیوں محسوس ہوتا ہے کہ انھوںنے اس کی محبت اوراس کے محاسن کو اپنی روح میں اتار لیا ہے۔مجھے بطورِ خاص جس پہلو نے بہت متاثر کیا ہے وہ یہ ہے کہ علامہ نے منقبت کہتے ہوئے ایک صوفی کی وسیع المشربی کا بھر پوراظہارکیا ہے۔وہ خلفاء راشدین کی عالیٰ مرتبت شخصیت کا بھرپور وابستگی کے ساتھ تذکرہ کرتے ہیںاور اس کے ساتھ اہل بیت اطہار کے ذکر کو بھی کمالِ حلاوت اور کمالِ احترام کے ساتھ چھیڑتے ہیں۔وہ خود نقشبندی مشرب سے تعلق رکھتے ہیںلیکن تمام سلاسل کے بزرگوںکا ذکر خیر کرتے ہیںاوران کی عقیدت ومحبت میں کوئی کمی محسوس نہیں ہوتی ، انھوںنے اپنے مشائخ سلسلہ سے بھر پور فیض اٹھایا ہے لیکن اس کے ساتھ ساتھ وہ اپنے زمانے کے بہت سے معروف اورباکمال افراد کی صحبت اوررفاقت سے بھی استفادہ کرتے ہوئے نظر آتے ہیں۔اور اپنی شاعری میں ان کے محاسن کا بھرپوراعتراف بھی کرتے ہیں۔فی زمانہ معیاری زبان اوردلکش تراکیب کے ساتھ کلام کرنے والے لوگ بہت کم ہیں۔ شہزاد مجددی نے زبان کا ایک خاص معیار اختیار کیا ہے اور اسے ہر جگہ برقرار بھی رکھا ہے۔ان کی جولانی طبع اردو کے ساتھ فارسی اورپنجابی میں بھی اسی طرح رواں نظر آتی ہے۔\n\nمضامین کے تنوع ،زبان کے معیار اورحسن تراکیب کے ساتھ شہزاد مجددی فن شعر کی نزاکتوں سے بھی پوری طرح واقفیت رکھتے ہیں۔انھوں نے مدح و منقبت کے میدان میں بھی بڑی ندرت دکھائی ہے اوربڑی خوش اسلوبی کے ساتھ مختلف زمینوں پر طبع آزمائی کی ہے۔خاکسار چونکہ شعر وادب کا بھی ثقہ نقاد نہیں ہے کہ وہ’’ محاسن ‘‘کے مکمل محاسن کا احاطہ کرسکے ۔کلام کا مطالعہ کرنے کے بعد جو چند باتیں مجھے فوری طور پر محسوس ہوئیں وہ عرض کردی گئیں۔یہ حسن اتفاق ہے کہ جس وقت یہ مسودہ مجھے تفویض کیا گیا میں دیارِ رسول صلی اللہ علیہ وسلم کی حاضری اوربیت اللہ کی زیارت کے لیے روانہ ہورہا تھا۔دورانِ سفر شہزاد مجددی کے کلام کا مطالعہ میرے لیے محبت اورخدمت کی تاریخ کا ایک سفر بھی ثابت ہوا۔\nزاویہ نشین\n\nرضاء الدین صدیقیؔ\nـ’’مناقب سے محاسن تک‘‘\n\nاللہ والوں کے مناقب و محاسن ہوں یا اُن کے تزکار و اذکار ہوں،بات ان کے فضائل و کمالات کی ہو یا سیرت و سوانح کی، دراصل یہ سبھی سلسلے ’’فَاذْکُرُوْنِیْ اَذْکُرْکُمْ‘‘ کی نہایت خوش کن اور ایمان افروز تفسیر و توضیح کا درجہ رکھتے ہیں۔جب اللہ کا مقرب اور کامل بندہ ذکرحقیقی کے مدارج و مراحل کو بخوبی طے کرتے ہوئے مذکور کی بارگاہ تک رسائی حاصل کر لیتا ہے تو ایک مقام آتا ہے جب ذاکر،مذکور ہوجاتاہے۔اور اسے پہلا انعام بارگاہ الٰہی سے اسی مذکوریت کی صورت میں عطا ہوتا ہے چنانچہ حدیثِ قدسی میںہے:\nاذاذکرنی فی نفسہٖ ذکرتہٗ فی نفسی……الخ (متفق علیہ)\n\nترجمہ:-جب بندہ مجھے اپنے دل میں یاد کرتا ہے تو میںبھی اسے بطریق خفی یاد کرتا ہوں اور جب وہ مجھے کسی محفل میںیاد کرتا ہے تو میں اسے اس سے بہتر محفل (یعنی ملائکہ کی محفل) میںیاد کرتا ہوں۔اسی طرح فرمایا:\nاَنَا جَلِیْسٌ مَعَ مَن ذَکَرَنِیْ\n\nترجمہ: -میں اپنے ذاکر کا ہم نشین ہوتا ہوں۔\nپھر فرمایا کہ جو ان کے پاس بیٹھ جائے وہ بھی محروم نہیںرہتا۔ بقول عارف رومی رحمہ اللہ\n\nہر کہ خواہد ہم نشینی با خدا\nاو نشیند در حضور اولیاء\n\nیوں ذاکر کی ہم نشینی مذکور کی مجالست کا فائدہ دیتی ہے اور اللہ والوں کا ذکر کرنا خود سنت الٰہیہ قرار پاتا ہے۔\nحضرات انبیاء کرام، اہل بیت اطہار،صحابہ کرام علیہم الرضوان اور اولیاء عظام کے تزکار و واقعات، قصص و احوال اور معجزات و کرامات تو خود قرآن پاک میں متعدد مقامات پر بیان ہوئے ہیں۔ اور ان مناقب و محاسن کا بیان یقینامبنی بر حکمت ہے۔\n\nحضرت سیّدالطائفہ سیدنا جنید بغدادی رحمہ اللہسے ایک موقع پر دریافت کیا گیا تھا،حکایات سے مریدوں کو کیا فائدہ پہنچتا ہے:تو آپ نے فرمایا:\nالحکایات جندمن جنود اللّٰہ یقوی بھاقلوب المریدین۔\n\n(رسالہ قشیریہ ، ص:۴۰۸۔باب الدلا)\nترجمہ:- مشائخ کی حکایات خدا کے لشکروں میں سے ایک لشکر ہے،جس سے مریدوں کے دل قوی ہوتے ہیں۔\n\nاس پر آپ سے سوال کیا گیا کہ کیا آپ کے اس قول پر کوئی شاہد ہے؟ آپ نے جواب دیا، ہاں،اور وہ اللہ جل مجدہٗ الکریم کا یہ فرمان ہے:\nوَکُلًّا نَّقُصُّ عَلَیْکَ مِنْ اَنْبَآئِ الرُّسُلِ مَا نُثَبِّتُ بِہٖ فُؤَادَکَج (ہود:۱۲۰)\n\nترجمہ:-اور ہر چیز کو ہم بیان کرتے ہیںتجھ سے پیغمبروں کی خبروں سے وہ چیز کہ جس سے ہم ثابت رکھتے ہیںتیرادل۔\nمولانا جامی قدس اللہ سرّہ نے اس فرمان کو یوں منظوم کیا ہے۔\n\nہجوم نفس و ہوا کز سپاہ شیطانند\nچو زور بر دل مرد خدا پرست آرد\n\nبجز جنود حکایات رہنمایاں را\nچہ تاب آنکہ براں رہزناں شکست آرد\n\nمولانا جامی  علیہ الرحمہلکھتے ہیں:\nشیخ الاسلام عبداللہ انصاری ہروی قدس سرہٗ نے اپنے مریدوں کو وصیّت کی کہ، ہر ایک پیر کا کوئی کلام یاد کر لو اگر ایسا نہ کر سکو تو ان کا نام یاد رکھو تاکہ اس سے فائدہ اٹھائو۔\n\n(بہارستان جامی ـ ۶ ؎ )\nارشادنبوی ا ہے: المرء مع من احبَّ۔(بخاری)\n\nقیامت کے دن بندہ اس کے ساتھ ہوگا جسے وہ دوست رکھتا تھا۔\nچنانچہ اللہ والوں کی محبت اور دوستی کا ایک تقاضا ان کے محاسن و مناقب کا بیاں اور تذکرہ کرنا بھی ہے۔\n\nحدیث شریف میں ہے: اُذْکِرُوْمَحَاسَنْ مَوْتَاکُمْ ۔\nاپنے مرحومین کی خوبیاں بیان کیا کرو۔ اور ان کی کوتاہیوں سے صرف نظر کیا کرو۔\n\nپھر ان صالحین کے تذکرے کو گناہوں کا کفارہ بھی قرار دیاگیا ہے۔\nارشاد نبوی ہیـ: ذکرالصالحین کفارۃ۔        (الجامع الصغیر:۲/۱۹)\n\nاللہ کے نیک بندوں کا ذکر گناہوں کا کفّارہ ہے۔\nیہی وجہ ہے کہ قرآن و حدیث میںبھی انبیاء ، صدیقین ، شہداء اور صالحین کا تذکرہ بطور خاص کرتے ہوئے انھیں بہترین ساتھی قرار دیا گیا ہے۔\n\nوَحَسُنَ اُوْلٰٔیکَ رَفِیْقاً۔\nحضرت امام مالک صالفتح کے آخری رکوع کو صحابہ کرام کی منقبت کا بہترین شہکار قرار دیتے ہیں۔\n\nآپ فرمایا کرتے تھے کہ ہمارے بزرگ ہمیں ابوبکر صدیق اور عمر فاروق رضی اللہ عنہما کی سیرت آیات قرآن کی طرح سکھایا کرتے تھے۔\nکیوں نہ ہو خود ختمی مرتبت حضور رسالت مآب ا نے بھی منقبت نگاری کی حوصلہ افزائی فرمائے ہوئے حضرت حسّان بن ثابت رضی اللہ عنہ سے فرمائش کر کے حضرت یارِغارومزار سیدنا ابوبکر صدیق رضی اللہ عنہ کی منقبت سماعت فرمائی اور یوں اس کارخیرکو اپنی سنّت بنا دیا۔\n\nمستدرک حاکم میں ہے!\nترجمہ :-حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے:\n\nبے شک رسول اللہ  انے حضرت حسان رضی اللہ عنہ سے فرمایا ،کیا تم نے ابوبکر کے بارے میںکوئی شعر کہا ہے انہوں نے کہا: جی ہاں۔آپ انے فرمایا: پڑھومیں سنتا ہوں ۔\nحضرت حسان نے کہا:\n\nوَثَانِی اثنین فی الغار المنیف وَقَد\nطَافَ العُدُوّبہٖ اِذ صَاعِدَ الجَبَلَا\n\nوَکَانَ حِبّ رسُوُلِ اللہ قد علموا\nمِنَ الَبرِیَّۃ لم یَعدلُ بِہٖ الرَّجُلا\n\nمفہوم:اور جب دشمن ان کی تلاش میں پہاڑ پر چڑھے جبکہ وہ محاصرہ کئے ہوئے تھے اور ابوبکر غار (ثور) میں دو میں سے ایک تھے اورآپ رسول اللہ ا کے محبوب تھے اور تمام صحابہ جانتے تھے کہ اس خصوصیت میں آپ کا کوئی شریک نہیں ہے۔\nپس رسول اللہ ا مسکرائے یہاں تک کہ آپ کے پچھلے دندان مبارک دکھائی دینے لگے پھر فرمایا اے حسان !تم نے سچ کہا وہ ایسا ہی ہے جیسا تم نے کہا ہے۔(اسے ابن عدی اور ابن عسا کر نے روایت کیا ہے )۔\n\n(مستدرک حاکم :عن حبیب ابن ابی حبیب،67/2 :رقم:4422 )\nگویا اللہ کے پیاروںکی منقبت لکھنے، کہنے اور سننے کا سلسلہ نعت شریف کے ساتھ ہی شروع ہو گیا تھا اور اس سنت کے فروغ کا سہرا بھی شاعر دربار رسالت حضرت حسان بن ثابتؓ کے سرمبارک پر سجا ہے۔ دیگر بزرگ اور اکابر صحابہ کرام کے علاوہ حضرت حسان کے اشعار میں حضرت روح القدس سیدنا جبریل امین علیہ السلام کی منقبت کے اشعار بھی ملتے ہیں۔ ایک موقع پر آپ نے دوران نعت یوں شعر عرض کیا:\n\nوجبریلٌ رسول اللّٰہ فینا\nو رُوحٌ القُدْس لَیسَ لَـہٗ کفائُ\n\nترجمہ:-ہمارے درمیان اللہ کے پیغمبر جبریل موجود ہیں اور روح القدس کا کوئی ہم پلہ نہیں ہے۔\nچنانچہ پیش نظر مجموعۂ مناقب ’’محاسن‘‘ میں اس نادر سنت کے احیاء کا شرف بھی راقم کے حصہ میں آیا ہے۔ اعلیٰ حضرت فاضل بریلوی کے دیوان ’’حدائق بخشش‘‘ میں بھی بعض نعتوں میں مناقب جبریل پر مبنی اشعار ملتے ہیں۔\n\nعرش سے مژدہ بلقیس شفاعت لایا\nطائر سدرہ نشیں مرغ سلیمان عرب\n\nپائے جبریل نے سرکار سے کیا کیا القاب\nخسرو خیل ملک ! خادم سلطان عرب\n\nحضور ا کی والدہ ماجدہ سیدہ آمنہ سلام اللہ علیہا کی منقبت بھی زینت افزائے محاسن ہے۔ امہات المؤمنین، اہل بیت اطہار، صحابہ کبار اور اولیاء و علمائے کرام کے مناقب بھی شامل کتاب ہیں۔\nاسلامی ادبیات میں عربی، فارسی، اردو اور پنجابی زبانوں کے علاوہ دیگر علاقائی زبانوں میں کہے گئے منظوم مناقب کا معتدبہ ذخیرہ موجود ہے۔ خاص طور پر فارسی و اُردو زبانوں کو اس حوالے سے بہرئہ وافر حاصل ہوا ہے۔ عربی و فارسی لغات نویسوں نے اس لفظ کے حوالے سے جو کچھ لکھا ہے اس کا خلاصہ درج ذیل ہے:\n\nلفظ: منقبت ، مناقب اس کی جمع ہے۔ ’’خصال حمیدہ اور فعل کریم‘‘ مناقب بطور اسم بھی استعمال ہوتا ہے۔ اس کا معنی ہے نیک خصال ، خوش خصال صالح وغیرہ۔\nعربی میں اس کا مادہ ن ق ب ہے۔\n\nاصطلاح میں کسی اللہ والے کی خوبیاں محاسن اور نیک اعمال، اس کے مناقب کہلاتے ہیں۔ نقیب اور نقب زنی وغیرہ بھی اسی مادے سے بنے ہیں۔\nاس مناسبت سے کتب حدیث میں ابواب باندھے گئے ہیں۔\n\nمناقب صحابہ، مناقب اہل بیت، مناقب امہات المؤمنین، مناقب المہاجرین و الانصار، یہاں تک کہ مشکوٰۃ المصابیح میں مناقب ہٰذہ الامۃ کے عنوان سے بھی باب باندھا گیا ہے۔\nبزرگان دین کے تذکرے اور سوانح بھی اس عنوان سے ملتے ہیں جیسے الاختیار فی مناقب الاخیار، محض الصواب فی مناقب عمر بن الخطاب وغیرہ۔ انگریزی میں اس کے لیے درج ذیل الفاظ استعمال ہوتے ہیں۔\n\nمنقبت: مناقب\nCommexpablie acts\n\nEthics feats moral.\nOutstanding Traits virtues.\n\nوغیرہ۔\nعربی اور فارسی کی طرح اردو میں بھی منقبت نگاری کا سلسلہ جاری رہا ہے اور یہ سلسلۂ خیر اردو زبان و ادب کے آغاز سے ہی شروع ہو گیا تھا۔ جوں جوں اردو ادب ترقی کرتا گیا اور زبان پھلتی پھولتی رہی توں توں دیگر اصناف ادب کی طرح حمدونعت اور مناقب نگاری میں بھی پختگی اور رسوخ بڑھتا چلا گیا اور اہل شعر و سخن نے رسمی و اصلی دونوں انداز سے بزرگان دین کی شان میں منقبت گوئی کا سلسلہ جاری رکھا۔ رسمی و اصلی یا حقیقی سے مراد ہے کہ بعض اہل قلم نے محض تبرکاً اور رسماً منقبت لکھی اور بعض اہل حال شعراء اور اہل نسبت صوفیہ نے حقیقی اور اصلی رنگ میں پورے رچائو اور اہتمام سے اپنے اکابر کو خراج عقیدت و محبت منظوم شکل میں پیش کیا چنانچہ ماضی قریب میں ہمیں مجموعہ ہائے مناقب ملتے ہیں۔ جن کے لکھنے والے علمی، ادبی، شعری اور شرعی ہر اعتبار سے پختہ منقبت نگار تھے اور انہوں نے اس روایت کو نہ صرف زندہ رکھا بلکہ اسے بطریق احسن آگے بڑھایا اور اس میں قابل تقلید اضافے بھی کیے۔\n\nان بزرگوں میں اساتذہ فن ولی دکنی، سودا، میردرد، غالب، مومن، اقبال وغیرہ کے بعد انیس، جوش، صبااکبرآبادی، اقبال سہل، عبدالعزیز خالد، سروسہارنپوری، حافظ افضل فقیر، بشیر حسین ناظم، بے چین رجپوری، ریاض مجید، حافظ لدھیانوی، حفیظ تائب اور پیر نصیر الدین نصیر گولڑوی کے نام نمایاں ہیں۔ پیش نظر مجموعہ ’’محاسن‘‘ منقبت نگاری کی ادبی اورعرفانی دونوں روایتوں کا مظہر و عکاس ہے اور اس کی بنیاد وہ مناقب ہیں جوراقم نے وقتاً فوقتاً اپنے مشائخ خصوصاً پیرومرشد رحمہ اللہ کی شان میں بزبان فارسی و اردو لکھے اور آپ کی خدمت میں پیش کرنے کا شرف حاصل کیا۔ اس طرح دیگر اکابر کی شان میں لکھے گئے مناقب کو بھی اس میں شامل کرکے مستقل مجموعہ کی شکل دے دی گئی ہے۔\nفارسی، اردو اور پنجابی زبانوں میں پیش کیا گیا۔ یہ ارمغان عقیدت ہے جو سالہا سال کی ریاضت کا نچوڑ اور مبتدیانہ اظہار عقیدت کا ادنیٰ سا مظاہرہ ہے گویا کہ:\n\nمور مسکیں ہوسے داشت کہ در کعبہ رسد\nدست بر پائے کبوتر زد و ناگاہ رسید\n\n(حسن سجزی)\nکا مصداق ہے۔\n\nحضرت محبوب الٰہی خواجہ نظام الدین اولیاء  رحمہ اللہ فرماتے ہیں:\nذکر الشیخ فی الکلام کالملح فی الطعام او کالرّوح فی الاجسام۔\n\nکلام میں پیرومرشد کا تذکرہ ایسے ہے جیسے کھانے میں نمک یا جسم میںروح سو اس ناچیز نے بھی اس محاسن نگاری کو شکرانہ منعم کا ایک ذریعہ اور بہانہ بنا کر اظہار تشکر کی حقیر سی کوشش کی ہے۔\nگر قبول افتد زہے عزّو شرف\n\nمحمد شہزاد مخلص المجددی\nدارالاخلاص لاہور\n\n۲۵ صفر المظفر ۱۴۳۶ھ\nدسمبر۲۰۱۴ء"
  },
  {
    "id": 3,
    "title": "حصہ اُردو",
    "description": "(عند ذکرالصالحین تتنزل الرحمۃ)\nجہاں صالحین کا ذکر ہو وہاں رحمت اُترتی ہے\n\nمناجات بدرگاہِ قاضی الحاجات\nخدایا رحم فرما سیّدِ کونین کا صدقہ\n\nہماری جھولیاں بھر سرورِ دارین کا صدقہ\nعطا ہو سائلوں کو بارگاہ پاک سے کچھ تو\n\nرفیقِ غار یعنی ثانی اثنین کا صدقہ\nعدالت بخش دے فاروق اعظم کے وسیلے سے\n\nسخاوت کر عطا عثمان ذوالنورین کا صدقہ\nعلوم حیدر کرار سے حصہ ملے ہم کو\n\nعلی کے نام سے پہلے ہے جو اس عین کا صدقہ\nبفیض سیّدہ زہرا حیا و شرم دے ہم کو\n\nحمیّت ہو عطا اس قوم کو حسنین کا صدقہ\nمرا سینہ بھی نورِ حکمت و عرفان سے بھر دے\n\nالٰہی! اہل بیت مصطفی سبطین کا صدقہ\nبچا راہِ صفا کی مشکلوں سے اور خطروں سے\n\nالٰہی! غوث اعظم سید ثقلین کا صدقہ\nبفیض نقشبنداں نقشبندیت پہ رکھ قائم\n\nالٰہی! میرے مرشد میرے نورِ عین کا صدقہ\nکروں خدمت میں تیرے دین کی دن رات یامولا!\n\nنوازش ہو شہِ کونین کی نعلین کا صدقہ\nرہے شہزادؔ کو نسبت سدا شیخ مجدد سے\n\nخدایا قلب ذاکر کے سکون و چین کا صد"
  },
  {
    "id": 4,
    "title": "حمدیہ",
    "description": "کیا خوبیٔ ارقام ہے اللہ اللہ\nہے لفظ کہ الہام ہے اللہ اللہ\n\nاِسمِ ذاتی ہے یہ شہزادؔ کہ اسم اعظم\nہے نام کہ انعام ہے اللہ اللہ"
  },
  {
    "id": 5,
    "title": "حمد باری تعالیٰ",
    "description": "خدا کی یاد میں وہ رنگ لائی بے خودی اپنی\nبدن تو فرش پر تھا ، روح فوق از عرش تھی اپنی\n\nاُسی خلاق کے لطف و عطا کا اک کرشمہ ہے\nشعور بندگی ، اخلاق ، علم و آگہی اپنی\n\nاُسی کے فضل سے عرض و سما میں اک توازن ہے\nاُسی کے لطف پیہم سے رواں ہے زندگی اپنی\n\nکبھی شکل پیمبر میں نوازا نور سے اپنے\nکبھی قرآن کی صورت میں بھیجی روشنی اپنی\n\nخدا کی بندگی کا دور دورہ ہوگیا ہر سو\n’’عرب کے چاند نے پھیلائی جس دم روشنی اپنی‘‘\n\nمنور ہو گئے ظلمت کدے تہذیب عالم کے\n’’عرب کے چاند نے پھیلائی جس دم روشنی اپنی‘‘\n\nدیا پہلے تناسب آدم خاکی کے پتلے کو\nپھر امر کُن کہا اور روح اس میں پھونک دی اپنی\n\nکوئی لمحہ بھی ذکر ذات باری سے نہ خالی تھا\nگزاری یادِ حق میں شاہِ دیں نے ہر گھڑی اپنی\n\nضیائے اسمِ ذاتِ پاک سے دل ہو گیا تاباں\nجمالِ نورِ حق سے چھٹ گئی تیرہ شبی اپنی\n\nبفیض اقتدا و اتباع سرورِ عالم\nہوئی مقبول پیش حق تعالیٰ بندگی اپنی\n\nکرم کا ہر گھڑی شہزادؔ پر تم سائباں رکھنا\nخدایا! کھل گئی ہے آج مجھ پر بے بسی اپنی"
  },
  {
    "id": 6,
    "title": "نعتیہ",
    "description": "بڑھے ہیں حد سے زیادہ مرے گناہ حضور\nنہیں ہے نفس سے ممکن مرا نباہ حضور\n\nمجھے عطا ہو توجہ کا ایسا حصن حصین\nکہ خواہشات کو سوجھے نہ کوئی راہ حضور"
  },
  {
    "id": 7,
    "title": "نعت شریف",
    "description": "ہے آن پڑی مشکل سر پر سرکار کرم فرما دیجے\nفریاد کناں ہے چشم تر سرکار کرم فرما دیجے\n\nکشکول گدائی بن کے کھڑے ہیں منگتے سر سے تابقدم\nکافی ہے کرم کی ایک نظر سرکار کرم فرما دیجے\n\nہر سمت ہیں غفلت کے سائے باہم ہیں مقابل ماں جائے\nبھٹکی پھرتی ہے نوعِ بشر سرکار کرم فرما دیجے\n\nاے زہرا وزینب کے بابا! کمیاب ہوئی ہے چشم حیا\nبے راہ روی سی ہے گھر گھر سرکار کرم فرما دیجے\n\nادراک سے عاری قوم ہوئی ، خواہش کی پجاری قوم ہوئی\nاب ہم کو نہیں ہے اپنی خبر سرکار کرم فرما دیجے\n\nہونٹوں پہ ثناء کے ہوں نغمے ہاتھوں میں درودوں کے گجرے\nقسمت میں ہو یوں طیبہ کا سفر سرکار کرم فرما دیجے\n\nہر وقت یہاں ہو مدح و ثنا ہر سمت ہو ذکر صل علیٰ\nہو نعت نگر شہزادؔ کا گھر سرکار کرم فرما دیجے"
  },
  {
    "id": 8,
    "title": "شانِ روح القدس علیہ السلام",
    "description": "زینتِ خلدِ بریں مرغ سلیمانِ عرب\nسب فرشتوں سے حسیں مرغ سلیمانِ عرب\n\nبلبلِ باغِ دنیٰ ، نغمہ گر حمد و ثنا\nطائرِ سدرہ نشیں مرغ سلیمانِ عرب\n\nمرسلِ ربِّ علا ، حاملِ وحی مولا\nیعنی جبریلِ امیں مرغ سلیمانِ عرب\n\nزمزمہ خوانِ علق ، محکی آیات فلق\nطوطی ماہ جبیں مرغ سلیمانِ عرب\n\nپر کشا رہتا ہے لاہوت کی پہنائی میں\nبرجِ سدرہ کا مکیں مرغ سلیمانِ عرب\n\nمستعد رہتا ہے فرمان بجا لانے کو\nعرشِ اعلیٰ کے قریں مرغ سلیمانِ عرب\n\nنور تھا ، نورِ خدا ، نور کی جانب لایا\nصورتِ وحی مبیں مرغ سلیمانِ عرب\n\nبابِ جبریل جو ہے روضۂ اقدس کے قریں\nٹھہرا کرتا تھا یہیں مرغ سلیمانِ عرب\n\nآرزو ہے تیرے دیدار کی دل کو لیکن\nدید کی تاب نہیں مرغ سلیمانِ عرب\n\nتیرے اشعار سے شہزادؔ یہی لگتا ہے\nتو نے دیکھا ہے کہیں مرغ سلیمانِ عرب"
  },
  {
    "id": 9,
    "title": "منقبت",
    "description": "اُمِّ رسول رضی اللہ عنہا\nمطلعٔ والضحیٰ ، اُمِّ خیرالوریٰ\n\nمرجعٔ مصطفی ، اُمِّ خیرالوریٰ\nپاک مثل صبا ، اُمِّ خیرالوریٰ\n\nامن سرتابہ پا ، اُمِّ خیرالوریٰ\nمادرِ مشفق و مہربان نبی\n\nسیدہ ، آمنہ ، اُمِّ خیرالوریٰ\nحاملِ نور ِ خالق ہے اُن کا شکم\n\nروشنی کی بنا ، اُمِّ خیرالوریٰ\nبت پرستی کے ماحول میں رہ کے بھی\n\nتھیں بتوں سے جدا ، اُمِّ خیرالوریٰ\nاُن کی رَگ رَگ میں تاثیر سرکار تھی\n\nمادرِ باصفا اُمِّ خیرالوریٰ\nقربِ محبوب باری کے فیضان سے\n\nہیں قریبِ خدا ، اُمِّ خیرالوریٰ\nہیں خدیجہ کی وہ مادرِ نسبتی\n\nجدّئہ زاہرا ، اُمِّ خیرالوریٰ\nجس کو بیٹے کی نسبت سے عظمت ملی\n\nہے وہی والدہ اُمِّ خیرالوریٰ\nپیکرِ عصمت و عفت و آشتی\n\nطیّبہ ، طاہرہ ، اُمِّ خیرالوریٰ\nچھوڑ کر جگ سے شہزادؔ رخصت ہوئی\n\nخیر کا سلسلہ اُمِّ خیرالور"
  },
  {
    "id": 10,
    "title": "گوشۂ خلفاء راشدین رضی اللہ عنہم",
    "description": "کیا شان نبی کے یاروں کی\nتفسیر ہیں یہ سیپاروں کی\n\nصدّیق و عمر ، عثمان و علی\nکوئی مثل نہیں ان چاروں کی"
  },
  {
    "id": 11,
    "title": "گوشۂ صدّیق اکبرص",
    "description": "چہ دارد اوبرائے یارِ غارے\nخدا داند جزائے یار غارے\n\nمتاعِ کل بہ پیغمبر فدا کرد\nدل و جانم فدائے یار غارے\n\n…………\nچومست بادئہ صدّیق ہستم\n\nرواں برجادئہ صدّیق ہستم\nبرائے غیر در دل نیست جائے\n\nکہ من دِل دادئہ صدّیق ہس"
  },
  {
    "id": 12,
    "title": "منقبت",
    "description": "سیدنا صدیق اکبر ص\nعزم کے کو ہسار اے صدیق\n\nاے صداقت شعار اے صدیق\nآپ پر جاں نثار اے صدیق\n\nآپ دِیں کا وقار اے صدیق\nآپ ہی نے ہمیں سکھایا ہے\n\nعشق کا کاروبار اے صدیق\nکیسے کر پائے گا بھلا کوئی\n\nوصف تیرے شمار اے صدیق\nاے نبی پاک کے مزاج شناس\n\nیارِ غار و مزار اے صدیق\nملکِ صدیقیت کے اے سر تاج\n\nسر تا پا شاہکار اے صدیق\nاے بلا فصل جانشینِ رسول\n\nظلِ پروردگار اے صدیق\nثانی اثنین کا ہے سر پہ تاج\n\nصاحب اعتبار اے صدیق\nباخدا آپ ہی سے سجتی ہے\n\nمحفلِ چار یار اے صدیق\nساتھ لے کر حضور کو آؤ\n\nمیرے گھر ایک بار اے صدیق\nمستفید آپ سے ہو گر شہزادؔ\n\nدور ہو اِنتشار اے صد"
  },
  {
    "id": 13,
    "title": "منقبت",
    "description": "حضرت سیدنا صدیق اکبر ص\nصحابہ میں ذیشان صدیقِ اکبر\n\nصداقت کے سلطان صدیقِ اکبر\nشہِ اہلِ عرفان صدیقِ اکبر\n\nمعارف کی ہیں کان صدیقِ اکبر\nکوئی مرد اُس دم مسلماں نہیں تھا\n\nہوئے جب مسلمان صدیقِ اکبر\nامامت کے قابل خلافت کے لائق\n\nتب و تابِ ایمان صدیقِ اکبر\nکروں ذکر اُن کا تو ملتی ہے راحت\n\nسکونِ دِل و جان صدیقِ اکبر\nنظر میں نبی کے جچا وقتِ ہجرت\n\nوہ خوش بخت انسان صدیقِ اکبر\nکروں در پہ آکر سلام عرض میںبھی\n\nیہ ہے میرا ارمان صدیقِ اکبر\nبھُلا کیسے سکتے ہیں اسلام والے\n\nترے پیہم احسان صدیقِ اکبر\nتری حق گزاری ، تری جاں نثاری\n\nفرشتے ہیں حیران صدیقِ اکبر\nخلیفہ بلا فصل ہیں مصطفیٰ کے\n\nبآیاتِ قرآن صدیقِ اکبر\nلقب ثانی  اثنین شہزادؔ جس کا\n\nوہ ممدوحِ رحمن صدیقِ اک"
  },
  {
    "id": 14,
    "title": "منقبت",
    "description": "حضرت سیدنا صدیق اکبر ص\nبزمِ ایماں سج گئی صدیق سے\n\nدین کو عزّت ملی صدیق سے\nدیکھئے تو قربت غار و مزار\n\nکس قدر ہیں خوش نبی صدیق سے\nباخدا بعد از نبی بے شک ملی\n\nدین کو تابندگی صدیق سے\nچاہتا ہے گر فلاح دو جہاں\n\nسیکھ طرزِ زندگی صدیق سے\nفیضیاب عبدہٗ ہیں آپ ہی\n\nمانگ فیضِ بندگی صدیق سے\nجنگ کرتا ہے خدا کے ساتھ وہ\n\nجو رکھے ہے دشمنی صدیق سے\nحضرت فاروق و عثماں کی طرح\n\nپیار کرتے تھے علی صدیق سے\nنورِ عرفاں کا سمندر اُن کی ذات\n\nمیرے دل میں روشنی صدیق سے\nہر سلیم القلب ہے اُن پر نثار\n\nبغض رکھتا ہے شقی صدیق سے\nغیر ممکن ہے کہ ہوں شہزادؔ اب\n\nاِس جہاں میں آدمی صدیق "
  },
  {
    "id": 15,
    "title": "منقبت",
    "description": "حضرت سیدنا صدیق اکبر ص\nمقام و مرتبہ دیکھا عجب صدیقِ اکبر کا\n\nفرشتوں کے دِلوں میں ہے ادب صدیقِ اکبر کا\nوہ دیکھو ’’ثانی اثنین اذھمافی الغار‘‘ کی صورت\n\nہے خود مدح سرا قرآں میں رب صدیقِ اکبر کا\nنبی کے بعد ہے ان کا تصرف ساری امت میں\n\nعجم صدیقِ اکبر کا عرب صدیقِ اکبر کا\nخدا نے آپ تعظیمِ نبی کا حکم فرمایا\n\nسکھایا مصطفیٰ نے خود ادب صدیقِ اکبر کا\nنہ اُمُّ الخیر جیسی ماں کوئی ہو گی زمانے میں\n\nنہ ثانی کوئی پیدا ہو گا اب صدیقِ اکبر کا\nاُٹھا کر دیکھئے بے شک قریشی ہاشمی شجرہ\n\nنبی کے ساتھ ملتا ہے نسب صدیقِ اکبر کا\nکہاں میں اور کہاں مدح سرائی اللہ والوں کی\n\nکرم ہے با خُدا مجھ پر یہ سب صدیقِ اکبر کا\nدلوں میں قمقمے شہزادؔ جل اٹھتے ہیں الفت کے\n\nزباں پہ نام آ جاتا جب صدیقِ اکبر "
  },
  {
    "id": 16,
    "title": "گوشۂ فاروق اعظم  ص",
    "description": "ہو کرم کی نگاہ یا فاروق\nبھول بیٹھا ہوں راہ یا فاروق\n\nمیں گداگر ہوں آپ کے در کا\nآپ شاہوں کے شاہ یا فاروق"
  },
  {
    "id": 17,
    "title": "v",
    "description": "صدیق و عمر کا کیا کہنا\nکیا بات نبی کے یاروں کی\n\nعثمان و علی سبحان اللہ\nتعریف ہو کیا ان چاروں کی"
  },
  {
    "id": 18,
    "title": "منقبت",
    "description": "حضرت عمر فاروق   ص\nلیے دِل میں ارمانِ فاروقِ اعظم\n\nیہ سوچا لکھوں شانِ فاروقِ اعظم\nسدا لب پہ رکھتا ہے ان کے ترانے\n\nجو ہے مرتبہ دانِ فاروقِ اعظم\nرہے گاوہ محروم، عرفانِ حق سے\n\nنہیں جس کو عرفانِ فاروقِ اعظم\nاِسی میں تھی اِسلام کی سربلندی\n\nضروری تھا ایمانِ فاروقِ اعظم\nنگہبانِ اِسلام تھی ذات ان کی\n\nخدا تھا نگہبانِ فاروقِ اعظم\nتعیش نہیں تھا ذرا اُن کے گھر میں\n\nرہا فَقر سامانِ فاروقِ اعظم\nچلے یوں بساطِ سیاست کے مہرے\n\nفراست ہے قربانِ فاروقِ اعظم\nخدا کی رضا کے طریقے سکھائے\n\nہے امت پہ احسانِ فاروقِ اعظم\nشہادت ملی شہرِ خیرالورٰی میں\n\nہوئی مطمئن جانِ فاروقِ اعظم\nنہیں کروفر بادشاہی میں اُن کی\n\nہے بے کسرٰی ایرانِ فاروقِ اعظم\nہے طغیانی موج دریا کو کافی\n\nفقط ایک فرمانِ فاروقِ اعظم\nجھکاتے ہیں سر قیصرِ رُوم جیسے\n\nسکندر ہے دربانِ فاروقِ اعظم\nابوبکر ، عثمان ، حسنین و حیدر\n\nسبھی تو ہیں یارانِ فاروقِ اعظم\nمیں ہوں نقشبندی بفیض مُجدَّد\n\nہے ہاتھوں میں دامانِ فاروقِ اعظم\nمقدر تو شہزادؔ دیکھو ہمارے\n\nکہ ہیں ہم غلامانِ فاروقِ اع"
  },
  {
    "id": 19,
    "title": "منقبت",
    "description": "حضرت عمر فاروق  ص\nچمن کو ناز ہے جس پر وہی گلاب ہیں آپ\n\nنگاہِ سرورِ عالم کا اِنتخاب ہیں آپ\nجواب جس کا نہیں ہے وہ لاجواب ہیں آپ\n\nعروسِ عظمتِ دِیں کے لیے شباب ہیں آپ\nحضور آپ کی رائے کو کر رہے ہیں قبول\n\nکہ بارگاہِ الٰہی میں مستجاب ہیں آپ\nدلایا آپ نے بھیڑوں کو بھیڑیوں سے خراج\n\nدیارِ عدلِ رسالت کا ایک باب ہیں آپ\nسلام آپ کی بخت آوری کو اے فاروق\n\nمیرے حضور کی صحبت سے فیضیاب ہیں آپ\nمری کتابِ مناقب کی آپ ہیں زینت\n\nکہ حرف آپ ہیں ، لفظ آپ ہیں ، کتاب ہیں آپ\nفروغِ دین متیں آپ کے جلال سے ہے\n\nکہ تیغ سرورِ عالم کی آب و تاب ہیں آپ\nبزرگ تر ہے مقام آپ ہی کا بعد عتیق\n\nعمل میں ، علم میں ، حکمت میں لاجواب ہیں آپ\nنسیمِ لطف و عنایت ہیں مومنوں کے لیے\n\nتو کفر و شر کے لیے مظہر عذاب ہیں آپ\nاحاطہ آپ کی رفعت کا کیا کرے شہزادؔ\n\nیہ ایک ذرّہ کمتر تو آفتاب ہیں ا"
  },
  {
    "id": 20,
    "title": "منقبت",
    "description": "حضرت عمر فاروق   ص\nکنزِ یقین و صدق کا نوری گہر عمر\n\nاعزاز دِین ، صاحب نطق و نظر عمر\nہے پاسبانِ عظمتِ خیرالبشر عمر\n\nگستاخ کے لیے ہے نشانِ خطر عمر\nمحبوبِ حق ، محافظِ ناموسِ مصطفیٰ\n\nرُوحِ جلال، عظمتِ تیغ و تبر عمر\nاِس کی مثال ڈھونڈ کے لاؤں کہاں سے میں\n\nہے انتخابِ چشمِ شہِ بحر و بر عمر\nتورات میں ہیں جس کے مناقب لکھے ہوئے\n\nوہ باکمال پیکرِ علم و ہنر عمر\nحاکم کہ جس کے زیر تصرف تھے بحر و بر\n\nجو بوریہ نشین تھا وہ تاجور عمر\nشہزادؔ سب کے وردِ زباں کل بھی تھا یہ نام\n\nہے آج بھی زمانے کے لب پر عمر ع"
  },
  {
    "id": 21,
    "title": "گوشۂ عثمان ذ والنوّرین  ص",
    "description": "صدّیق صداقت کے پیکر\nفاروق کی عظمت کیا کہنا\n\nعثمان کا کیا ہو وصف بیاں\nحیدر کی شجاعت کیا کہنا"
  },
  {
    "id": 22,
    "title": "منقبت",
    "description": "حضرت عثمان غنی  ص\nجس نے مدحت کی ہے ذُوالنورین کی\n\nاس کو دولت مل گئی دارین کی\nمصطفیٰ کے لاڈلے داماد ہیں\n\nگہری نسبت ان سے ہے حسنین کی\nاس سے ہوتی ہے غنی کی ابتداء\n\nہے خصوصیت یہ حرف غین کی\nوہ رقیہ ہوں کہ عثمان غنی\n\nہیں فزوں تر عظمتیں طرفین کی\nجس سے کرتے ہیں فرشتے بھی حیا\n\nاللہ اللہ شان ذوالنورین کی\nروشنی ہے خانۂ عثمان میں\n\nسرورِ عالم کے نورِ عین کی\nدشمنی رکھتا ہے جو عثمان سے\n\nاس پہ لعنت تا ابد حسنین کی\nکر دیا شہزادؔ خُوش سرکار کو\n\nپائی عزّت اس طرح دارین "
  },
  {
    "id": 23,
    "title": "منقبت",
    "description": "سیدنا عثمان ذُوالنورین  ص\nہو گئی جس کو پہچان عثمان کی\n\nوہ زباں ہے ثنا خوان عثمان کی\nقدر کر اے مسلمان عثمان کی\n\nچھوڑ راہ فتن مان عثمان کی\nزینتِ مسندِ علم و حلم و حیا\n\nہے روش جود و احسان عثمان کی\nوقف تھے مستقل بہر دین نبی\n\nمال ، دھن ، آبرو جان عثمان کی\nدستِ عثمان ہے دستِ خیرالوریٰ\n\nاس سے بڑھ کے ہو کیا شان عثمان کی\nہیں حرم میں شہِ دیں کی دو بیٹیاں\n\nمرحبا! عظمت و آن عثمان کی\nعشق تھا ان کو قرآن سے اس لیے\n\nمدح کرتا ہے قرآن عثمان کی\nان پہ حور و ملائک بھی عاشق ہوئے\n\nخلد ہے مرتبہ دان عثمان کی\nہادی و مھدی و صاحب رشد ہیں\n\nپرُ جواہر سے ہے کان عثمان کی\nاس کو ملتی ہے خوشنودی مصطفی\n\nبات مانے جو انسان عثمان کی\nتذکرہ یہ رفیقِ نبوت کا ہے\n\nمنقبت کب ہے آسان عثمان کی\nقدسیوں کا ہو شہزادؔ مجمع لگا\n\nمدح فرمائیں حسان عثمان "
  },
  {
    "id": 24,
    "title": "منقبت",
    "description": "سیدنا عثمانِ غنی  ص\nمجھ پہ کیسے نہ رحمت ہو رحمن کی\n\nمنقبت لکھ رہا ہوں میں عثمان کی\nجس کے فضل و شرف پر ہے شاہد خدا\n\nجس کے شایاں ہیں آیات قرآن کی\nنوُر والے سے دو نُور جس کو ملے\n\nمثل کوئی نہیں ، ابن عفان کی\nعلم و حلم و حیا ، صبر ، جود و سخا\n\nہیں یہ سب خوبیاں ایک انسان کی\nسیرت و صورت مصطفی کی جھلک\n\nزندگی تھی کہ تفسیر فرقان کی\nپھر سے روح سخاوت کو زندہ کیا\n\nدین پر اپنی ہر چیز قربان کی\nجس نے خالق سے جنت کا سودا کیا\n\nہے عجب شان سخیوں کے سلطان کی\nایسا تاجر جسے قاسم خلد نے\n\nبخش دی ملکیت باغ رضوان کی\nمصطفی سے کیا قول پورا کیا\n\nلاج رکھی ہراک عہد و پیمان کی\nذِکر ان کا ہے شہزؔاد روحِ یقیں\n\nعشق ان کا علامت ہے ایمان "
  },
  {
    "id": 25,
    "title": "گوشہ",
    "description": "اہل بیت اطہاررضی اللہ عنہم\nدونوں عالم میں ہوئے ممتاز تر وہ خوش نصیب\n\nجن کو حاصل ہو گئی نسبت رسول اللہ کی\nآستاں اُن کا نہ ہو کیوں مرجع بے چارگاں\n\nقاضیٔ حاجات ہے عترت رسول اللہ "
  },
  {
    "id": 26,
    "title": "منقبت",
    "description": "حضرت علی المرتضیٰ  ص\nاللہ کے ولیوں کے مددگار علی ہیں\n\nمولائے جہاں خلق کے سردار علی ہیں\nسرتاج ہیں زہرا کے تو حسنین کے بابا\n\nعم زاد نبی ، حیدر کرّار علی ہیں\nوہ شیر خدا وارث فیضان رسالت\n\nاوصافِ کریمانہ میں شہکار علی ہیں\nایمان ہو ، عرفاں ہو شریعت کہ طریقت\n\nہر قافلۂ شوق کے سالار علی ہیں\nحجرے میں نظر آتے ہیں وہ فقر کا پیکر\n\nمیدان میں اللہ کی تلوار علی ہیں\nلرزہ سا ہے اِک لشکر کفّار پہ طاری\n\nباطل سے ہوئے برسر پیکار علی ہیں\nصدّیق و عمر حضرت عثمان کے ہمدم\n\nیاران شہ دین کے دلدار علی ہیں\nرفتار میں گفتار میں انداز میں یکتا\n\nاللہ رے کیا صاحب کردار علی ہیں\nتفسیر سے الحمد کی اُونٹوں کو جو بھر دیں\n\nاللہ کے وہ محرمِ اِسرار علی ہیں\nدانائے زمن ، عقدہ کشا ، شاہ ولایت\n\nہاں حکمت و عرفان کا مینار علی ہیں\nہے روئے علی دیکھنا شہزادؔ عبادت\n\nمولودِ حرم ، پیکرِ انوار علی ہ"
  },
  {
    "id": 27,
    "title": "مدحیہ قطعات",
    "description": "کیا عظمت و اکرام ہے اللہ اللہ\nہے لفظ کہ الہام ہے اللہ اللہ\n\nہرحرف میں ہے گنج معانی پنہاں\nکیا خوب علی نام ہے اللہ اللہ\n\n___________\n٭\n\nصاحب نہج البلاغہ ، فاتحِ خیبر علی\nشہر علم و حکمت و عرفان کا ہیں در علی\n\nدیکھنے کو چاہیے شہزادؔ چشم یارِ غار\nہیں بزرگی میں بلند و بالا و برتر علی"
  },
  {
    "id": 28,
    "title": "ترجماں آیات قرآنی کی ہے اُن کی زباں",
    "description": "شرحِ فرمان نبی ، شیرِ خدا کے فیصلے\nکیوں نہ اے شہزادؔ ہوں فاروق اعظم معترف\n\nہیں مدارِ عدل ، علی المرتضیٰ کے فیصلے\n___________\n\n٭\nصدیق و صداقت کے صدقے\n\nفاروق و عدالت کے صدقے\nعثماں کی سخاوت پر قرباں\n\nحیدر کی شجاعت کے صد"
  },
  {
    "id": 29,
    "title": "منقبت",
    "description": "حضرت ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا\nہے زوجۂ سرکار ابوبکر کی بیٹی\n\nہر وصف میں شہکار ابوبکر کی بیٹی\nلاریب نبی پاک کی ازواج ہیں یکتا\n\nازواج کی سردار ابوبکر کی بیٹی\nاُمت کی وہ ماں سیّد عالم کی چہیتی\n\nہے رونق گھر بار ابوبکر کی بیٹی\nہیں حفصہ و سودہ بھی اسی باغ کی کلیاں\n\nہے زینت گلزار ابوبکر کی بیٹی\nاللہ رے یہ علم ، یہ تقویٰ یہ طہارت\n\nہر رنگ میں ضوبار ابوبکر کی بیٹی\nاللہ نے قرآن میں دی ہے یہ گواہی\n\nہے صاحب کردار ابوبکر کی بیٹی\nاصحابِ نبی پوچھتے ہیں جس سے مسائل\n\nکیسی ہے سمجھدار ابوبکر کی بیٹی\nمحبوبِ خدا ، سید و سلطان عر ب سے\n\nکرتی ہے بہت پیار ابوبکر کی بیٹی\nآئینہ صدیق ہے یہ جود و سخا میں\n\nہوتی نہیں بیزار ابوبکر کی بیٹی\nکرتی ہے عطا شوہر و سرتاج کا صدقہ\n\nکرتی نہیں انکار ابوبکر کی بیٹی\nبیٹا ہوں میں صدیقۂِ کونین سی ماں کا\n\nہے میری نگہدار ابوبکر کی بیٹی\nاسماء نے بھی پائی ہے بڑی شان نرالی\n\nہے پیکر ایثار ابوبکر کی بیٹی\nپہنچاتی رہی غار میں کھانا وہ مسلسل\n\nکتنی ہے وفادار ابوبکر کی بیٹی\nقربان تری ذات پہ شہزادؔ کی ماں ہو\n\nاے پیکر انوار ابوبکر کی بی"
  },
  {
    "id": 30,
    "title": "منقبت",
    "description": "حضرت سیدہ فاطمۃ الزہر ہ رضی اللہ عنہا\nنورِ چشم مصطفی خیرالنساء\n\nزوجۂ شیر خدا خیرالنساء\nزینتِ بزم حیا خیرالنساء\n\nفخر و ناز مرتضیٰ خیرالنساء\nمادر حسنین وہ عظمت مآب\n\nیعنی بی بی فاطمہ خیرالنساء\nبیبیانِ خلد کی سردار ہیں\n\nسیدہ ، زیب النساء خیرالنساء\nرشک اہل تقویٰ و فقر و غنا\n\nپیکر صبر و رضا خیرالنساء\nفیضیابِ بارگاہ ذاتِ حق\n\nمظہر خیر الوریٰ خیرالنساء\nوہ خدا کے لاڈلے کی لاڈلی\n\nبے نقائص ، باوفا خیرالنساء\nعکس خلق رحمت کون و مکاں\n\nبے رداؤں کی ردا خیرالنساء\nمیرے سب امراض کا کامل علاج\n\nآپ کی بس اک دعا خیرالنساء\nداستاں ہے آپ کے ایثار کی\n\nبر زبان کربلا خیرالنساء\nتیرے خاد م چاند سورج سال ماہ\n\nتیری لونڈی ہے صبا خیرالنساء\nہدیہ حسن عقیدت ہو قبول\n\nاے کرم کی انتہا خیرالنساء\nبھیک دے شہزاد ؔکو اخلاص کی\n\nہے یہی بس التجا خیرالنس"
  },
  {
    "id": 31,
    "title": "منقبت",
    "description": "شان اہل بیت اطہاررضوان اللہ علیہم اجمعین\nکس زباں سے ہو بیاں فضل و کمالِ اہلِ بیت\n\nآئینہ حسن نبی کا ہے جمالِ اہلِ بیت\nقاضی حاجات ہر ہر فرد اس کنبے کا ہے\n\nپیکر صدق وصفا ہر خوش خصالِ اہلِ بیت\nکس کے دامن میں نہیں خیرات ان کے فیض کی\n\nہے مسلّم دہر میں جود و نوالِ اہلِ بیت\nسرور دیں کے شمائل سے ملا حصہ انہیں\n\nپیکرِ صدق و صفا ہر خوش خصالِ اہلِ بیت\nبدر کے میدان سے تا ریگ زار کربلا\n\nہر جگہ غالب رہا جاہ و جلالِ اہلِ بیت\nان کو ورثے میں ملے ہیں علم وحلم و صدق وعدل\n\nعکس آیات مبیں ہیں قال و حالِ اہلِ بیت\nان کی خوشنودی میں پنہاں ہے رضا سرکار کی\n\nکب گوارا مصطفی کو ہے ملالِ اہلِ بیت\nمنبر نوک سناں سے اس طرح خطبہ دیا\n\nآیۂ قرآں ہوئی زیب مقالِ اہلِ بیت\nایسا گھر شہزادؔ تاریخ نبوت میں نہیں\n\nڈھونڈ کر لائے بھلا کوئی مثالِ اہلِ ب"
  },
  {
    "id": 32,
    "title": "منقبت",
    "description": "حضرت قاسم و اکبررضی اللہ عنہم\nکیسے بیاں ہوں قاسم و اکبر کی عظمتیں\n\nدونوں ہی گلستان رسالت کے پھول ہیں\nابن حسین یہ ہے تو ابن حسن ہے وہ\n\nدونوں جوان رونق صحن بتول ہیں\nشیر خدا کا خون رگوں میں ہے موج زن\n\nسیکھے ہوئے انھوں نے وفا کے اصول ہیں\nمیدان میں وہ قاسم و اکبر کا رعب و جوش\n\nگویا کہ دونوں شیر خدا و رسول ہیں\nمعلوم تھا حسین کے ہر جاں نثار کو\n\nفتح و ظفر حسین کے پائوں کی دھول ہیں\nجن کے دلوں میں بغض ہے آل رسول کا\n\nشہزادؔ بس وہ لوگ جہاں میں فضول ہ"
  },
  {
    "id": 33,
    "title": "گوشۂ حسنین کریمینرضی اللہ عنہم",
    "description": "حسین گلشن زہرا کا اک معطر پھول\nحسین مظہرِ اوصافِ مرتضائی ہے\n\nحسین وارث سرمایۂ شہ لولاک\nحسین قاسم فیضانِ مصطفائی ہے"
  },
  {
    "id": 34,
    "title": "قطعہ",
    "description": "وفا و صبر کا پیکر ٗ صداقتوں کا سفیر\nحسین سبط نبی ہے ٗ حسین ابن علی\n\nجسے نواز دے شہزادؔ نورِ عین بتول\nوہی ہے غوث ، وہی قطب ہے وہی ہے ولی"
  },
  {
    "id": 35,
    "title": "منقبت",
    "description": "حضرت امام حسن مجتبیٰص\nآج لب پر ہے نامِ امامِ حسن\n\nلکھ رہا ہوں سلامِ امامِ حسن\nمصطفی نے جسیـ ’’ـابنی ھذٰا‘‘ کہا\n\nاللہ اللہ مقامِ امامِ حسن\nراکب دوش سلطان کون ومکاں\n\nدیکھئے احتشامِ امامِ حسن\nپیشوائے امامِ حسین آپ ہیں\n\nکیجئے احترامِ امامِ حسن\nفیض یاب لعاب شہ دوسرا\n\nقول حق ہے کلامِ امامِ حسن\nوہ گل گلشن سید انس و جاں\n\nرشک عنبر مشام امامِ حسن\nتاج دار جہان سخا و عطا\n\nواہ لطف دوامِ امامِ حسن\nہر سوالی کو دامن سے بڑھ کر دیا\n\nدیکھئے فیض عامِ امامِ حسن\nبعد والے سبھی ان کے ہیں مقتدی\n\nمصطفی ہیں امام امام حسن\nاس کے قدموں میںشہزادؔ شاہی رہی\n\nہو گیا جو غلامِ امامِ ح"
  },
  {
    "id": 36,
    "title": "منقبت",
    "description": "حضرت امام حسین ص\nمصداق حرفِ آیۂ تطہیر ہیں حسین\n\nمرآۃ لاالہ کی تنویر ہیں حسین\nآئینہ استعانت صبر و صلوٰۃ کا\n\nآیات بیّنات کی تفسیر ہیں حسین\nمظہر ہیں سرّ آیۂ ذِبحِ عظیم کا\n\nاک لازوال خواب کی تعبیر ہیں حسین\nسیرت میں خلق سرورِ کونین کی شبیہ\n\nصورت میں بھی حضور کی تصویر ہیں حسین\nریحان و رَوحِ گلشن سلطان دو جہاں\n\nخوشبوئے خلد عدن کی تشہیر ہیں حسین\nپردیس میں ہر ایک غریبُ الوطن کا ناز\n\nتشنہ لبی کی دہر میں توقیر ہیں حسین\nسیراب کر دیا چمن دین مصطفی\n\nتا حشر رُوحِ نعرئہ تکبیر ہیں حسین\nحاصل ہے مجھ کو بیعتِ شبیر کا شرف\n\nشہزادؔ میں مرید ہوں اور پیر ہیں حس"
  },
  {
    "id": 37,
    "title": "منقبت",
    "description": "حضرت امام حسین ص\nشجاعتوں کی داستاں حسین ہیں حسین ہیں\n\nحقیقتوں کے رازداں حسین ہیں حسین ہیں\nبھلا سکی نہ آج تک جنہیں زمین کربلا\n\nوہی امیر کارواں حسین ہیں حسین ہیں\nملا ثبات دین کو امام ہی کے خون سے\n\nشہادتوں کا اک جہاں حسین ہیںحسین ہیں\nفرات کے لبوں پہ بھی انھیں کی ہیں حکایتیں\n\nدہن دہن ، زباں زباں ،حسین ہیں حسین ہیں\nیزیدّیت تو ریگزارِ کربلا میں دب گئی\n\nرگِ حیات میں رواں حسین ہیں حسین ہیں\nسوارِ دوش مصطفی ، سکون قلب مرتضیٰ\n\nشعار دیں کے پاسباں حسین ہیں حسین ہیں\nرسوخ عزم فاطمہ کا عکس اُن کی ذات ہے\n\nکلام حق کے ترجماں حسین ہیں حسین ہیں\nحسین تر ہے گلشن رسول کا ہر ایک گل\n\nجمال روئے گلستاں حسین ہیں حسین ہیں\nلٹا دیئے رہ خدا میں شیرِ خوار و نوجواں\n\nنثارِ حق بہ قلب و جاں حسین ہیں ، حسین ہیں\nجہاں میں اب جہاں جہاں ہے ذکر لا الٰہ کا\n\nہو آنکھ تو وہاں وہاں حسین ہیں حسین ہیں\nعلی ، عباس ، حُر ، سبھی اِمام ہی کے رنگ ہیں\n\nکہیں عیاں ، کہیں نہاں حسین ہیں حسین ہیں\nمجھے ہے فخر انتساب فاطمہ کے لال سے\n\nزمیں ہوں میں تو آسماں حسین ہیں حسین ہیں\nخطر ہے شاہزادؔ کیا مجھے کسی یزید سے\n\nکہ میرے سر کا سائباں حسین ہیں حسین ہ"
  },
  {
    "id": 38,
    "title": "سلام بحضور امام عالی مقامص",
    "description": "رسول پاک نے یونہی گلو نہ چوما تھا\nرگِ حسین سے اک دن لہو ٹپکنا تھا\n\nعلی کے لال کو دیکھے گی ایسی حالت میں\nزمین کرب و بلا نے کبھی نہ سوچا تھا\n\nلیا عنایت باری نے بڑھ کے دامن میں\nکچھ اس خشوع سے اصغر کا جسم تڑپا تھا\n\nاسی امام کی طاعت پہ منحصر ہے نجات\nبلا کے دشت میں حُر ہی یہ بات سمجھا تھا\n\nنکل کے سبطِ نبی نے یزیدّیت کے خلاف\nخدا کے دین کا پرچم بلند کرنا تھا\n\nلرز گئے تھے در و بام قصرِ باطل کے\nجلال، اکبر ذیشان کا کچھ ایسا تھا\n\nشہید ہو گئے جس دم وفا شعار تمام\nفرات رنج کی حالت میں سر پٹکتا تھا\n\nفضا نڈھال تھی شہزادؔ غم کی شدت سے\nیزیدیوں کے مقابل حسین تنہا تھا"
  },
  {
    "id": 39,
    "title": "مناقب حسینص",
    "description": "ہر دور کو شعور دیا ہے حسین نے\nانسانیت کو نور دیا ہے حسین نے\n\nپہچاننے لگا ہے زمانہ یزید کو\nغافل کو وہ حضور دیا ہے حسین نے\n\nاب چار سو ہے معرکۂ کربلا بپا\nایمان کو وفور دیا ہے حسین نے\n\nاُس کیفیت کا لطف شہیدوں سے پوچھئے\nجس کیف کو ظہور دیا ہے حسین نے\n\nکرنا کسی بھی طور نہ بیعت یزید کی\nایک درس یہ ضرور دیا ہے حسین نے\n\nہوتا ہے جس میں جابجا باطل سے اختلاف\nوہ جادئہ امور دیا ہے حسین نے\n\nشہزادؔ جب بھی نام لیا ہے حسین کا\nہر دم نیا سرور دیا ہے حسین نے"
  },
  {
    "id": 40,
    "title": "منقبت",
    "description": "بحضور امام عالی مقام امام حسین ص\nصبر و سخا و علم وراثت حسین کی\n\nہے لازوال دولت و ثروت حسین کی\nکس درجہ منفرد ہے عبادت حسین کی\n\nمرگ یذیدیت ہے شہادت حسین کی\nرکھتی ہے ایک مرشد کامل کا مرتبہ\n\nہے پیشوائے دہر عزیمت حسین کی\nتازہ رہے گی حشر تک کرب و بلا کی یاد\n\nہر سال بڑھ رہی ہے ضرورت حسین کی\nہے پوچھنا تو اہل نجابت سے پوچھئے!\n\nکتنی بڑی ہے شان میں نسبت حسین کی\nکچھ کم نہیں ہے خلد سے آغوش فاطمہ\n\nہے پاس ہی حسین کے جنت حسین کی\nخنجر کی نوک اور لہو سے لکھی گئی\n\nقرطاس کربلا پہ حکایت حسین کی\nسرچشمۂ حیات ہے اب دشت نینوا\n\nکچھ دن اسے ملی ہے رفاقت حسین کی\nلو دیں گے یونہی اسوئہ شبیر کے نقوش\n\nکرتی رہے گی خلق اطاعت حسین کی\nآیات بیّنات میں ڈھونڈ اس کا مرتبہ\n\nروح الامیں سے پوچھ فضیلت حسین کی\nفرعون تا یزید ہے اک شر کا سلسلہ\n\nاک خیر مستقل ہے طبیعت حسین کی\nخارج ہے وہ حسین کے نانا کے دین سے\n\nجو مانتا نہیں ہے امامت حسین کی\nشہزادؔ اہل بیت نبوّت سے پوچھئے\n\nمعلوم ہے انہی کو حقیقت حسین "
  },
  {
    "id": 41,
    "title": "منقبت",
    "description": "امام عالی مقامص\nکرتی ہے منکشف کئی اسرار کربلا\n\nقدرت کے فیصلوں کا ہے اظہار کربلا\nدیکھا ہے اس نے منظر مظلومی امام\n\nاب مستقل رہے گی عزادار کربلا\nوابستہ ہوگئی ہے یہ ٓالِ رسول سے\n\nکیوں ہو نہ روئے ارض پر شہکار کربلا\nہونا تھا تجھ کو مشہد سبط شہ رسل\n\nکرتے تھے تیرا ذکر جو سرکار ، کربلا\nتیری فضا میں رچ گئی تاثیر حزن کی\n\nٹوٹا تھا تجھ پہ آسماں اِک بار کربلا\nنوک سناں پہ جو کہ پڑھے تھے حسین نے\n\nکیسے لگے تھے تجھ کو وہ اذکار کربلا\nٹپکا ہے تجھ پہ خونِ رگِ غنچہ ٔ بتول\n\nگویا ہے تو بہشت کا گلزار کربلا\nتجھ کو ہیں سبط ِ نور مجسم سے نسبتیں\n\nکیسے نہ پھر ہو پیکر انوار کر بلا\nجب بھی چھڑا یزیدکی بیعت کا تذکرہ\n\nکرتی رہے گی حشر تک انکار کربلا\nچومے ہیں تو نے حضرت شبیر کے قدم\n\nہے یادگار اب ترا کردار کربلا\nشہزادؔ چاہتی ہے یہ ہر حُر مزاج کو\n\nہے ہر یزید وقت سے بے زار کرب"
  },
  {
    "id": 42,
    "title": "منقبت",
    "description": "امام اعظمص\nکی ہے بلند حق نے شانِ امامِ اعظم\n\nہر اِک ولی ہے رُتبہ دانِ امامِ اعظم\nابرِ کرم ہے اُن کا ذکرِ لطیف و اطہر\n\nجُود و سخا کا مظہر خوانِ امامِ اعظم\nاَحمد۱؎ ، فضیل۲؎ ، مالک۳؎ ، حمّاد۴؎ و ابنِ ادھم۵؎\n\nاِن ہستیوں سے پوچھو شانِ امامِ اعظم\nتاجِ سرِ فقاہت قولِ ابو حنیفہ\n\nکنزِ علوم و حِکمت جانِ امامِ اعظم\nشامل ہیں جِن میں زُفر و ابویوسف و محمد\n\nرکھتی ہے وہ جواہر کانِ اِمامِ اعظم\nکشتِ حنابلہ ہو یا مزرع شوافع\n\nبرسا ہے سب پہ ابرِ بارانِ امامِ اعظم\nہر مجتہد اُنہی سے کرتا تھا اِستفادہ\n\nاہلِ نظر تھے خواجہ تا شانِ امامِ اعظم\nشہزادؔ پیشوا ہوں گر ہیثمی۶؎ و عینی۷؎\n\nپھر منقبت ہو شاید شایانِ امامِ اع"
  },
  {
    "id": 43,
    "title": "گوشۂ",
    "description": "حضرت داتا علی ہجویری رحمتہ اللہ علیہ\nمنقبت\n\nداتا گنج بخش علی ہجویری رحمتہ اللہ علیہ\nاولیائِ وقت دیکھے فیضیابِ گنج بخش\n\nکھٹکھٹاتی ہے ولایت آ کے بابِ گنج بخش\nہر گھڑی رہتا ہے یہ جو کیف سا لاہور میں\n\nگونجتا ہے آج تک اس میں خطابِ گنج بخش\nکہنہ سالی میں یہ عطر افشانیاں ہیں شیخ کی\n\nاللہ اللہ ہو گا کیا عہد شبابِ گنج بخش\nقبر مو من باغ ہے جنت کا از رُوئے حدیث\n\nباب باغِ خلد ہے لاریب بابِ گنج بخش\nپیاس رُوحو ں کی مٹا کرتی ہے اس دربار میں\n\nعلم و عرفاں سے ہے پر جام شرابِ گنج بخش\nخواجۂ اجمیر سے تا تاجدار گولڑہ\n\nکیسے کیسے باخدا ہیں باریابِ گنج بخش\nفیض جاری ہے زمانے میں شہِ ہجویر کا\n\nکشت عالم پر ہے فیض افشاں سحابِ گنج بخش\nرہنمائی آج بھی کرتے ہیں داتا خلق کی\n\nرہبر پیرانِ عالم ہے کتابِ گنج بخش\nزور جتنا بھی لگا لے نجدیت کی تیرگی\n\nروشنی دیتا رہے گا آفتابِ گنج بخش\nہند میں اسلام کا شہزاد ؔہے جب تک وجود\n\nہر گھڑی ہو گا فزوں اجر و ثوابِ گنج ب"
  },
  {
    "id": 44,
    "title": "منقبت",
    "description": "بحضور داتا گنج بخش رحمتہ اللہ علیہ\nمظہر نور خدا ، انوار داتا گنج بخش\n\nکاملوں کے رہنما سرکار داتا گنج بخش\nباعث کشف حجاب دل ہے ان کا التفات\n\nروشنی کا سلسلہ کردار داتا گنج بخش\nیاد آتا ہے خدا صورت کو اُن کی دیکھ کر\n\nگویا ہے دید خدا دیدار داتا گنج بخش\nمقتدی ہیں سیدِ ہجویر کے اہل طریق\n\nکر رہے ہیں اصفیاء تذکار داتا گنج بخش\nمرکز جملہ سلاسل ہے یہی اک بارگاہ\n\nمرجع اہل ولا دربار داتا گنج بخش\nکشف محجوب آپ کی بے مثل تصنیف لطیف\n\nمصحف مرشد نما شہکار داتا گنج بخش\nپیٹ بھرتا ہے تہی دست و تونگر کا یہاں\n\nبے کسوں کا آسرا بازار داتا گنج بخش\nچار سو اس میں کھلے ہیں علم و عرفاں کے گلاب\n\nخوشنما و دلکشا ، گلزار داتا گنج بخش\nقرب ہے شہزادؔ ان کا شیخ ہندی کو نصیب\n\nدہر میں جو تھا علم بردار داتا گنج ب"
  },
  {
    "id": 45,
    "title": "منقبت",
    "description": "حضرت داتا گنج بخش علی ہجویری رحمتہ اللہ علیہ\nاے خوشا! لب پر بیاں ہے سید ہجویر کا\n\nتذکرہ تسکین جاں ہے سید ہجویر کا\nنام لیوا اک جہاں ہے سید ہجویر کا\n\nنقش تازہ و جواں ہے سید ہجویر کا\nبجھ رہی ہے آج بھی قلب و زباں کی تشنگی\n\nچشمۂ شیریں رواں ہے سید ہجویر کا\nمستفیض بارگہ ہیں سالک و مجذوب سب\n\nمصدرِ لُطف آستاں ہے سید ہجویر کا\nدست بستہ قدسیوں کو دیکھتا ہے اس جگہ\n\nمرتبہ جس پر عیاں ہے سید ہجویر کا\nحاضر دربار ہیں چاروں سلاسل کے شیوخ\n\nجس کو دیکھو مدح خواں ہے سید ہجویر کا\nخواجہ اجمیر ہوں یا تاجدار گولڑہ\n\nمعترف ہر نکتہ داں ہے سید ہجویر کا\nکیوں نہ اے شہزادؔپھر لاہور ہو قطب البلاد\n\nآستانہ جو یہاں ہے سید ہجویر "
  },
  {
    "id": 46,
    "title": "منقبت",
    "description": "حضرت داتا گنج بخش علی ہجویری رحمتہ اللہ علیہ\nشہرہ جگ میں گھر گھر ہے مخدوم علی ہجویری کا\n\nآج ترانہ لب پر ہے مخدوم علی ہجویری کا\nقبرہے جنت کا باغیچہ ازروئے فرمانِ نبی\n\nروضہ، خلد برابر ہے مخدوم علی ہجویری کا\nاُن کی یاد سے رحمت بر سے اُن کی بات سے ہو بخشش\n\nرحمت ذکر سراسر ہے مخدوم علی ہجویری کا\nدل کی مرادیں آج بھی طالب اس چوکھٹ سے پاتے ہیں\n\nفیض بھرا ایسا دَر ہے مخدوم علی ہجویری کا\nآج بھی بھوکے اس دَر سے دو وقت کی روٹی کھاتے ہیں\n\nآج بھی جاری لنگر ہے مخدوم علی ہجویری کا\nہم داتا کے سائے میں آباد ہیں کتنی صدیوں سے\n\nسایۂ شفقت ہم پر ہے مخدوم علی ہجویری کا\nاُس کو ولی اللہ نہ سمجھو سنت کا جو تارِک ہو\n\nدرس ہمیں یہ ازبر ہے مخدوم علی ہجویری کا\nخوش بختی شہزادؔ ہماری ، ہم لاہور میں رہتے ہیں\n\nہم کو قرب میسّر ہے مخدوم علی ہجویری کا\nہم ہیں پاکستانی اور شہزادؔ ہمارے پرچم پر\n\nپرچم سایہ گستر ہے مخدوم علی ہجویری "
  },
  {
    "id": 47,
    "title": "منقبت",
    "description": "حضرت داتا گنج بخش رحمتہ اللہ علیہ\nحاضر ہے ترے در پہ گدا سید ہجویر!\n\nہو اس کی طرف چشم عطا سید ہجویر!\nخطرے میں مرا پاک نگر پھر سے گھرا ہے\n\nدرکار ہے پھر تیری دعا سید ہجویر!\nجاری رہے لنگر ترے فیضان کرم کا\n\nاے مظہرِ انوار خدا سید ہجویر!\nہو خیر ترے بابِ عنایات و عطا کی\n\nہوتا رہے منگتوں کا بھلا سید ہجویر!\nدربار تو ولیوں کے جہاں بھرمیں کئی ہیں\n\nہے شان ترے در کی جدا سید ہجویر!\nتو مظہرِ اوصافِ شہ کون و مکاں ہے\n\nاقطاب ترے مدح سرا سید ہجویر!\nحاضر ہیں ترے در پہ فرشتوں کی قطاریں\n\nعاشق ترے مردان خدا سید ہجویر!\nکشافِ حجابات ہر اک حرف ہے تیرا\n\nاے راہبر و راہنما سید ہجویر!\nبھرتے ہیں کئی پیٹ ترے خوانِ کرم سے\n\nاے مرجعِ مخلوقِ خدا سید ہجویر!\nہے تاج ترے سر پہ سیادت کا فروزاں\n\nاے وارث لولاک لما سید ہجویر!\nدر کار ہے خدّام کو بھی دل کی صفائی\n\nمطلوب ہے اب صدق و صفا سید ہجویر!\nجاری رہے لنگر ترا تا روز قیامت\n\nشہزادؔ کے ہے دل کی دُعا سید ہجوی"
  },
  {
    "id": 48,
    "title": "گوشۂ غوثیہص",
    "description": "غلام غوث اعظم ہوں ، گدائے نقشبنداں ہوں\nتعلق ہے بحمداللہ مرا چاروں سلاسل سے\n\nمیں چشتی قادری شہزادؔ سیفی سہروردی ہوں\nمجھے کیا خوف ہو سکتا ہے پھر مدمقابل سے"
  },
  {
    "id": 49,
    "title": "رباعی",
    "description": "اے عاشق مستانۂ عبدالقادر\nمے نوش ز پیمانۂ عبدالقادر\n\nاحوال تو فرزانگی آموز جہاں باد\nاے دل شدی دیوانۂ عبدالقادر"
  },
  {
    "id": 50,
    "title": "منقبت",
    "description": "سیدنا غوث اعظم  ص\nزمین کیا آسماںبھر میں ہے چرچا غوثِ اعظم کا\n\nلگائیں کان جس جانب ہے شہرہ غوثِ اعظم کا\nکمالات ولایت میں شہِ بغداد لاثانی\n\nبلندی پر رہا پرچم ہمیشہ غوثِ اعظم کا\nکرامات و تصرف میں عجب قدرت ملی ان کو\n\nہر اک انداز ہے بے شک نرالا غوثِ اعظم کا\nطریقت میں اگر اپنی کبھی پرواز رک جائے\n\nوظیفہ ہم کیا کرتے ہیں بس یاغوثِ اعظم کا\nہوئے ظاہر مگر پھر چھپ گئے پہلے سبھی سورج\n\nرہے گا تا ابد سورج چمکتا غوثِ اعظم کا\nقدم اُس پیر پیراں کا ولی گردن پہ رکھتے ہیں\n\nہے بوسہ گاہ اہل عشق تلوا غوثِ اعظم کا\nفرشتے جن و انساں سب عقیدت مند ہیں ان کے\n\nخدا ہی جانتا ہے کیا ہے رتبہ غوثِ اعظم کا\nاگرچہ سلسلہ شہزادؔ میرا نقشبندی ہے\n\nدل و جاں سے ہوں لیکن نام لیوا غوثِ اعظم "
  },
  {
    "id": 51,
    "title": "منقبت",
    "description": "حضرت شیخ عبدالقادر جیلانی رحمتہ اللہ علیہ\nکرم کا پیکر ہیں غوثِ اعظم\n\nغریب پرور ہیں غوثِ اعظم\nہمارے رہبر ہیں غوثِ اعظم\n\nمہِ منور ہیں غوثِ اعظم\nہوئے ہیں یا جتنے غوث ہوں گے\n\nسبھی کے افسر ہیں غوثِ اعظم\nقدم ہے گردن پہ ہر ولی کی\n\nجہاں کے سرور ہیں غوثِ اعظم\nوہ بازِ أشہب شہ ولایت\n\nخدا کا مظہر ہیں غوثِ اعظم\nکمال ایمان و معرفت کی\n\nبلندیوں پر ہیں غوثِ اعظم\nنبی کا شہزادؔ عکس ہیں وہ\n\nشبیہِ حیدر ہیں غوثِ اع"
  },
  {
    "id": 52,
    "title": "گوشۂ اصفیاء رحمتہ اللہ علیہ",
    "description": "حُبّ درویشاں کلیدِ جنت است\nدشمنِ ایشاں سزائے لعنت است\n\n(حافظ شیرازی)\nمنقبت\n\nحضرت بابا فرید الدین مسعود گنج شکر رحمتہ اللہ علیہ\nہدایت کا روشن ستارہ فرید\n\nطریقت ہے دریا تو دھارا فرید\nعقیدت نظر ہے نظارہ فرید\n\nولایت ہے کشتی کنارا فرید\nتصرّف کی دنیا کا وہ تاجدار\n\nبلندی کا ہے استعارہ فرید\nہمیں ڈوب جانے کا خطرہ نہیں\n\nہے ہم بیکسوں کا سہارا فرید\nسبق خوان لوح قضا اس کی ذات\n\nہے انگشت حق کا اشارہ فرید\nمقامات اس کے ہوں کیسے بیاں\n\nہے جس کاملہ کا دلارا فرید\nہوا زہد و تقویٰ سے آراستہ\n\nبہر رنگ ماں نے سنوارا فرید\nوہ وارث رسولوں کے اسرار کا\n\nخداوند عالم کا پیارا فرید\nخضر اس کے ہم مجلس و راز دار\n\nمعارف کا اونچا منارا فرید\nوہیں پر ہے شہزادؔ جنت کا باغ\n\nجہاں ضوفشاں ہے ہمارا فر"
  },
  {
    "id": 53,
    "title": "منقبت",
    "description": "حضرت خواجہ بہاء الدین شاہِ نقشبندرحمتہ اللہ علیہ\nاولیاء میں منفرد ہے شان شاہِ نقشبند\n\nاصفیاء کے دل میں ہے ارمان شاہِ نقشبند\nکاملوں نے خوشہ چینی آپ کے خرمن سے کی\n\nواصلوں کے لب پہ ہے فرمان شاہِ نقشبند\nاللہ اللہ رفعت پرواز فخر خواجگاں\n\nطائران قدس ہیں قربان شاہِ نقشبند\nنقشبندیت کا مرکز ہے بخارا کی زمیں\n\nقاسم فیض ولایت کان شاہِ نقشبند\nجانشین خواجگاں ہیں خطہ سرہند میں\n\nشیخ احمد مظہر فیضان شاہِ نقشبند\nعلم و حکمت ، نور با طن ، عشق و مستی ، جذب و شوق\n\nراہ حق میں ہے یہی سامان شاہِ نقشبند\nہم کو بخشاہے نہایت در ہدایت کا شعور\n\nہم غلاموں پر ہے یہ احسان شاہِ نقشبند\nعارفوں میں ہم اسے شہزادؔ کرتے ہیں شمار\n\nجس کو حاصل ہو گیا عرفان شاہِ نقشب"
  },
  {
    "id": 54,
    "title": "منقبت",
    "description": "حضرت بہاء الدین زکریا ملتانی رحمتہ اللہ علیہ\nسرگروہ اولیاء حضرت بہاء الدین ہیں\n\nپیشوائے اصفیا حضرت بہاء الدین ہیں\nزیور اوصاف حق سے ہے مزیّن ہر ادا\n\nعکسِ حسن کبریا حضرت بہاء الدین ہیں\nمہر چرخ سہرورد و نائب شیخ الشیوخ\n\nرونق بزم ھدٰی حضرت بہاء الدین ہیں\nحامل زہد و ریاضت ، پیکر علم و عمل\n\nصاحب صدق و صفا حضرت بہاء الدین ہیں\nسرور کونین کی سیرت کا اک عکس جمیل\n\nخوش خصال و خوش ادا حضرت بہاء الدین ہیں\nہاتھ پھیلائے کھڑے ہیں بادشاہان جہاں\n\nمائل جود و سخا حضرت بہاء الدین ہیں\nعلم و عرفان و عمل کا ایک بحر بے کراں\n\nقاسم عشق خدا حضرت بہاء الدین ہیں\nواقف شرع و طریقت جامع عشق و خرد\n\nجانشین انبیاء حضرت بہاء الدین ہیں\nثبت ہیں القاب جس کے تختی تقدیر پر\n\nوہ امام الازکیاء حضرت بہاء الدین ہیں\nکیوں نہ اے شہزادؔ ان کی قبر ہو جنت کا باغ\n\nعاشق خیرالورٰی حضرت بہاء الدین ہ"
  },
  {
    "id": 55,
    "title": "منقبت",
    "description": "خاتم الحفاظ حضرت\nامام جلال الدین سیوطی رحمتہ اللہ علیہ\n\nسراپا عشق و ایقاں ہیں جلال الدین سیوطی\nدلیل راہ ایماں ہیں جلال الدین سیوطی\n\nعطائے ذات رحماں ہیں جلال الدین سیوطی\nنبی کا ہم پہ احساںہیں جلال الدین سیوطی\n\nمسیح اہل عرفاں ہیں جلال الدین سیوطی\nکلیم طور قرآں ہیں جلال الدین سیوطی\n\nحدیث مصطفی کے نور نے چمکا دیا اُن کو\nشعاع مہر فاراں ہیں جلال الدین سیوطی\n\nشرف حاصل رہا اُن کو شہ دیں کی حضور ی کا\nگل باغ کریماں ہیں جلال الدین سیوطی\n\nکریں گے علم والے بھی شفاعت اہل عصیاں کی\nشفیع اہل عصیاں ہیں جلال الدین سیوطی\n\nہیں اُن کے مقتدی شعرانی و غزی وشامی سے\nامام اہل دوراں ہیں جلال الدین سیوطی\n\nمری اسناد میں شہزادؔ اُن کا نام نامی ہے\nکہ میرے پیر پیراں ہیں جلال الدین سیوطی"
  },
  {
    "id": 56,
    "title": "گوشۂ مجدّدیہ  رحمتہ اللہ علیہ",
    "description": "مجھے حاصل رہی ہے مستقل شفقت بزرگوں کی\nخدا نے کمسنی میں کی عطا قربت بزرگوں کی\n\nغلام شیخ سرہندی ہوں میں شہزادؔ سیفی ہوں\nبحمداللہ حاصل ہے مجھے نسبت بزرگوں کی"
  },
  {
    "id": 57,
    "title": "منقبت",
    "description": "امام ربّانی مجدد الف ثانی رحمتہ اللہ علیہ\nزمانے بھر میں ہے چرچا مجدد الف ثانی کا\n\nہر عاشق والا و شیدا مجدد الف ثانی کا\nہوائیں فیض و رحمت کی اسی گلشن میں چلتی ہیں\n\nریاض خلد ہے روضہ مجدد الف ثانی کا\nروانہ غوث اعظم نے کیا جبّہ محبت سے\n\nمقام اس میں ہے پو شیدہ مجدد الف ثانی کا\nیہی دربار ہے چاروں سلاسل کا حسیں سنگم\n\nبھرا ہے فیض سے دریامجدد الف ثانی کا\nکمالاتِ نبوت کا مزہ جس نے نہیں چکھا\n\nوہ کیا جانے بھلا رتبہ مجدد الف ثانی کا\nبٹی تھی خاص غار ثور کی خلوت میں جو نعمت\n\nہے اس فیضان میں حصہ مجدّد الف ثانی کا\nشب الحاد و بدعت چھٹ گئی یکسر زمانے سے\n\nنکل کر مہر جب چمکا مجدد الف ثانی کا\nملی مردہ دلوں کو زندگی ذکر الٰہی سے\n\nیہ ہے واللہ کرم سارا مجدد الف ثانی کا\nخدا کے فضل سے شہزادؔ ہم بھی نقشبندی ہیں\n\nہمارے سر پہ ہے سایہ مجدد الف ثانی "
  },
  {
    "id": 58,
    "title": "منقبت",
    "description": "حضرت مجدد الف ثانی رحمتہ اللہ علیہ\nجگمگاتے ہیں انوار سرہند میں\n\nہے مجدد کا دربار سرہند میں\nجیسے تبدیل ہوتی ہے شب ، صبح میں\n\nیوں بدلتے ہیں افکار سرہند میں\nدیدہ و دل کو کاسہ بنائے ہوئے\n\nآ رہے ہیں طلب گار سرہند میں\nاللہ اللہ مسیحائے مردہ دِلاں\n\nعارفوں کا ہے سالار سرہند میں\nدِین اسلام کو جس نے چمکا دیا\n\nنورکا ہے وہ مینار سرہند میں\nاہل سنت کوجس نے سنبھالا دِیا\n\nسنیت کا علم دار سرہند میں\nشاہ سرہند کی شان تو دیکھیے\n\nکعبہ آیا کئی بار سرہند میں\nجس کا ایک ایک مکتوب مرشد نما\n\nہے وہ دانائے اسرار سرہند میں\nنقشبندی فیوضات کا ہے اثر\n\nچین پاتے ہیں بیمار سرہند میں\nالف ثانی کا وہ رہبر و رہنما\n\nعارفوں کا ہے سردار سرہند میں\nقلب و جاں میں ہے شہزادؔ جس کی مہک\n\nہے وہ سرسبز گلزار سرہند م"
  },
  {
    "id": 59,
    "title": "منقبت",
    "description": "حضر ت خواجہ معصوم رحمتہ اللہ علیہ\nنائب حضرت مجدد فخر اہل معرفت\n\nخواجہ معصوم سرہندی وہ عالی مرتبت\nچست آئی جن کی قامت پر ولایت کی قبا\n\nخود تمنائی تھی جن کی خلعتِ قیّومیت\nبادشاہوں پربھی چلتا تھا تصرف آپ کا\n\nحق نے بخشی آپ کو روحانیت کی سلطنت\nرہنمائی آپ سے لی شاہ عالم گیر نے\n\nدین و دنیا میںملی یوں اُس کو قدر و منزلت\nآپ کے فیضان کا مظہر فتاویٰ ہندیہ\n\nآپ کے الطاف کی عکاس فقہ حنفیّت\nغافلوں کو آپ نے تعلیم ذکر و فکر دی\n\nعارفوں نے آپ سے پایا شعورِ معرفت\nہم بھی ہیں شہزادؔ معصومی بفضل ذاتِ حق\n\nاس لیے وردِ زباں ہے آج اُن کی منق"
  },
  {
    "id": 60,
    "title": "منقبت",
    "description": "حضرت خواجہ محمد معصوم رحمتہ اللہ علیہ\nعروۃ الوثقیٰ لقب ہے خواجۂ معصوم کا\n\nتذکرہ وجہ طرب ہے خواجۂ معصوم کا\nگلشن فاروق اعظم کے تروتازہ گلاب\n\nباخدا اعلیٰ نسب ہے خواجۂ معصوم کا\nجانشیں حضرت مجدد کے ہیں قیوم جہاں\n\nاس لیے دل میں ادب ہے خواجہ معصوم کا\nمستفید و مستفیض اہل عجم کو بھی کیا\n\nمعترف سارا عرب ہے خواجۂ معصوم کا\nتاجدارانِ جہاں نے کی ہے ان کی چاکری\n\nمرتبہ واللہ عجب ہے خواجۂ معصوم کا\nبھر دیا سینوں میں فیضانِ مجدّد آپ نے\n\nمنفرد عالم میں ڈھب ہے ، خواجہ معصوم کا\nپیکرِعلم و عمل وہ بحر اسرار و رموز\n\nثانی کوئی شیخ کب ہے خواجہ معصوم کا\nہے فروزاں ہند میں جو آج تک دیں کا چراغ\n\nیہ کرم شہزادؔ سب ہے خواجۂ معصوم "
  },
  {
    "id": 61,
    "title": "منقبت",
    "description": "حضرت مرزا مظہر جان جاں رحمتہ اللہ علیہ\nمزّین ز صدق و صفا جانِ جاناں\n\nنزاکت میں سب سے جدا جانِ جاناں\nمحدث ، مفسر مریدین جن کے\n\nزمانے کے وہ مقتدا جانِ جاناں\nمعارف کا دریا وہ قیوم عالم\n\nمشائخ کے ہیں رہنما جانِ جاناں\nشریعت کی کرتے رہے پاسبانی\n\nطریقت کے ہیں پیشوا جانِ جاناں\nاجازت تھی چاروں سلاسل میں اُن کو\n\nحقیقت میں تھے باخدا جانِ جاناں\nمئے نقشبنداں کا ساغر پلا کر\n\nسکھاتے تھے صبر و رضا جانِ جاناں\nزمانے کے گمراہ لوگوں کو ہر دم\n\nدکھاتے تھے راہ ھدٰی جانِ جاناں\nتذکر ، تفکر ، تشکر کا پیکر\n\nتوکل تھے سرتابہ پا جانِ جاناں\nسبق ظلمتوں کو دیا روشنی کا\n\nہدایت کا اک سلسلہ جانِ جاناں\nیہ حضرت مجدّد کا فیضان ہی تھا\n\nرہے بن کے حق کی صدا جانِ جاناں\nتعلق ہے خالق کے ساتھ ان کا گہر ا\n\nمحب شہ دوسرا جانِ جاناں\nبہ دل گرچہ شہزادؔ اخلاص دارم\n\nو لیکن کجا من کجا جانِ جان"
  },
  {
    "id": 62,
    "title": "منقبت",
    "description": "اعلیٰ حضرت امام احمد رضا خان تاجدارِ بریلی رحمتہ اللہ علیہ\nہے آئینۂ رشد فضل خدا سے\n\nجو صادر ہوا حرف کلک رضا سے\nوہ قسام فیضان عشق رسالت\n\nخدا کے کرم سے ، نبی کی عطا سے\nمحدث ، مفسر ، فقیہ و مجدد\n\nوہ تھا بہرہ ور سب علوم ھدٰی سے\nوہ اک عارف حق وہ اک شیخ کامل\n\nتھی وابستگی جس کو غوث الورٰی سے\nتھا اعدائے دیں کے لیے تیغ قاطع\n\nرعایت نہ رکھتا تھا اہل جفا سے\nرہا عمر بھر وہ شریعت کے تابع\n\nتھے پرُ جان و دِل اُس کے صدق و صفا سے\nغرض اُس نے رکھی نہ اہلِ دُوَل سے\n\nاسے عشق تھا تو فقط مصطفی سے\nعقائد میں اسلاف کا عکس تھا وہ\n\nفقاہت عیاں اس کی ہر اک ادا سے\nگُندھا تھا خمیر اس کا عشق نبی میں\n\nتھا معمور دل اس کا ذوق وفا سے\nوہ بحر معارف تھا حکمت کا پیکر\n\nاسے ربط تھا خاص باب ہدٰی سے\nلکھوں تاج دار بریلی کی مدحت\n\nملے بہرہ وافر جو فکر رسا سے\nاحاطہ علوم رضا کا کروں میں\n\nیہ کیوں کر ہو شہزادؔ مجھ نارسا "
  },
  {
    "id": 63,
    "title": "گوشۂ سیفیہرحمتہ اللہ علیہ",
    "description": "سرورِ اہلِ صفا ، یکتائی تو دَر اولیاء\nرہبرِ دوراں توئی اے تاجدارِ اتقیاء\n\nنازِہندی ، فخر ہجویری تو قیّوم زماں\nشدورودت ، صد سعادت مردمِ پنجاب را"
  },
  {
    "id": 64,
    "title": "منقبت",
    "description": "مجدد عصر حاضر\nاخنذادہ سیف الرحمن صاحب پیرارچی مبارک\n\nنہیں ہے کوئی ثانی باخدا قیوم دوراں کا\nہر اک انداز ہے واللہ جدا قیوم دوراں کا\n\nخدا کے ذکر سے آباد کر سکتا ہے سینوں کو\nجو سالک ہے اجازت یافتہ قیوم دوراں کا\n\nجناب شیخ ہاشم کے خلیفہ اور نائب ہیں\nہے بالا ہر جہت سے مرتبہ قیوم دوراں کا\n\nوجود ان کا ہے نورانی ، کمال ان کا ہے لاثانی\nانوکھا ہے جہاں میں سلسلہ قیوم دوراں کا\n\nجِلا دیتے ہیں وہ مردہ دلوں کو اک اشارے سے\nہے جاری فیض کا دریا سدا قیوم دوراں کا\n\nانہی کے در سے بے چینوں کو اطمینان ملتا ہے\nہے واقف وجد سے ہر ہر گدا قیوم دوراں کا\n\nچمن زار ولایت میں کبھی بلبل نوا پیرا\nکبھی نغمہ سناتی ہے صبا قیوم دوراں کا\n\nمٹا دیتی ہے ان کی اک نظر سب داغ عصیاں کے\nہمارا حج ہے یارو دیکھنا قیوم دوراں کا\n\nعطا کرتے ہیں وہ شہزادؔ ہر سائل کو فیض اپنا\nبڑا مشہور ہے جود و سخا قیوم دوراں کا"
  },
  {
    "id": 65,
    "title": "منقبت",
    "description": "حضرت صوفی کندل صاحب مبارک رحمتہ اللہ علیہ\nضعف یقیں کو عزم مصمم بنا دیا\n\nقطرے کو تیرے فیض نے قلزم بنا دیا\nتیری عطائے خاص نے اے پیکر جمال\n\nمجھ سا حقیر شخص معظم بنا دیا\nجس کی تمام ذات تھی زخموں پہ مشتمل\n\nتو نے اسے بھی ڈھال کر مرہم بنا دیا\nاللہ رے وہ عارضِ برگِ گلِ اِرم\n\nقطرے کو جس کے لمس نے شبنم بنا دیا\nچھائی تھی گلستانِ تصوف پہ اک خزاں\n\nتو نے اسے بہار کا موسم بنا دیا\nفصل خزاں کا راج تھا قلب و نگاہ پر\n\nتو نے اسے بہار کا موسم بنا دیا\nرہتا تھا کچھ حیات کی پیچیدگی کا خوف\n\nلیکن تیرے خیال نے بے غم بنا دیا\nاب تو نصیب سیدی ! عید وصال ہو\n\nدوری نے مجھ کو مثل محرّم بنا دیا\nبگڑا تھا قلب و رُوح کا ہر اک معاملہ\n\nتیری نوازشات نے یکدم بنا دیا\nدل سے مرے نکال کر مرشد نے نفرتیں\n\nمجھ کو محبتوں کا معلم بنا دیا\nگر تو نہیں تو صوفیٔ بے مثل کون ہے\n\nجس کی نظر نے بوند کو رم جھم بنا دیا\nلینے تو بھیک آئے تھے شہزادؔ ہم یہاں\n\nلیکن سخی کے فیض نے قاسم بنا د"
  },
  {
    "id": 66,
    "title": "منقبت",
    "description": "احوالِ بزم عشق\nعجب مستی کا تھا عالم جہاں کل رات کو میں تھا\n\nتھا ذکرِ ذاتِ ھو ہر دم جہاںکل رات کو میں تھا\nدلوں سے وسوسے مٹتے رہے سب نفس و شیطاں کے\n\nنظر آیا عجب عالم جہاں کل رات کو میں تھا\nخدائے وحدہٗ کی یاد میں تھا کچھ سکوں ایسا\n\nنہ آیا پاس کوئی غم جہاں کل رات کو میں تھا\nہر اِک سینے میں فیض پیر ارچی کا خزینہ تھا\n\nلطائف سب تھے جام جم جہاں کل رات کو میں تھا\nزمیں تا آسماں انوار کی خیرات جاری تھی\n\nتھا رنگ و نور کا موسم جہاں کل رات کو میں تھا\nفضامعمور تھی ساری کمالاتِ ولایت سے\n\nنہیں تھا فکر بیش و کم جہاں کل رات کو میں تھا\nجسے دیکھا وہی مست مئے قیّومِ دوراں تھا\n\nتھی ساری بزم ہی برہم جہاں کل رات کو میں تھا\nدکھائی دی مجھے فصل بہار سیفیہ ہر سو\n\nتھی جذب و جوش کی رم جھم جہاں کل رات کو میں تھا\nمری جانب بھی تھی شہزادؔ چشم مرشد کامل\n\nمرا سر تھا ادب سے خم جہاں کل رات کو میں ت"
  },
  {
    "id": 67,
    "title": "منقبت(مترجم)",
    "description": "حضرت صوفی کندل خان مبارک رحمتہ اللہ علیہ\nاگر چاہے طریقت بن گدائے صوفی کندل\n\nتو آکے دیکھ اے طالب صفائے صوفی کندل\nسکوں میرے دل و جاں کا لقائے صوفی کندل\n\nخوشا !میرے بھی سر پر ہے ردائے صوفی کندل\nکرے زندہ دل مردہ کو جو اک نعرۂ ھُو سے\n\nصدائے قم باذن اللہ صدائے صوفی کندل\nکہاں تھا وہ کہاں ہوں میں ، یہ خود سے پوچھتا ہوں میں\n\nصدا آئی کہ ہے یہ سب دعائے صوفی کندل\nعداوت اولیاء کے ساتھ خالق سے عداوت ہے\n\nورا ہر شک سے ہے منکر وفائے صوفی کندل\nخدا وہ دن بھی لے آئے کہ پابوسی کروں ان کی\n\nمیں دیکھوں جلد روئے دلربائے صوفی کندل\nاگر پوچھو مقام ان کا امام الاولیاء کہہ دوں\n\nکریں اہل ولایت اقتدائے صوفی کندل\nشفیق و مہرباں میرے ، کریم و پاسباں میرے\n\nغنی ہوں فقر میں یہ ہے سخائے صوفی کندل\nمیں ہوں شہزادؔ ناکارہ گنہگار اور بے چارہ\n\nمیں شاید جگ میں آیا ہوں برائے صوفی کندل\nقلم عاجز زباں قاصر بیاں شہزادؔ ناممکن\n\nمیرے فکر و تخیل سب فدائے صوفی کن"
  },
  {
    "id": 68,
    "title": "منقبت",
    "description": "خلیفۂ اعلیٰ حضرت ، حضرت\nمفتی غلام جان ہزاروی رحمۃ اللہ تعالیٰ\n\nاہلِ سُنن کی جان ہیںمفتی غلام جان\nسب رضویوں کی شان ہیں مفتی غلام جان\n\nیکجا ہیں ان کی ذات میں اخلاص وعلم وعشق\nاہلِ صفا کا مان ہیں مفتی غلام جان\n\nغوث و رضا کے عاشقِ صادق ، دلیل خیر\nحق گو ہیں حق نشان ہیں مفتی غلام جان\n\nعکسِ کمالِ شیخِ طریقت ہے ان کی ذات\nفیضِ رضا کی کان ہیں مفتی غلام جان\n\nتقویٰ شعار ، صاحبِ فتویٰ ، فقیہِ دیں\nاہلِ نظر کی آن ہیں مفتی غلام جان\n\nفضل وکمال جودو نوال ان کا بے مثال\nعظمت کا آسمان ہیں مفتی غلام جان\n\nدیکھو تو ہیں حضور کے سادہ سے اُمتی\nسمجھو تو اِک جہان ہیں مفتی غلام جان\n\nرفض و خروج و نصب پہ اک تیغ برق بار\nسُنّی کا سائبان ہیں مفتی غلام جان\n\nزیرِ مزار بھی ہیں دعا گوئے اہلِ حق\nکس درجہ مہربان ہیں مفتی غلام جان\n\nآئینۂ ’’حدائقِ بخشش ‘‘ہے وہ لحد\nجس میں کہ میہمان ہیں مفتی غلام جان\n\nہے وہ فضا ’’بہار شریعت‘‘سے مشکبار\nجس میں براجمان ہیں مفتی غلام جان\n\nاحمد رضا جو سعدی شیرازِعشق ہیں\nمانندِ بوستان ہیں مفتی غلام جان\n\nہم بھی نیازمندِ بریلی شریف ہیں\nاور اپنے ترجمان ہیں مفتی غلام جان\n\nاقبال ان کا شکلِ مظفر میں ہے بلند\nسعدین کا قران ہیں مفتی غلام جان\n\nشہزادؔ مقتدی ہیں مریدانِ با صفا\nاور میرِ کاروان ہیں مفتی غلام جان\n\n(بپاسِ خاطرِ عاطرحضرت علامہ الحاج قاضی مظفر اقبال رضو"
  },
  {
    "id": 69,
    "title": "منقبت",
    "description": "حضرت خطیبِ ملت\nمولانا محمد شفیع اوکاڑوی رحمتہ اللہ علیہ\n\nاک نعمتِ خدا ہیں حضرت خطیبِ مِلّت\nسرکار کی عطا ہیں حضرت خطیبِ مِلّت\n\nمدّاح مصطفی ہیں حضرت خطیبِ مِلّت\nممدوح اصفیا ہیں حضرت خطیبِ مِلّت\n\nتاثیر سے دلوں کو تسخیر کرنے والے\nفطرت کازمزمہ ہیں حضرت خطیبِ مِلّت\n\nالحانِ دائودی کا چشمہ رواں ہے گویا\nکس درجہ خوش نوا ہیں حضرت خطیبِ مِلّت\n\nاغیار نے بھی کی ہے تسلیم یہ حقیقت\nمِلّت کے پیشوا ہیں حضرت خطیبِ مِلّت\n\nدیتے ہیں داد جس کی افلاک پر ملائک\nاک نغمۂ رسا ہیں حضرت خطیبِ مِلّت\n\nدیکھا نہ جس کا ثانی پھر اہل شرق پور نے\nاس پیر کی دعا ہیں حضرت خطیبِ مِلّت\n\nقسمت کا ان کی اب تک کوکب چمک رہا ہے\nمحفل میں رونما ہیں حضرت خطیبِ مِلّت\n\nصد شکر آج تک ہے حضرت کا فیض جاری\nہم سے کہاں جدا ہیں حضرت خطیبِ مِلّت\n\nحصے میں ان کے آئی ’’لا یحزنوں‘‘ کی مسند\nمقبولِ اولیا ہیں حضرت خطیبِ مِلّت\n\nجو صبح و شام برسی روحوں کی کھیتیوں پر\nعرفاں کی وہ گھٹا ہیں حضرت خطیبِ مِلّت\n\nسیرت کو ان کی پڑھ کر شہزادؔ میں نے سمجھا\nاک گنجِ بے بہا ہیں حضرت خطیبِ مِلّت"
  },
  {
    "id": 70,
    "title": "منقبت",
    "description": "حضرت حکیم محمد موسیٰ امرتسری چشتی نظامی رحمتہ اللہ علیہ\nجسے دیکھو ہے مدح خواں حکیمِ اہلسنّت کا\n\nلقب ہے آپ کے شایاں حکیمِ اہلسنّت کا\nشعورِ ُسنّیت بخشا تہی ذہنوں کو حکمت سے\n\nہر اک سنی پہ ہے احساں حکیمِ اہلسنّت کا\nرہ علم و ہنر ہے آج ان کی فکر سے روشن\n\nہے تازہ تر ہر اک فرماں حکیمِ اہلسنّت کا\nسلجھتی ہے ہر اک گتھی بفیضان کرم اب بھی\n\nہے جاری قبر سے فیضاں حکیمِ اہلسنّت کا\nنظام مصطفی ہو جائے نافذ اپنی دھرتی پر\n\nرہا تاعمر یہ ارماں حکیمِ اہلسنّت کا\nشہ کونین کی ناموس کا دیتے رہے پہرا\n\nیہی تھا دیں یہی ایماں حکیمِ اہلسنّت کا\nدکھایا کیا کرشمہ اک معالج کیحذاقت نے\n\nعدو شہزادؔ ہے حیراں حکیمِ اہلسنّت "
  },
  {
    "id": 71,
    "title": "منقبت",
    "description": "حضرت حفیظ تائب رحمتہ اللہ علیہ\nرضا و محسن کا تو ہے نائب حفیظ تائب\n\nہے مستند تیرا قول صائب حفیظ تائب\nترے دلائل کے ہیں مصادر کتاب و سیرت\n\nتیرا مخالف رہے گا خائب حفیظ تائب\nمیں جب بھی کرتا ہوں استغاثہ تری زباں میں\n\nتو ٹلتے جاتے ہیں سب مصائب حفیظ تائب\nوہ کیسا منظر تھا اے ستونِ ابولبابہ\n\nتیرے قریں جب ہوا تھا تائب حفیظ تائب\nزمانے بھر کے ثنا نگاروں کو ، شاعروں کو\n\nدکھائے تو نے کئی عجائب حفیظ تائب\nسجھائی راہیں نئی تری پیشوائیوں نے\n\nہوئے بہم نعت کے رغائب حفیظ تائب\nشعور آداب نعت گوئی ترا حوالہ\n\nترے اسالیب ہیں غرائب حفیظ تائب\nتیری ولا کے نقوش اب بھی جھلک رہے ہیں\n\nنظر سے تو ہے اگرچہ غائب حفیظ تائب\nنہیں ہے واقف حدیث توبہ کی خاصیت سے\n\nجو ڈھونڈتا ہے ترے معائب حفیظ تائب\nکمالِ فن کا بقولِ شہزادؔ آئینہ ہیں\n\nترے محاسن ہوں یا نجائب حفیظ تا"
  },
  {
    "id": 72,
    "title": "منقبت",
    "description": "جناب فخرالقراء\nحضرت قاری غلام رسول رحمتہ اللہ علیہ\n\nمحبِ خاص کلامِ خدا غلام رسول\nامام تھا فن تجوید کا غلام رسول\n\nکمال درجہ قرأت میں دسترس تھی اسے\nمعلمین کا استاذ تھا غلام رسول\n\nبچھا کے داتا کی نگری میں مسند تدریس\nکلامِ پاک سکھاتا رہا غلام رسول\n\nسجی جہاں بھی کبھی بزم قاریان کرام\nرہا ہے صدر نشیں ہر جگہ غلام رسول\n\nسوال جب بھی ہوا کون ہے بڑا قاری\nہر اک زباں نے جواباً کہا غلام رسول\n\nموذنین زمانہ میں بھی وہ تھا یکتا\nتو نعت میں بھی رہا خوش ادا غلام رسول\n\nغلامِ سرور عالم تھا اس لیے شہزادؔ\nرہا جہان میں وقف ثنا غلام رسول"
  },
  {
    "id": 73,
    "title": "منقبت",
    "description": "اولیاء لاہوررحمتہ اللہ علیہم\nاولیاء کے ہیں انوار لاہور میں\n\nمیرے داتا کا دربار لاہور میں\nفیض عالم کی چوکھٹ کا صدقہ ہے یہ\n\nبخت ہوتے ہیں بیدار لاہور میں\nشیخ طاہر ، یہاں پر ہیں جلوہ نما\n\nمہر زنجان ضو بار لاہور میں\nپیر مکی ، میاں میر ، شاہِ رضا\n\nکیسے کیسے ہیں شہکار لاہور میں\nشہر لاہور ولیوں کی ہے رہ گزر\n\nمعرفت کا ہے بازار لاہور میں\nسر زمیں ہے یہ اغواث و اقطاب کی\n\nہیں ولایت کے آثار لاہور میں\nراستہ ہے یہ بغداد و اجمیر کا\n\nآتے جاتے ہیں ابرار لاہور میں\nقطب فرما گئے شیخ سرہند اسے\n\nہے محبت کی مہکار لاہور میں\nچشت و سرہند و دہلی سے آتے رہے\n\nذات حق کے طلبگار لاہور میں\nکون جاتا ہے ان کے مزارات پر\n\nدفن ہیں کتنے زر دار لاہور میں\nاولیاء کے مزارات کی شکل میں\n\nخلد کے ہیں چمن زار لاہور میں\nہم بھی شہزادؔ داتا کے سائے میں ہیں\n\nہے ہمارا بھی گھر بار لاہور م"
  },
  {
    "id": 74,
    "title": "شجرئہ سلسلۂ عالیہ",
    "description": "نقشبندیہ،مجددیہ،سیفیہ،صوفیہ\nاے خدااے خالق ارض و سما\n\nاپنے پیاروں کا مجھے رستہ دکھا\nاے غنی اے مغنی و رب ودود\n\nبھیج سرکار دو عالم پر درود\nاے خدا بہر محمد مصطفی\n\nمعرفت کر دے ہمیں اپنی عطا\nحضرت صدیق اکبر کے طفیل\n\nصاف کر دے مرے دل کی ساری میل\nواسطہ دیتا ہوں میں سلمان کا\n\nتو محافظ بن مرے ایمان کا\nحضرت قاسم کا صدقہ اے قدیر\n\nاپنی الفت کر عطا مجھ کو کثیر\nجعفر صادق ہیں ولیوں کے امام\n\nان کے صدقے تو بنا دے بگڑے کام\nرہبر اہل ولایت بایزید\n\nان کے درجے تو بڑھا مولا مزید\nبوالحسن ، خرقانی ذیشان ہیں\n\nان کے صدقے ان پہ ہم قربان ہیں\nبو علی‘ طوسی و فارمدی ہیں جو\n\nساتھ ان کے ہی مرا انجام ہو\nخواجہ یوسف مقتدائے اولیاء\n\nان کے صدقے تو مری بگڑی بنا\nعبد خالق غجد دانی بے مثال\n\nمثل ان کی کر عطا ہم کو کمال\nبہر حضرت خواجہ عارف ریو گر\n\nہم کو اہل ذکر میں شامل تو کر\nخواجۂ محمود انچر با کمال\n\nکر خدایا ان کی طرح میرا خیال\nحضرت خواجہ عزیزاں دلنشیں\n\nیا الٰہی دے مجھے ان سی جبیں\nبابا سماسی ہیں پیروں کے بھی پیر\n\nان کا صدقہ کر مجھے روشن ضمیر\nعالی رتبہ ہیں بہت میر کلال\n\nمشکلیں ان کے تصدّق میری ٹال\nکر دیا منسوب شاہِ نقشبند\n\nیا الٰہی ہوں ترا احسان مند\nیا الٰہی از پئے خواجہ عطار\n\nدل کے ویرانے کو کر دے پُر بہار\nحضرت یعقوب چرخی باصفا\n\nصدر و ِمیر حلقہ اہل رضا\nواسطہ ہے خواجہ احرار کا\n\nمیرے دل پر کر نزول انوار کا\nصدقۂ زاہد حصاری بے ریا\n\nتو ہمیں اپنا بنا لے کبریا\nخواجہ درویش دُرِّ لاجواب\n\nان کے ہمرہ رکھ ہمیں روزِ حساب\nخواجہ امکنگی ، ولی کے واسطے\n\nاہل حق والے سکھا دے ضابطے\nبہر حضرت باقی باللہ اے کریم\n\nکر سدا ہم سب پہ تولطیف عمیم\nواسطہ حضرت مجدد پاک کا\n\nکر مجھے پیر ، شہِ لولاک کا\nعروۃ الوثقی کا صدقہ کر کرم\n\nدو جہاں میں عاصیوں کا رکھ بھرم\nخواجہ اسماعیل امام العارفین\n\nاولیاء میں ایک تابندہ نگیں\nجس کا کہ معصوم ثانی ہے خطاب\n\nاس کے صدقے ٹال دے سارے عذاب\nعارفِ مولا ، محمّد کا غلام\n\nحشر میں بھی ہو ہمارا وہ امام\nصدقۂ حاجی صفی اللہ دے\n\nجس میں ہو تاثیر ایسی آہ دے\nبہر حضرت شہ ضیاء الحق شہید\n\nاے خدا اپنی محبت دے شدید\nشہ ضیا حاجی میاں جی کے طفیل\n\nسنّتوں کا نور جگ میں جائے پھیل\nشمس حق ہیں اے خدا تیرے ولی\n\nتو کبھی ہم کو دکھا ان کی گلی\nیاالٰہی صدقۂ شاہ رسول\n\nمیری یہ ناچیز کاوش کر قبول\nحضرت ہاشم امام الاصفیاء\n\nان کے صدقے نفس کے شر سے بچا\nپیرا رچی سیف رحماں خوش خصال\n\nمیرے مرشد فی زمانہ بے مثال\nسیفیہ جس نے چلایا سلسلہ\n\nاور دنیا میں بڑھایا سلسلہ\nنقشبندی سلسلے کی شان وہ\n\nنقشبندی سلسلے کا مان وہ\nسیف رحماں پیکر صدق و صفا\n\nسیف رحماں رہبروں کے رہنما\nدنیا و عقبیٰ میں اے ربّ خلیق\n\nصوفیٔ کندل کو کر میرا رفیق\nنسبت ان ولیوں سے اے شہزاد ؔ ہے\n\nقریۂ جاں اس لیے آباد "
  },
  {
    "id": 75,
    "title": "متفرقات",
    "description": "ما ہر چہ خواندہ ایم فراموش کردہ ایم\nالّا حدیث دوست کہ تکرار می کنم\n\n(حافظ شیرازی)\nشانِ قرآن\n\nحکمتیں ہیں نور ہے اسرار ہیں قرآن میں\nذاتِ ربّ عرش کے انوار ہیں قرآن میں\n\nرہنما و محسنِ انسانیت ہے یہ کتاب\nکامیابی کے سبھی اطوار ہیں قرآن میں\n\nزندگی میں بندگی کے رنگ بھر دیتا ہے یہ\nارفع و اعلیٰ سبھی اقدار ہیں قرآن میں\n\nناسخ و منسوخ ہیں کچھ محکم ومتشابہات\nگھاٹیاں کچھ راستے خم دار ہیں قرآن میں\n\nہے پیامِ زندگی یہ مردہ قوموں کے لئے\nروح پرور ،تازہ تر افکار ہیں قرآن میں\n\nدیکھتے ہیں صفحہ در صفحہ انھیں اہل ِ نظر\nجلوہ فرما ہر جگہ سرکار ہیں قرآن میں\n\nمصدر و مہبط ہیں وہ وحیِ خدا کا اس لئے\nصاحب قرآن کے تزکار ہیں قرآن میں\n\nزمزمہ تسبیح کا ،نغمہ کہیں تہلیل کا\nجانفزا و دلنشیں اذکار ہیں قرآن میں\n\nقل ھواللہ أحد ہے اس کی وحدت کا بیاں\nکبریائی کے کئی آثار ہیں قرآن میں\n\nسورۂ رحمان کی آیات میں جلوہ نما\nاس کی قدرت کے حسیں شہکار ہیں قرآن میں\n\nاکبر و اصغر ہو کوئی یا ہو کوئی خشک و تر\nگلشن و صحرا و نور و نار ہیں قرآن میں\n\nماضی و حال اور مستقبل کی ہے اس میں خبر\nجلوہ گر شہزادؔ سب ادوار ہیں قرآن میں"
  },
  {
    "id": 76,
    "title": "شانِ رمضان",
    "description": "اللہ کا مہمان ہے تو اے مہ رمضان\nتسکین دل و جان ہے تو اے مہ رمضان\n\nافطار و سحر چہرئہ مومن کو نکھاریں\nہیں صحن مساجد میں تراویح کی بہاریں\n\nاک موجۂ عرفان ہے تو اے مہ رمضان\nرحمت کہیں بخشش ترے عشروں میں چھپی ہے\n\nہر شب ہی تیری چشمۂ کوثر میں دھلی ہے\nہاں تحفۂ رحمان ہے تو اے مہ رمضان\n\nہوتا ہے گماں دل پہ مجھے غار حرا کا\nجب تذکرہ چھڑ جاتا ہے آیات ھدٰی کا\n\nآغوش بہ قرآن ہے تو اے مہ رمضان\nہر دن ہے معظم ترا ہر شب ہے گرامی\n\nہوتی ہے شب قدر فرشتوں کی سلامی\nبخشش کا شبستان ہے تو ا ے مہ رمضان\n\nانوار و فیوضات کی بارش ہے مسلسل\nشہزادؔ ہوئی جاتی ہے ہر سمت جو جل تھل\n\nسرکار کا فیضان ہے تو اے مہ رمض"
  },
  {
    "id": 77,
    "title": "قدر کی شب",
    "description": "فضل رب العلا ہے قدر کی شب\nشفقت مصطفی ہے قدر کی شب\n\nیہ کھلا ’’انک عفو‘‘ سے\nخیر کا سلسلہ ہے قدر کی شب\n\nبخششیں بٹ رہی ہیں بے قیمت\nلطف کی انتہا ہے قدر کی شب\n\nقدر قرآں سے پائی ہے اس نے\nکیونکہ نازل ہوا ہے قدر کی شب\n\nقدر والوں کو قدر ہے اس کی\nنعمت بے بہا ہے قدر کی شب\n\nخاکیو! آئو لو خدا کا سلام\nنوریوں کی صدا ہے قدر کی شب\n\nآج روح الامیں بھی فرش پہ ہیں\nکس قدر پر ضیا ہے قدر کی شب\n\nبخشش و رحمت و عنایت کا\nایک میلہ لگا ہے قدر کی شب\n\nلیلۃ القدر کا مقام ہے کیا؟\nیہ بھی مجھ پر کھلا ہے قدر کی شب\n\nہے فزوں تر ہزار راتوں سے\nخود خدا نے کہا ہے قدر کی شب\n\nہے یہ اقرء کے نور سے معمور\nیادگارِ حرا ہے قدر کی شب\n\nفجر تک ہے سلامتی اس میں\nرحمتوں کی ردا ہے قدر کی شب\n\nقدر لازم ہے پاک دھرتی کی\nیہ عطیّہ ملا ہے قدر کی شب\n\nقدر قرآں کی فرض ہے شہزادؔ\nکہ یہ نازل ہوا ہے قدر کی شب"
  },
  {
    "id": 78,
    "title": "سلام رضا",
    "description": "عکسِ حسنِ عقیدت سلامِ رضا\nارمغانِ فضیلت سلامِ رضا\n\nفیض بزم ہدایت سلامِ رضا\nاوجِ ذوقِ مودّت سلامِ رضا\n\nنورِ عشقِ رسالت سلامِ رضا\nمدحِ حسنِ نبوت سلامِ رضا\n\nترجمانِ حقیقت سلامِ رضا\nمظہرِ علم و حکمت سلامِ رضا\n\nکیا مرصّع سراپائے سرکار ہے\nآئینہ دار سیرت سلامِ رضا\n\nجیسے حرفوں میں روح رضا ڈھل گئی\nشاہدِ صدقِ الفت سلامِ رضا\n\nاس کے پڑھنے میںہے تزکیہ نفس کا\nقلب و جاں کی طہارت سلامِ رضا\n\nباعث لطف رب ہے ثنائے نبی\nوجہِ تحصیل رحمت سلامِ رضا\n\nاس کا ہر شعر مقبول سرکار ہے\nحامل شان و عظمت سلامِ رضا\n\nاس کے حرفوں میں پنہاں فیوضات ہیں\nہے رضا کی کرامت سلامِ رضا\n\nاستعارہ ہے یہ رفعت ذکر کا\nدہر میں تا قیامت سلامِ رضا\n\nسوچیے یہ علامت ہے کس چیز کی؟\nآج تک ہے سلامت سلامِ رضا\n\nاس کو کیسے نہ اردو کا بردہ کہیں\nہے خود اس کی شہادت سلامِ رضا\n\nشک نہیں اہل اردو ادب کے لیے\nہے اِک انمول نعمت سلامِ رضا\n\nساتھ شہزادؔ قدسی بھی ہوں ہم زباں\nجب پڑھوں وقت رخصت سلامِ رضا"
  },
  {
    "id": 79,
    "title": "’’کنزِایمانِ رضا‘‘",
    "description": "گل تراجم کے چمن کا کنزِ ایمانِ رضا\nآئینہ دل کی لگن کا کنزِ ایمانِ رضا\n\nوقف تھا بہر ثنائے مصطفی جو ہر گھڑی\nفیض ہے ایسے دہن کا کنزِ ایمانِ رضا\n\nڈھل گیا اردو زباں میں عکس قرآن حکیم\nمعجزہ ہے علم و فن کا کنزِ ایمانِ رضا\n\nماحی رفض و خروج و ردّ امکان نظیر\nکھو جتا ہے کھوٹ من کا کنزِ ایمانِ رضا\n\nضامن حفظ عقائد حامی دین متیں\nراستہ خلد عدن کا کنزِ ایمانِ رضا\n\nغیر ممکن ہے کہ کوئی اور ہو اس کا مثیل\nہے نشاں اہل سنن کا کنزِ ایمانِ رضا\n\nفیضیاب اس سے ہوئے ہیں اپنے بیگانے سبھی\nرہنما ہر مرد و زن کا کنزِ ایمانِ رضا\n\nخالق یکتا و واحد کی محبت کا نقیب\nفیض سلطان زمن کا کنزِ ایمانِ رضا\n\nدیکھئے شہزاد ؔ خوش بختی ہماری دیکھئے\nآج ہے عنواں سخن کا کنزِ ایمانِ رضا"
  },
  {
    "id": 80,
    "title": "حصہ فارسی",
    "description": "الٰہی لذّتِ حمد و ثنایت دہ زبانم را\nزمشک نعتِ پیغمبر معطّرکن دہانم را\n\n(مخلص مجدّدی)\nمناجات بدرگاہ قاضی الحاجات\n\nشب و روز من در خرابات ہستم\nگرفتار لغو و خرافات ہستم\n\nنداریم سرمایۂ ذوقِ قلبی\nتہی از مقام و کمالات ہستم\n\nپریشان گشتم ز احوالِ باطن!\nخدایا بعید از عبادات ہستم\n\nگنہگار ، مسکین و عاجز فقیرم\nنہ من صاحب خرق عادات ہستم\n\nنخواہیم نام و نمود و نمائش\nنہ مائل بہ کشف و کرامات ہستم\n\nنہ شب زندہ دارم ، نہ صائم نہارم\nصد افسوس دور از مناجات ہستم\n\nبجز نسبت شاہ چیزی ندارم\nغلام غلامانِ سادات ہستم\n\nبہ بزم رنگارنگ حیران و تنہا\nچو صحرا خواد خیالات ہستم\n\nملاقات خواہم ز حاضر جوابے\nکہ شہزادؔ پر از سوالات ہستم"
  },
  {
    "id": 81,
    "title": "مناجات",
    "description": "درِ عنایت کُشا الٰہی\nکہ درد خواہد دوا الٰہی\n\nبدرگہِ تو وصال یا بم\nقبول کن ایں دعا الٰہی\n\nحقیر ہستم ، فقیر ہستم\nزعجز دادم صدا الٰہی\n\nنگاہ داری مرا ز نفسم\nبکن زخواہش رہا الٰہی\n\nعداوتے دہ بہ دشمنانت\nبہ دوستانت وفا الٰہی\n\nبہ قلب ذکرت کنیم دائم\nبروح مدح و ثنا الٰہی\n\nشمار مارا در اہل عرفاں\nبہ بخش خوی رضا الٰہی\n\nچنیں میسر شود خشیّت\nکنم گریز از ریا الٰہی\n\nدرود بر ذات پاک حضرت\nکہ نامِ او مصطفی الٰہی\n\nثناگر تو گل و گلستاں\nپیمبر تو صبا الٰہی\n\nچو شمع باشم برای عالم\nبکن تجلی نما الٰہی\n\nکسے کہ نسبت ندارد از تو\nمرا از و کن جدا الٰہی\n\nنمی ز اشک بلال خواہم\nبساز ابوذر نما الٰہی\n\nبہ حمد رومیؔ بہ نعت جامیؔ\nہزار دفتر فدا الٰہی\n\nبدار شہزادؔ را نگاہے\nبفیض خیرالوریٰ الٰہی"
  },
  {
    "id": 82,
    "title": "منظومہ مخلصیہ",
    "description": "من العبد الی المعبود\nنہ ایں خواہم نہ آں خواہم ، خدا خواہم خدا خواہم\n\nنخواہم عرش و کرسی را ، لقا خواہم لقا خواہم\nندانم رنگ و صورت را نبینم کشف عالم را\n\nبجویم وصل ذات حق ، نہ من صوت و صدا خواہم\nکسی افتاد میگوید اگر عشق الٰہی را\n\nبلا را دوست میدارم ، بلا خواہم بلا خواہم\nکسی دنیا ، کسی عقبیٰ ، کسی کشف و کرامت را\n\nمن از پروردگارِ خود ، رِضا خواہم رِضا خواہم\nخبردار و نگہدار خلائق ، ہست ربّ من\n\nنمی گوئم کہ من خواہم ، چرا خواہم چرا خواہم\nبہ دل ذکر الٰہی را ، بہ خلقت خیرخواہی را\n\nزدست خویش ، من جود و سخا خواہم سخا خواہم\nگنہگارم گنہگارم ، نہ اخلاص و عمل دارم\n\nفقط شہزادؔ از مرشد ، دعا خواہم دعا خوا"
  },
  {
    "id": 83,
    "title": "نعت شریف",
    "description": "میانِ رسولاں عجب شان داری\nکہ روح الامیں وار دربان داری!\n\nگدائے درت تاجدارانِ عالم\nکہ رشک افلاک ایوان داری\n\nچنین حسن از خالق خود گرفتی\nکہ در عاشقاں ذات رحمن داری\n\nتجلائے نورِ تو صدیق و حیدر\nعقیقین فاروق و عثمان داری\n\nجنابِ زبیر و بلال و ابوذر\nاسامہ و طلحہ و سلمان داری\n\nاے سردارِ افواج جن و ملائک\nبیک تن کل اوصافِ انسان داری\n\nتو ہستی بلا ریب قرآنِ ناطق\nبہر قول تفسیرِ قرآن داری\n\nمنور جہانِ کمالات از تو\nچنین شاہی ملک عرفان داری\n\nکرم گستر و خیرخواہ رقیباں\nعجب پُر محبت دل و جان داری\n\nبر احوالِ شہزادؔ چشمِ عنایت\nکہ تو شانِ الطاف و احسان داری"
  },
  {
    "id": 84,
    "title": "منقبت",
    "description": "داتا گنج بخش علی ہجویری h\nخزاں باشد چرا در لالہ زارم\n\nبدل حُبّ شہ ہجویر دارم\nز چشم گنج بخش امید وارم\n\nگلستانے بود ایں خار زارم\nز ابر التفاتے فیض عالم\n\nگل تازہ و فصل نو بہارم\nبفیضِ نسبتِ مخدوم غزنی\n\nبہر گام و مہمے کام گارم\nغلامِ از غلامانِ علی ام\n\nگدائے بارگاہِ تاجدارم\nچراغ خانقاہ پیر ختلی\n\nمنور کن شب تاریک و تارم\nحجابات مرا ہم بر کشائی\n\nمرید و مبتدی خاکسارم\nبتلقینِ شہ بغداد و غزنی\n\nمحب اہل بیت و چار یارم\nمراد شبلی و حصری و ختلی\n\nمتاع خویش با تومی سپارم\nمرا شہزادؔ شد کشف حجابے\n\nگنہگارم ، بر عصیاں شرمسا"
  },
  {
    "id": 85,
    "title": "منقبت",
    "description": "داتا گنج بخش علی ہجویری h\nزجامِ حبّ او سر شار و مستم\n\nمُرید سیّدِ ہجویر ہستم\nبفیض جلوۂ واحد شناسے\n\nبتان حرص و ہستی را شکستم\nگریزاں از درگردن فرازاں\n\nبہ در گاہش سر افگندہ و پشم\nبہ فیضان نگاہ پیر کامل\n\nصنم گر نیستم نے زر برستم\nنمی خواہم دگر شہزادؔ چیزے\n\nہمیشہ باد دامانش بدس"
  },
  {
    "id": 86,
    "title": "منقبت",
    "description": "امام ربانی مُجدّد الف ثانی h\nدہد کار خضری کتابِ مجدد\n\nز صد بحر اولیٰ حبابِ مجدد\nمنور زنورش ہمہ الف ثانی\n\nفروغ عمل ز اکتسابِ مجدد\nشب ہند را کرد صبح فروزاں\n\nچو شد جلوہ گر آفتابِ مجدد\nمنم از غلامان مہر خراساں\n\nنباشم چرا باریابِ مجدد\nبہ فیض نگاہ شفاعت پناہی\n\nبہ محشر شوم در حسابِ مجدد\nعلاقہ بہ سلطان سرہند دارم\n\nنخواہم چرا خیرِ بابِ مجدد\nوراء الوارء الوری ذات واجب\n\nچہ خوب است قول صوابِ مجدد\nعیاں کرد اسرار آفاق و انفس\n\nعجب ہست کشف حجابِ مجدد\nطریقی کہ شہزادؔ بے شرع باشد\n\nبماند تہی ز انتسابِ مج"
  },
  {
    "id": 87,
    "title": "منقبت",
    "description": "امام احمد رضابریلویh\nذوق رومی ٗ سوز جامی با خدا آ مو ختم\n\nعشقِ احمد از امام احمد رضا آموختم\nہمچو بلبل در خیالِ جانِ عالم نغمہ زن\n\nدر حدیقہ ھای بخشش ایں ادا آموختم\nمحبّان پیمبر جان و دل کردن فدا\n\nباعدوش بغض ہم زیں رہنما آموختم\nشاہراہ عشق دیدم از بریلی تا حجاز\n\nطور رفتن چیست؟ سوی دلربا آموختم\nآنکہ شرع و عشق را در نعت خود آمیختہ\n\nنعت گوئی ہم ازاں حق آشنا آموختم\nچوں کسے پر سد کہ از کے یافتی سوز و گداز\n\nایں ہنر گویم ، زعبد مصطفی آموختم\nآں محدّث بودہم شہزادؔ مفتی و فقیہ\n\nمن بہ ذکر اُو صفای قلب را آموخ"
  },
  {
    "id": 88,
    "title": "منظومہ اقبالیہ",
    "description": "ای اقبال! ہستی بہ افکار زندہ\nوجودت بانداز اشعار زندہ\n\nچہ پُر مغز و تازہ خیالات داری\nعجب سوز و ساز و کمالات داری\n\nاشارت بسوی حقائق نمودی\nسہل تر ز فکرت دقائق نمودی\n\nنہاں در کلام تو اسرارِ رُومی\nعیاں از بیان تو اذکارِ رُومی\n\nچو آئینہ شعر و ابیات دِیدم\nتفاسیر و توضیح آیات دِیدم\n\nچہ خوش بود قالِ تو در حال بودے\nنمود و خشیّت در اعمال بودے\n\nبمقصود پیش از مہ و سال رَفتن\nچہ خوب است از راہِ اقبال رَفتن\n\nنہاں را عیاں تر چو شہزادؔ خواہی\nچو اقبال جوئی ز رحمت پناہی"
  },
  {
    "id": 89,
    "title": "منقبت",
    "description": "علامہ محمد اقبالh\nای حکیمِ اُمت ! ای دانائی راز\n\nای دلت گنجینۂ سوز و گداز\nای گلِ گلزارِ عشقِ مُصطفٰی\n\nای چراغِ مجلس ناز و نیاز\nای کہ کحل چشمِ تو خاکِ نجف\n\nای کہ در انفاس تو بوی حجاز\nقبلۂ افکار تو اُمّ الکتاب\n\nپیشوایت عشقِ احمد در نماز\nای بلند اقبال ہمچو نام خویش\n\nپست پیشِ ہمتت کوہِ فراز\nچوں شدی ا ز ’’پیرِ رُومی‘‘ فیضیاب\n\nچشمِ سرّت التفاتش کرد باز\nای زبان خاور! ای شِیریں سخن\n\nقلب من با شعرِ تو دارد نیاز\nچوں شدم شہزادؔ با اقبال، من\n\nپیش من کوتاہ شد راہِ در"
  },
  {
    "id": 90,
    "title": "مہرِخراسان",
    "description": "مجموعۂ مناقب\nدرشان حضرت اخندزادہ\n\nسیف الرحمن پیر اَرچی مبارک h\nنقشبندیہ عجب قافلہ سالاران اند\n\nکہ برند از رہِ پنہاں بہ حرم قافلہ را\n(مولانا جامی)\n\nسلام\nاے شہ ملک ولایت السلام\n\nاے مہ چرخ طریقت السلام\nمرکز نور ہدایت السلام\n\nعاشق شمع رسالت السلام\nرہنمائے راہ حق و معرفت\n\nصاحب شان وجاہت السلام\nانت من اصحاب احوال القلوب\n\nواقف راز حقیقت السلام\nای شبیہِ تاجدار نقشبند\n\nای نگہبان شریعت السلام\nپیکر الفت ز سرتاپا شفیق\n\nباعث رشک مروت السلام\nفی زمانہ بے نظیر و بے مثال\n\nای مبارک! پاک طینت السلام\nذات پاک تست فخر اولیاء\n\nپیکر حق و صداقت السلام\nبارضاء و باعطا و باخدا\n\nپاسبان اہلسنّت السلام\nای رئیس حلقۂ اہل سلوک\n\nجان و جانانِ اطاعت السلام\nبے ردا شہزاد ہست ای خوش خصال\n\nکن عطا مارا ردایت السلام\nیک نظر کن سوئے شہزادؔ حقیر\n\nای مبارک از محبت السل"
  },
  {
    "id": 91,
    "title": "منقبت",
    "description": "منقبت درشان قیوم زماں حضرت اخندزادہ\nسیف الرحمن پیرا رچی h\n\nبہ پیر ارچی سلام گوئم\nبذرگ و عالی مقام گویم\n\nای سیدی ، مرشدی ، حبیبی\nترا زماں را امام گویم\n\nتو بایزید و جنید ثانی\nکہ بغض از تو حرام گویم\n\nبرائے ماکن دعا خدارا\nیک عرض با احترام گویم\n\nمحبت تو عبادت من\nبصد ادب من سلام گویم\n\nمجدّد وقت ، ای مبارک!\nثنائے تو صبح و شام گویم\n\nاے سیف رحماں ای مرشد من\nقبول کن ایں کلام گویم\n\nبرائے شہزادؔ ، ہست نعمت\nکہ مدحت تو مدام گویم!"
  },
  {
    "id": 92,
    "title": "منقبت",
    "description": "در شان قیوم زماں حضرت اخندزادہ\nسیف الرحمن پیرا رچی h\n\nسیف رحماں سید و سردار من\nسید و سردار من دلدار من\n\nمن نہ خواہم گنج ھا و تخت ھا\nہست دید روی تو درکار من\n\nمن نمی دانم زبان فارسی\nای مبارک ! کن قبول ایں کارمن\n\nشان تو بالاتر از گفتار ھا\nمن کجا آقا! کجا گفتار من\n\nمثل دشت خشک شد ایں قلب ما\nقلبِماکن گلستاں سرکار من\n\nدر طریقت آفتابی ، بی زوال\nتا ابد محتاج تو انوار من!\n\nکمتریں شہزادؔ ہست ای باکمال\nکن قبول از لطف ایں اشعار من"
  },
  {
    "id": 93,
    "title": "منقبت",
    "description": "درشان قیوم زماں حضرت اخندزادہ\nسیف الرحمن پیرا رچی h\n\nجز خدمت تو آقا! دگر کار نخواہیم\nبر خار تو خوش لالہ و گلزار نخواہیم\n\nما سادہ و ناچیز و گنہگار و سیہ کار\nخواہیم خدا ، جبہ و دستار نخواہیم\n\nبرپای تو قربان کنم قلب و جگر را\nداریم بہ دل عشق تو اظہار نخواہیم\n\nخواہیم وصال تو در ایں دنیا و عقبیٰ\nجز ہستیٔ تو ہیچ ، ای دلدار نخواہیم\n\nپوشیدہ ازین دہر شوم کاش چو عنقا\nمن شہرت خود برسرِ بازار نخواہیم\n\nدر بحر محیط تو رسد قطرئہ جانم\nمن فلسفہ و رفعت افکار نخواہیم\n\nتائب شدم از دعوٰیٔ سجادہ نشینی\nمن طالب حق جنت ابرار نخواہیم\n\nشہزادؔ غلام ابن غلام ابن غلامت\nبس غیر ازیں ھیچ ، ای سردار نخواہیم"
  },
  {
    "id": 94,
    "title": "منقبت",
    "description": "درشان قیوم زماں حضرت اخندزادہ\nسیف الرحمن پیرا رچی h\n\nای مہر خراسان! فدا بر تو کنم جان\nای مرشد ذیشان ! فدا بر تو کنم جان\n\nاز نسبت تو شد خس و خاشاک معزز\nای سیّد و سلطان! فدا بر تو کنم جان\n\nای مرشد ما ! غوث جہاں! عارف کامل\nای قاسم فیضان! فدا بر تو کنم جان\n\nتو ابر کرم! مظہر انوار الٰہی!\nکن برسرم احسان فدا بر تو کنم جان\n\nجز دیدئہ تر ہیچ نداریم کریما\nمن بے سروسامان ! فدا بر تو کنم جان\n\nدر نامۂ اعمال عمل نیک نبینم\nمن نادم و نادان ! فدا بر تو کنم جان\n\nارشاد تو تفسیر فرا مین پیمبر\nتعلیم تو قرآن فدا بر تو کنم جان\n\nای باعث تشہیر کمالات نبوت\nای مرد خدادان ! فدا برتو کنم جان\n\nتلقین تو اکسیر دگر گونی افکار\nای شاہد ایمان ! فدا بر تو کنم جان\n\nگمراہ ز الطاف تو شد رہبر و ہادی\nای رحمت رحمان ! فدا بر تو کنم جان\n\nبر حالت شہزادؔ بکن چشم تصرف\nہر لحظہ و ہر آن ! فدا بر تو کنم جان"
  },
  {
    "id": 95,
    "title": "منقبت",
    "description": "درشان قیوم زماں حضرت اخندزادہ\nسیف الرحمن پیرا رچی h\n\nدل ، جسم ، جگر ، جان ما قربان مبارک\nقیوم زماں غوث جہاں شان مبارک\n\nبے مثل درایں عصر کمالات سراپا\nاقطاب جہاں دست بہ دامان مبارک\n\nزیبا و قشنگ است قد و قامت حضرت\nپُر بادہ دلم گشت ز چشمانِ مبارک\n\nآرام مرا نیست بجز دید و زیارت\nدر قلب مکیں ہست بس ارمان مبارک\n\nاو سیدنا ، مرشدنا ، شیخ مشائخ\nاقطاب زمان خیل غلامان مبارک\n\nہر غنچہ و گل خنداں و رنگین و معطر\nزیبا و دل افروز گلستان مبارک\n\nکن شکر خدا ، حمد صمد ، ذکر الٰہی\nشہزادؔ شدی خادم دربان مبارک\n\nاز فضل خدا ، رحمت حق لطف الٰہی\nشہزادؔ شدہ شاعرِ ایوانِ مبارک"
  },
  {
    "id": 96,
    "title": "منقبت",
    "description": "درشان قیوم زماں حضرت اخندزادہ\nسیف الرحمن پیرا رچی h\n\nرونق بزم طریقت از تو است\nمحفل ما پرمسرت از تو است\n\nروشنیٔ چشم ما دیدار تو\nسینۂ ما پر حرارت از تو است\n\nقلب ، روح و سر ، خفی اخفیٰ ہمہ\nمائل ذکر و اطاعت از تو است\n\nہر غلام تو ولی اللہ شہا!\nدر جہاں باقی ولایت از تو است\n\nبر تو نازاں گشت شاہِ نقشبند\nزِندہ سرہندی روایت از تو است\n\nدرسھای تو طریق مصطفی\nآبروی استقامت از تو است\n\nدید تو شہزادؔ را عید سعید\nبا خدا مارا محبت از تو است"
  },
  {
    "id": 97,
    "title": "منقبت",
    "description": "حضرت مبارک صاحب h\nاللہ اللہ کمال شانِ تو\n\nانجمن انجمن بیانِ تو\nاز خراسان تابہ پاکستان\n\nیافتم جا بجا نشانِ تو\nشرح اوصاف تو شہا ، چہ کنیم\n\nوقف دین رسول جانِ تو\nرہروانِ صراط مستقیم\n\nعکس ذات تو پیروانِ تو\nاولیاء قطب و غوث لاریب اند\n\nراز دانان و واقفانِ تو\nمثل شمع فروزاں تو ہستی\n\nمثل پروانہ عاشقانِ تو\nفیض و عرفان، از تو وابستہ\n\nمرکز رشد آستانِ تو\nنعمت بے بہا وجودِ تو ست\n\nای خوشا یافتم زمانِ تو\nسنگ از صحبت تو گوہر شد\n\nپُر ز دُرہا تمام کانِ تو\nگشت پنجاب از تو پر انوار\n\nبے عدد اینجا خادمانِ تو\nگرد کعبہ کند طواف جہاں\n\nکعبہ چکر گر مکانِ تو\nذاکریں مثل عندلیبانِ اند\n\nزمزمہ خواں بہ گلستانِ تو\nرحم فرما کریما! بر حالم\n\nآمدم زیر سائبانِ تو\nسیف رحماں بگیر دست ما\n\nشد پریشان مدح خوانِ تو\nروز و شب می کند دعا شہزادؔ\n\nذاتِ حق باد پاسبانِ تو\nقصیدہ\n\nسیفیہ، رحمانیہ، در شانِ مجددالعصر، پیر طریقت حضرت\nاخندزادہ سیف الرحمن پیرارچیh\n\nیا الٰہی پاک تو سبحان تو\nخالق ارض و سما ذیشان تو\n\nمالک کونین ربّ بحر و بر\nصاحب و مختارِ کارِخیر و شر\n\nبعداز حمد خدا نعت رسول\nبہترین بعد از خدا ذات رسول\n\nسیدّالابرار شاہ دوسرا\nصاحب لولاک ، امام الانبیاء\n\nحضرت صدیق از صد ہا سلام\nکاروان عاشقاں را او امام\n\nبعد از حمد و درود و منقبت\nذکر خیر پیر عالی مرتبت\n\nسیف رحماںپیرا رچی نام اوست\nپر زنور معرفت ہر جام اوست\n\nمثل ہجویری و ہندی کار او\nمثل سرہندی ہمہ کر دار او\n\nآن کہ ناز دودمان نقشبند\nگفتگویش چون گلاب و برگِ و قند\n\nصحبت او باعثِ تسکین جان\nخادم دربار اوہر میرو خان\n\nدید روئش بہر من عید کلاں\nحسن او بالا تر از شعر و بیان\n\nمحفل او محفل ذکر خدا\nمجلس او بزم ذکر مصطفی\n\nپاک طینت نیک سیرت بے ریا\nمرشد من بارضا و باخدا\n\nہر ارادت مند را او سائباں\nدست او کوتاہ نیست از غائباں\n\nاللہ اللہ قلب را زندہ کند\nسیف رحماں ، سینہ تابندہ کند\n\nسیف رحماں، رہنمائے سالکاں\nسیف رحماں ، صدر بزم عارفاں\n\nای شہا ! شمشیر حق روشن ضمیر\nکن قبول از لطف ایں نذر حقیر\n\nنسبت تو ای شہا ! اعزاز من\nمدحت تو وجہ فخر و ناز من\n\nیا الٰہی رحم کن بر ذات او\nتاابد پائندہ باد ایں ھا و ہو\n\nفکر ما از یاد تو آباد شد\nچشم ما روشن دل ماشاد و شد\n\nمیشود شہزادؔ نغمہ خوان تو\nنغمہ خوان تو ، قصیدہ خوان تو\n\nبلبل گزار تو شہزادؔ شد\nشاعر دربار تو شہزادؔ شد"
  },
  {
    "id": 98,
    "title": "منقبت",
    "description": "حضرت مبارک صاحب h\nبزمِ اہلِ عشق رقصاں از نگاہ مست تو\n\nدشت قلبم شد گلستاں از نگاہِ مست تو\nلطف بر پنجاب کر دی ازرہ اہل قلوب\n\nتیرہ شب شد صبح تاباں از نگاہِ مست تو\nبے ثمر ہر نخل بود و خالی از بو گل تمام\n\nیک چمن شد ہر بیاباں از نگاہِ مست تو\nمحفل جذب و جنون و ذوق و شوق و ھاوہو\n\nپیرمن! ای سیف رحماں! از نگاہِ مست تو\nای کریما! طالب یک چشم لا ہوتی منم\n\nکار مشکل باشد آساں از نگاہِ مست تو\nای مجدد! جانشین شیخ سرہندی توئی\n\nنقشبندیت فروزاں از نگاہِ مست تو\nباغِ سُنّت میشود از آمد تو پر بہار\n\nزندہ دل قیوم دوراں از نگاہِ مست تو\nتشنہ لب شہزادؔ ہست اے ساقی ٔ جام و صال\n\nدارد ایں امیدِ احساں از نگاہِ مست "
  },
  {
    "id": 99,
    "title": "منقبت",
    "description": "درشان قیوم زماں حضرت اخندزادہ سیف الرحمن پیرا رچی h\nمزین ز صدق و صفا سیف رحماں\n\nمنور ز سر تابہ پا سیف رحماں\nبگویم چہ اوصاف قیوم عالم\n\nکہ اظہار شان خدا سیف رحماں\nبگفتار و کردار بے مثل و یکتا\n\nمقامات دارد جدا سیف رحماں\nرواں کاروان ولایت ز فیضش\n\nولی مقتدی ، مقتدا سیف رحماں\nتو سر خیل افواج اہل حقیقت\n\nتوئی رہبر و رہنما سیف رحماں\nز نور تو قلب و نظر شد منور\n\nتوئی زندہ رُود ھدٰی سیف رحماں\nکجامن غلام و کجا پیرارچی\n\nکجا من حقیر و کجا سیف رحماں\nتو بہر مریداں چنین سائبانی\n\nمددگار و مشکل کشا سیف رحماں\nفقیرانہ در بارگاہ تو آمد\n\nمگردان شہزادؔ را سیف رحم"
  },
  {
    "id": 100,
    "title": "منقبت",
    "description": "درشان حضرت سیدی اخندزادہ\nسیف الرحمن پیر ارچی h\n\nحیات دل اگر خواہی مرید شیخِ دوراں شو\nبیا ! ای طالب صادق غلام سیف رحماں شو\n\nتراکافی ست از صد ہا چلہ یک صحبت ایشاں\nچو خواہی قربت مولا ، قریب نقشبنداں شو\n\nبرای تجربہ در قریۂ فیضش گدائی کن\nبہ بر از باب الطا فش تجلی ہا و سلطاں شو\n\nاگر واصل شدن خواہی بہ اصل خویش ای سالک\nبصدقِ باطنی حلقہ بگوش پیر پیراں شو\n\nچرا وقف مئے حرص و ہوای نفس می باشی\nگزار ایں رسمہا و شامل تقریب مستاں شو\n\nرساند روح را از فیض ہو بر اَوجِ لاہوتی\nبیا و دستگیر دامن محبوب سبحاں شو\n\nدعا شہزادؔ کن بہر شفای آں شہِ ذیشاں\nفلاح کل اگر خواہی بہ پای شَیخ قرباں شو\n\n(حسب ارشاد حضرت مرشدی مبارک قدس سرہ"
  },
  {
    "id": 101,
    "title": "منقبت",
    "description": "شان حضرت سیدی اخندزادہ\nسیف الرحمن پیر ارچی h\n\nکریما! کریما! نگاہِ کرم کن\nخدارا خدارا نگاہِ کرم کن\n\nمریضانہ آمد ، بدر گاہت عالم\nمسیحا! مسیحا! نگاہِ کرم کن\n\nنداریم نسیان از ماسوا من\nمریضم طبیبا! نگاہِ کرم کن\n\nگرفتار شد در ہجوم مصائب\nغلام تو آقا! نگاہِ کرم کن\n\nبنام تو منسوبم الحمدللہ\nبر احوال مار ا نگاہِ کرم کن\n\nمگر داں نگا ہے ازیں داد خواہے\nبمن کار سازا نگا ہِ کرم کن\n\nبراحوال شہزادؔ ہم ملتفت شو\nز لطف و عطایا نگاہِ کرم کن"
  },
  {
    "id": 102,
    "title": "منقبت",
    "description": "حضرت اخندذادہ سیف الرحمن مبارک\nشیخ کامل ، پیر ارچی ، قبلۂ عالم اغث\n\nرحم کن برحال زارم ازپئے ہاشم اغث\nجز درِ لطف و عطائے تو کجا گیرم پناہ\n\nمرجع قلب و نظر جز تو کجا دارم اغث\nشانِ شایانِ کمالِ خویش ای مشکل کشا!\n\nبابِ فیض خود کشا ای نازش حاتم اغث\nیک نگاہِ تو کریما! درد جانم را علاج\n\nشد  دگرگوں حالِ من ای واقفِ حالم اغث\nبرسرِ پیکار ہستم من خلاف نفس خویش\n\nازرہ خسران گشتم تائب و نادم اغث\nبر دِل شہزادؔ باشد یک نگاہ التفات\n\nکشورِ اہل لطائف را توئی حاکم ا"
  },
  {
    "id": 103,
    "title": "منقبت",
    "description": "حضرت قطب دوراں\nمرشدی صوفی کندل خان h\n\nکمال دارد کمال صوفی\nنخواہد آمد مثال صوفی\n\nمحیط عالم جلال صوفی\nشبیہ یوسف جمال صوفی\n\nجلائے فکر و شعور از وے\nضیائے باطن خیال صوفی\n\nفروغ داد اونظام حق را\nدروغ ترسد ز قال صوفی\n\nموافق اہل صدق روحش\nخلاف باطل ، جدال صوفی\n\nوفا و فقر و غنا ، توکل\nہمیں ست مال و منا ل صوفی\n\nجواب خواہد ز اہل ہمّت\nکہ بار دارد سوال صوفی\n\nبہ وجد می برد سالکاں را\nلقائے حسن و جمال صوفی\n\nبیا ببیں گر نگاہ داری\nچہ ہست اوج کمال صوفی\n\nبیار شہزاد نغمۂ نو\nبخوان نظمی بہ حال صوفی\n\nکثیر شہزادؔ ہست باقی\nقلیل گفتم ز حال صوفی"
  },
  {
    "id": 104,
    "title": "منقبت",
    "description": "پیر طریقت صوفی کندل خان h\nاگر خواہی طریقت ، شو گدائے صوفی کندل\n\nبیا طالب ، ببین صدق و صفاائے صوفی کندل\nسکون قلب و روح مالقائے صوفی کندل\n\nخوشا ھستیم من زیر ردائے صوفی کندل\nکجا بودم کجا ہستم زخود پرسان میکنم\n\nصدا آمد کہ ہستی از د عائے صوفی کندل\nعدوّ اولیاء را حق عدوّ ، ذات خود گوید\n\nمکن ای معترض شک بروفائے صوفی کندل\nخدا آن روزہم آرد کہ پابوسی کنم او را\n\nببینم ذود روے دلرباے صوفی کندل\nاگر پرسی مقام او امام الاولیاء گویم\n\nکنند اہل ولایت اقتدائے صوفی کندل\nزیک نعرہ ھو زندہ بسازد قلب مردہ را\n\nصداے قم باذن اللہ ، صدائے صوفی کندل\nشفیق و مہربان من کریم و پاسبان من\n\nغنی ام در فقیری ، ازسخائے صوفی کندل\nمنم شہزاد ناکارہ گنہگاریم بے چارہ\n\nبہ دنیا آمدم شاید برائے صوفی کندل\nقلم عاجز زبان قاصر بیاں شہزادؔ نا ممکن\n\nشعور و شعر و فکر ما فداے صوفی کن"
  },
  {
    "id": 105,
    "title": "منقبت",
    "description": "اعلیٰ حضرت قطب زماں صوفی باصفا\nحضرت صوفی کندل خان h\n\nمحبوب ہمہ ، مرشد ما صوفی کندل\nہست عاشق محبوب خدا صوفی کندل\n\nسر تا بقدم صدق و صفا صوفی کندل\nدر عشق نبی ہست فنا صوفی کندل\n\nآں قطب جہاں ،صوفی و یکتائے زمانہ\nہم مرتبۂ اہل رضا صوفی کندل\n\nبے حال و پریشان شد ایں قلب زہجراں\nدل طالب دیدار شما صوفی کندل\n\nای سیدی! ای مرشدی! ای پیر طریقت\nمن خادم خدام شما صوفی کندل\n\nشد قلب سیہ نور علیٰ نور زفیضش\nوے جانِ کرم، روحِ سخا صوفی کندل\n\nاللہ کند مرتبہ ات بالا و والا\nبا عجز و نیاز است دعا صوفی کندل\n\nشہزادؔ زہے مرشد ما قطب زمانی\nآں مظہر حق گنج وفا صوفی کندل"
  },
  {
    "id": 106,
    "title": "قطعہ تاریخ وفات",
    "description": "حضرت مرشدنا صوفی کندل خان صاحب مبارکh\nصوفیٔ بے مثل بود و واقف اسرار بود\n\nپیکر صدق و توکل ، صاحب کردار بود\nظلمت جاں از فیوضش گشت صبح تابناک\n\nپیرمن شہزادؔ واللہ ، مظہر انوار بود\n۱۴۱۵ھ\n\n(متوفی ٰ ۷ شعبان ۱۴۱۵ھ جنوری 1995"
  },
  {
    "id": 107,
    "title": "منقبت",
    "description": "علّامہ عبد الحکیمشرف قادری h\n’’بیاد ِروئے شرف‘‘\n\nدلا بیا کہ حکایت کنم زروئے شرف\nشرف دہیم بیاں رابگفتگوئے شرف\n\nفروغ داد بگیتی علوم و حکمت را\nبلند تر ز فلک رفت آبروئے شرف\n\nدلش ز نور ولائے رسول پر بودے\nچرا بہشت نباشد بہ جستجوئے شرف\n\nچو بود خادم قرآن و دین و شرع متیں\nخمیدہ فرق شہاں ہست روبروئے شرف\n\nشرف گرفت زمولا باسم عبد حکیم\nبفیض علم ، شرف شد رواں بسوئے شرف\n\nتہی نگشت گدائے زباب دانش او\nنہ تشنہ رفت کسے از کنار جوئے شرف\n\nچنیں مربی و مشفق دلا کجا یابی\nبیا بیا کہ روانہ شوم بکوئے شرف\n\nچو گشت فائز سجادئہ شرف ممتاز\nکہ در وجود سعید است مو بہ موئے شرف\n\nبفیض اسوئہ سلطانِ انبیاء شہزادؔ\nعزیز ا ہل نظر گشت خلق و خوئے شرف"
  },
  {
    "id": 108,
    "title": "منقبت",
    "description": "حضرت پیر سید نصیرالدین نصیرگولڑویh\nبیادِ نصیر\n\nز بزم اہل سخن رفت آ بروئے سخن\nکجا کلیم کہ می کرد گفتگوئے سخن\n\nاگر تو گوش بداری بیابہ بزم نصیر\nازو ملائکہ دارند آرزوئے سخن\n\nببیں ہنوزہم آغوش حیرتے دارد\nہماں ست ’’رنگ نظام‘‘ و ہماں ست خوئے سخن\n\nبفیض مدح نبی و ولائے آل نبی\nبکنج گور رواں ہست آبجوئے سخن\n\nبرنگ بیدل و جامی و خسرو و حافظ\nبفیض نسبتے او تابناک روئے سخن\n\nچو گفت نعرہ تکبیر در جہانِ انا\nشدند ہمچو بتاں ساکنان کوئے سخن\n\nسکوت کرد چو آں بلبل ہزار نوا\nتہی ز شوق ازاں ہست ہاوہوئے سخن\n\nنمائی جلوہ زیباکہ منتظر باشند\nبرائے دید شما بادہ و سبوئے سخن\n\nسرود زمزمۂ شعر در خرابہ ما\nمعطر از دم او باد مشکبوئے سخن\n\nرسید تا لب من سوزش دلے شہزاد ؔ\nبیا کہ قصد کنم جانب نکوئے سخن"
  },
  {
    "id": 109,
    "title": "نذرِ نصیر",
    "description": "دیدم یکے دل دادئہ عبدالقادر\nثابت قدمے جادئہ عبدالقادر\n\nمداح کمال شہ جیلاں شہزادؔؔ\nدر گولڑہ شہزادۂ عبدالقادر"
  },
  {
    "id": 110,
    "title": "منقبت",
    "description": "پیرزادہ اقبال احمد فاروقیh\nخوشا چہ حسن و بیان کلام فاروقی\n\nشنو! کلام بلاغت نظام فاروقی\nتمتع کرد زہر گوشۂ جہان رضا\n\nزہے روان و دل شاد کام فاروقی\nچو ہم سخن نہ شدی روبمجلس اقبال\n\nکشادہ ہست در فیض عام فاروقی\nدلت ہوائے لقائے گزشتگاں دارد\n\nبیار طائر جاں را بہ دام فاروقی\nخبر زحال دل اہل حال ہم دارد\n\nکنند اہل نظر احترام فاروقی\nبایں بزرگی و پیری ہم است زندہ دلے\n\nچہ دلکش است بلوغ المرام فاروقی\nبفیض صحبت و دیدار عارفاں شہزادؔ\n\nچہ تابناک شدہ صبح و شام فارو"
  },
  {
    "id": 111,
    "title": "حصہ پنجابی",
    "description": "حمد باری تعالیٰ\nپچھلے دکھ بھلا دے مولا\n\nازمائشاں دی پٹھی دے وچ\nکچی ڈھیم پکا دے مولا\n\nاک گردن سو وار کٹاواں\nایسا فن سکھا دے مولا\n\nگھمن گھیری وچ آ پھسیاں\nمینوں پار لنگا دے مولا\n\nبندہ نئیں جے اُف وی کرجاں\nمیرا انگ انگ ڈھا دے مولا\n\nتیری سونہہ ایں سہہ جاواں گا\nاپنا آپ وکھا دے مولا\n\nلوکی ایس وچ شکلاں ویکھن\nدل شیشہ لشکادے مولا\n\nکرب و بلا جئے زہر پیالے\nمیرے منہ نوں لا دے مولا\n\nاپنی ایس تخلیق دے اتے\nاپنا رنگ چڑھا دے مولا\n\nجتھوں اے شہزادؔ سی ٹریا\nاوتھے ای پہنچا دے مولا"
  },
  {
    "id": 112,
    "title": "نعت شریف",
    "description": "کیتی اے جنہاں عاشقاں مدحت حضور دی\nاوہناں تے خاص ہندی اے شفقت حضور دی\n\nدھپاں چ تپ دی ریت تے پیندا اے لیٹناں\nایویں نئیں جے لب دی قربت حضور دی\n\nسوہنے نبی دے عشق دا چکھ لے توں ذائقہ\nمنہ تے سجا کے ویکھ لے سنت حضور دی\n\nچمکن ناں کیویں تاریاں وانگوں اوہ اکھیاں\nویکھی اے جنہاں خواب وچ صورت حضور دی\n\nآوندی اے آپ چل کے منزل اوہناں دے کول\nہووے جنہاں دے سامنے سیرت حضور دی\n\nدعویٰ نبی دے عشق دا ایویں ناں کر بئیں\nملدی اے من نوں مار کے نسبت حضور دی\n\nرہنی کدوں ایں یاد غُلاماں نوں کوئی شے\nہوئی جدوں نصیب زیارت حضور دی\n\nمحشر نوں ربّ دے سامنے ویکھیں تو منکرا!\nنبیاں وی منگنی ایں شفاعت حضور دی\n\nتیرا اے کی وگاڑناں شہزادؔ مشکلاں\nتیرے تے نال نال اے رحمت حضور دی"
  },
  {
    "id": 113,
    "title": "منقبت",
    "description": "حضرت علی المرتضیٰ شیر خدا t\nاچا مرتبہ نبی دے ویر دا اے\n\nکہیا نبی نے علم دا باب اوہنوں\nاوہنے کھولے نے علم دے بند بوہے\n\nکہیا نبی نے ابوتراب اوہنوں\nعلی آپ مشیر شیخین دا سی\n\nسارے پتا سن ادب آداب اوہنوں\nکیتے مڈھلے فیصلے آپ اوہنے\n\nانج ملے گا پورا ثواب اوہنوں\nجنہے علی دا مرتبہ منیاں نئیں\n\nپیش پے جانا ایں عذاب اوہنوں\nجیہڑے سینے چ حب صدیق دی اے\n\nنئیں جے علی دے بغض دی تاب اوہنوں\nجیہڑا دلوں صحابہ دی شان منے\n\nکردا وقت نئیں کدی خراب اوہنوں\nنبی پاک نے دین ایمان والا\n\nسارا آپ پڑھایا نصاب اوہنوں\nسوہنے رب نے علم خزانیاں چوں\n\nدتا خاص حصہ بے حساب اوہنوں\nایہہ شہزادؔ حدیث حضور دی اے\n\nکہیے علم دے شہر دا باب اوہن"
  },
  {
    "id": 114,
    "title": "سلام بحضور امام عالی مقامt",
    "description": "حسین ابن علی دی ہر اک ادا نوں سلام\nصدا قتاں نوں ، دلیری نوں تے وفا نوں سلام\n\nعلی دے لاڈلے لیٹے نیں تیرے ویہڑے وچ\nاے کربلائے معلی تری فضا نوں سلام\n\nسلام حضرتِ زینب دی پاک چادر نوں\nعقیدتاں نیں کہیا بنتِ مرُتضیٰ نوں سلام\n\nخدا دے فضل نے لایا حسین نوں سینے\nکہیا فلک نیں شہیداں دے بادشا نوں سلام\n\nرسول پاک تے، حیدر تے ، فاطمہ تے درود\nنبی تے آل نبی دے ہر اک گدا نوں سلام\n\nیزیدیاں تے ہے اج وی ترے علم دا جلال\nعباس ابن علی! تیری خاک پا نوں سلام\n\nحسین نال جو جڑیا اوہ تر گیا شہزادؔ\nگدا نوں آپ جو لبھدی اے اوس عطا نوں سلام"
  },
  {
    "id": 115,
    "title": "منقبت",
    "description": "حضرت غوث اعظمt\nنرالی تری ہر ادا غوث اعظم\n\nولی تیرے مدح سرا غوث اعظم\nنقاب اپنے رخ توں ہٹا غوث اعظم\n\nتے سینے دے وچ ٹھنڈ پا غوث اعظم\nترے سر تے سایہ حسین و حسن دا\n\nمحمد دا توں لاڈلا غوث اعظم\nقطب غوث سارے بڑی شان والے\n\nتیری شان سب توں جدا غوث اعظم\nنبوت دے سلطان خیرالورٰی نیں\n\nولایت دا توں بادشا غوث اعظم\nتسلی ملے میرے بے چین دل نوں\n\nذرا اپنی صورت وکھا غوث اعظم\nتیرے فیض دا وی مزہ چکھ لواں میں\n\nکدی اپنے در تے بلا غوث اعظم\nجویں رنگ سلطان باہو تے چڑھیا\n\nاوہو رنگ دل تے چڑھا غوث اعظم\nپریشان ہوواں نہ محشر دے دن میں\n\nرویں کول روز جزا غوث اعظم\nقدم انج ولیاں دی گردن دے اتے\n\nدھرے کون تیرے سوا غوث اعظم\nخدا موت دیوے مدینے چ مینوں\n\nکرو میرے حق وچ دعا غوث اعظم\nکرو ہن تے شہزادؔ ول وی اشارہ\n\nاے ہووے غماں توں رہا غوث اع"
  },
  {
    "id": 116,
    "title": "منقبت",
    "description": "حضرت اخندزادہ سیف الرحمن مبارک h\nمحبوب سبحانی سوہنا\n\nپیر مرا افغانی سوہنا\nپیر میرے دا چہرہ ویکھو\n\nسنت والا سہرا ویکھو\nجیویں چن اسمانی سوہنا\n\nپیر مرا افغانی سوہنا\nولی بناون جیہڑے چوراں\n\nخادم اس دے قطب دوراں\nاوہ قیوم زمانی سوہنا\n\nپیر مرا افغانی سوہنا\nداتا صاحب علی ہجویری\n\nیا ہوون خواجہ اجمیری\nاینہاں دا اے ہانی سوہنا\n\nپیر مرا افغانی سوہنا\nسو ہنی صورت ، سو ہنی سیرت\n\nچلدی پھردی نوری صورت\nتقوے وچ لاثانی سوہنا\n\nپیر مرا افغانی سوہنا\nنال توجہ قلب چلاوے\n\nمردہ دل وچ روحاں پاوے\nونڈے نور ایمانی سوہنا\n\nپیر مرا افغانی سوہنا\nمردہ دل نوں زندہ کردا\n\nہر سالک دی جھولی بھردا\nاوہ قطب ربانی سوہنا\n\nپیر مرا افغانی سوہنا\nپیر مرا شہزادؔ مجاہد\n\nخادم اوہدے عابد ، زاہد\nکردا حق بیانی سوہنا\n\nپیر مرا افغانی سوہ"
  },
  {
    "id": 117,
    "title": "روحی سجن بیلی",
    "description": "پہلی یاری رب نے لائی نال محمد پیارے\nباقی سجن بیلی جگ تے صدقہ اوس دا سارے\n\nتاں جے دل دا جانی کوئی دکھ سکھ بیٹھ ونڈائے\nایسے گلے پاک نبی وی چارے یار بنائے\n\nبدل دید تیری دا پیرا انج کنیاں بر ساوے\nسکے رُکھ امیداں والے ہو جاون نت ساوے\n\nانج تے بیلی ملن ہزاراں کوئی کوئی دل داجانی\nسچا اوہ جو یار دی خاطر دیوے ہر قربانی"
  },
  { "id": 118, "title": "", "description": "" }
]
