[
  {
    "id": 0,
    "title": "حمد باری تعالیٰ",
    "description": "ہونٹوں پہ مرے صبح و مسا حمد ہے تیری\nہر درد کی بے مثل دوا حمد ہے تیری\n\nکیا لفظ ہے الحمد لک الحمد الٰہی\nہر نعمت عظمیٰ کی جزا حمد ہے تیری\n\nتکبیر ہو تہلیل ہو تسبیح کہ تحمید\nلاریب یہ سب ذکر و ثنا حمد ہے تیری\n\nتو سرور کونین کا خالق ہے خدایا\nہر نعت نبی صلِّ علیٰ حمد ہے تیری\n\nکرتی ہیں ترا ذکر سمندر کی یہ لہریں\nگلشن میں عنادل کی صدا حمد ہے تیری\n\nکلیوں کی مہک باغ میں غنچے کا چٹکنا\nقمری کی سرِ شاخ نوا حمد ہے تیری\n\nمظہر ہیں ترے حسن کا بہتے ہوئے چشمے\nوادی کی سکوں بخش فضا حمد ہے تیری\n\nکرتی ہے ترا ذکر شب و روز کی گردش\nمہر و مہ و انجم کی ضیا حمد ہے تیری\n\nوالفجر ہو والشمس ہو والنّجم کہ اخلاص\nقرآن بھی اے ذات ورا حمد ہے تیری\n\nسینے میں دھڑکتا ہوا دل تیرا ثنا گو\nبندے کی بصد عجز دعا حمد ہے تیری\n\nباقی بھی تری ذات ہے قیوّم بھی تو ہے\nخوش بخت ہے جس لب پہ سدا حمد ہے تیری\n\nہر شعر تری حمد کا انعام ہے تیرا\nاک حمد کی جاں بخش جزا حمد ہے تیری\n\nشہزادؔ ترے نام کا ذاکر ہے ازل سے\nآئینہ الطاف و عطا حمد ہے تیری"
  },
  {
    "id": 1,
    "title": "حمد باری تعالیٰ",
    "description": "ذات قدیم صاحب ہر فخر و ناز ہے\nستاّر ہے صمد ہے وہی بے نیاز ہے\n\nرہتا ہے مہربان دو عالم پہ ہر گھڑی\nمیرا خدا کریم ہے ، بندہ نواز ہے\n\nجھکتے ہیں اس کے آگے ملک بھی رسول بھی\nسارا اسی کے واسطے عجز و نیاز ہے\n\nنغمہ سرائے حمد ہے بارش کی بوند بوند\nدستِ صبا میں اس کی عقیدت کا ساز ہے\n\nجلوہ گری اسی کی ہے نرگس کی آنکھ میں\nاس کے کرم سے کاکل سنبل دراز ہے\n\nوہ کھولتا ہے گنبد بے در میں کھڑکیاں\nدنیا میں اس کا لطف بلا امتیاز ہے\n\nکرتا ہے روز ایک نئی شان سے ظہور\nیہ اختلاف صبح و مسا اس کا راز ہے\n\nمعبود ہے مجید و معین و مغیث بھی\nمشکل کشا وہی ہے وہی کارساز ہے\n\nایاک نعبد کہیں ایاک نستعین\nمعراج بندگی کا ذریعہ نماز ہے\n\nلرزاں ہیں ارض و کوہ و فلک اس کے سامنے\nاللہ کا کلام بڑا جاں گداز ہے\n\nانوار اسم ذات کی تاثیر کے طفیل\nدل میں ہے کیف روح میں اک اہتزاز ہے\n\nجب موت ہے وسیلۂ دیدار ذات حق\nپھر آدمی کو موت سے کیوں احتراز ہے\n\nرہتے سدا ہیں اس کے خزانوں کے منہ کھلے\nہر لحظہ اس غنی کا در جود باز ہے\n\nپاتا ہے ذاتِ حق سے وہ توفیق نعت کی\nشہزادؔ اس کے فضل سے جو سرفراز ہے"
  },
  {
    "id": 2,
    "title": "حمد باری تعالیٰ",
    "description": "گر آنکھ سو بھی جائے تو کرتا ہے اپنا کام\nدل کو ہے اسم ذات سے کچھ ایسا التزام\n\nتسبیح خواں ہیں اس کے سمک تا سما سبھی\nہر دل میں اس کی یاد ہے ہر لب پہ اس کا نام\n\nقمری کے زمرے میں ہے تمجید کردگار\nکوئل کے لب پہ اس کا ترانہ ہے صبح و شام\n\nمسجودِ خشک و تر ہے وہی ذات لاشریک\nہے بحر و بر میں اس کی عبادت کا اہتمام\n\nدیتا ہوں اس کو آیۂ لا تقنطوا سے مات\nجب بھی مجھے ستائے ہے میرا خیال خام\n\nدر پیش آدمی کو ہے لغزش قدم قدم\nآتا ہے تھامنے کو کرم اس کا گام گام\n\nمبدا ہر ابتدا کا وہی ذات لایزال\nہر انتہا کا اس کی مشیّت پہ اختتام\n\nشہزادؔ جس کا حامی و ناصر ہو خود خدا\nرہتا نہیں وہ شخص زمانے میں بے مرام"
  },
  {
    "id": 3,
    "title": "حمد باری تعالیٰ",
    "description": "خدایا حاکم مطلق ہے تو ہر ایک عالم کا\nجھکا ہے سر تری سرکار میں ہر قیصر و جم کا\n\nگدائے بارگاہِ پاک ہوں ، مارا ہوا غم کا\nبھرم رہ جائے یا رحمن! میرے دیدئہ نم کا\n\nشبِ اسریٰ تری قدرت کے سب نے معجزے دیکھے\nستارہ بن کے ہر ذرہ زمیں کا عرش پر چمکا\n\nزمین و آسماں کا نور ہے تو خالق اکبر!\nتری عظمت کہ تو معبود ہے نورِ مجسم کا\n\nشرف ہر عبد کا ہے بندگی مولائے کل! تیری\nتری حمد و ثنا اعزاز ہے ہر ابن آدم کا\n\nقضا و قدر کی بنیاد ہے تیرے ارادوں پر\nنظام ہست و بود اظہار ہے اک امر محکم کا\n\nکھڑا خیمۂ افلاک حرف ’’کن‘‘ کی قوت سے\nیہ فرش خاک آئینہ ہے تدبیر منظم کا\n\nمدارِ زندگی ہے اک ترے ذکر مسلسل پر\nیہ دنیا چار دن کی ہے ، بھروسا کچھ نہیں دم کا\n\nمجھے شہزادؔ اس کے لطف کی امید رہتی ہے\nکہ میں بندئہ ناچیز اس رحمن و ارحم کا"
  },
  {
    "id": 4,
    "title": "حمد باری تعالیٰ",
    "description": "نفس امّارہ نے جب طوفاں کوئی برپا کیا\nرحمتِ غفاّر نے بڑھ کر اسے سیدھا کیا\n\nمالک کونین ہے وہ خالقِ ہر خشک و تر\nماہ و ماہی کو اسی خلاّق نے پیدا کیا\n\nہر گھڑی آفاق میں ہے لطف و رحمت کا ورود\nاس کے بے پایاں کرم نے خلق کو شیدا کیا\n\nاللہ اللہ پیکر خاکی کو یہ بخشا شرف\nاس نے آدم کو خلیفہ دہر میں اپنا کیا\n\nسورئہ والنجم کی آیات سے ہے یہ عیاں\nعرش پر دیدارِ حق آقا نے بے پردہ کیا\n\nدی شہادت خود خدا نے کہہ کے مازاغ البصر\nآپ بلوا کر نبی کو فائز ’’اَوحٰی‘‘ کیا\n\nرافع ذکرِ نبی ہے خود خدائے ذوالجلال\nمصطفی کے ذکر کو مولا نے خود اونچا کیا\n\nہوگی عالی شان اے شہزادؔ کس درجہ وہ ذات\nاپنے اک بندے کو جس نے خلق کا مولا کیا"
  },
  {
    "id": 5,
    "title": "حمدومناجات",
    "description": "(عربی سے ترجمہ)\nامام محمد بن ادریس الشافعیرحمتہ اللہ علیہ\n\nمرا دل اے مرے مولا ہے عاشق تیری رحمت کا\nوہ روز و شب ہوں یا عالم ہو خلوت اور جلوت کا\n\nجو کچی اور پکی نیند میں پہلو بدلتا ہوں\nتو تیری یاد کو روح و نفس کے بیچ پاتا ہوں\n\nترا عرفان میرے قلب پر احسان ہے تیرا\nکہ اے اللہ تو ہے نعمتوں اور پاکیوں والا\n\nمرے عصیاں اگرچہ سب کے سب تھے علم میں تیرے\nنہ رسوا مجھ کو فرمایا، سبب میرے گناہوں کے\n\nمجھے بھی صالحیں میں کر شمار اور مجھ پہ کر احساں\nنہ مجھ پر ڈال جب ہو امرِ دینی میں کوئی خلجاں\n\nیہاں بھی اور وہاں بھی میرے اوپر مہرباں رہنا\nبروز حشر ’’آیات عبس۱‘‘ میں جو ہے وہ کرنا"
  },
  {
    "id": 6,
    "title": "حمد باری تعالیٰ",
    "description": "صبر ، انکسار، شکر ، صداقت ، کرم ، سخا\nکرتی ہیں یہ صفات ہی بندے کو حق نما\n\nکرتا ہے رزق مسلم و منکر کو وہ عطا\nکس درجہ ساری خلق پہ ہے مہرباں خدا\n\nرہتے ہیں ذوالجلال کے جلووں میں گم سدا\nآئینۂ صفاتِ الٰہی ہیں اولیا\n\nسیراب ہیں لطائف خمسہ کی کھیتیاں\nہے نور بار عالمِ لاہوت کی گھٹا\n\nدربار ذوالجلال میں ہوتی ہے باریاب\nمظلوم کے لبوں سے نکلتی ہے جو دعا\n\nکرتا ہے وہ قدیر ہی ذرّے کو آفتاب\nصرصر کو لمحہ بھر میں بناتا ہے جو صبا\n\nمدّاح اس کے سرو و سمن شاخ و برگ و بار\nتسبیح گو ہیں اس کے سبھی ارض تا سما\n\nمولا کی بارگاہ سے ہوتی نہیں ہے ردّ\nبندہ کرے حضوری دل سے جو التجا\n\nشہزادؔ اس کی حمد کا یارا بھلا کسے\n’’لااُحصی‘‘ جس کی حمد میں کہتے ہیں مصطفی"
  },
  {
    "id": 7,
    "title": "حمد باری تعالیٰ",
    "description": "جو صحنِ جاں میں ہوائے حریم پاک چلے\nرہِ کرم پہ ہمیشہ یہ مشتِ خاک چلے\n\nفرشتے رحمتیں لے کر تری اترتے رہیں\nنوازشات کی یونہی جہاں میں ڈاک چلے\n\nمرے خدا مجھے اپنی پناہ میں رکھنا\nترے جلال کی آندھی جو ہولناک چلے\n\nکریم تیرے کرم کا مجھے سہارا ہے\nیہ نفس جب بھی چلے چال خوفناک چلے\n\nترے جلال کا تھا عکس ان کے لہجے میں\nترے شہید بٹھا کر جہاں پہ دھاک چلے\n\nخدا کی رحمتیں بھی ہم رکاب تھیں شہزادؔ\n’’جو سوئے عرش معلیٰ رسولِ پاک چلے‘‘"
  },
  {
    "id": 8,
    "title": "حمد باری تعالیٰ",
    "description": "وہ صاحب کن ، مالک کل ، خالقِ انوار\nوہ قادر مطلق ہے ہر اک چیز کا مختار\n\nرحمن و رحیم اور ہے سبحان و صمد بھی\nقہار ہے جبار ہے ستار ہے غفار\n\nپروان چڑھاتا ہے وہ دانے کو زمیں میں\nاور اس کو بناتا ہے وہی نخل ثمر بار\n\nتسبیح میں مشغول ہیں اس کی مہ و ماہی\nالحمد کا قائل ہے وہی حمد کا حق دار\n\nہر عکس ہے آئینۂ اوصافِ مصور\nیہ ارض و فلک صنعتِ باری کا ہیں شہکار\n\nخلاّقِ دو عالم کی تجلیّ کا ہیں پر تو\nمچھلی ہو سمندر میں کہ ہو مہرِ ضیا بار\n\nہے معجزئہ حسن ہر اک منظر فطرت\nتفسیر ہیں جنت کی چمن ، چشمہ و کہسار\n\nآباد ہر اک دشت میں حیرت کا جہاں ہے\nاسرار و معارف کا دبستاں ہے چمن زار\n\nاک واسطہ ہے بندہ و معبود کے مابین\nوہ باعث کن منبع و سرچشمۂ انوار\n\nہیں نغمہ گر حمد و ثنا بحر کی موجیں\nاور وجد کے عالم میں گل و غنچہ و اشجار\n\nمعراج ہے شہزادؔ یہی میرے ہنر کی\nہوں واصفِ خلاّق جہاں ، ناعتِ سرکار"
  },
  {
    "id": 9,
    "title": "حمد باری تعالیٰ",
    "description": "وہی لوگ لائق رشک ہیں جو یہ کام خیر سے کر گئے\nوہ جوعازمین حرم ہوئے وہ جو اپنے مولا کے گھر گئے\n\nجو نگاہِ لطف و کرم ہوئی سبھی گرد روح کی چھٹ گئی\nلیا اسمِ ذات عظیم جب تو خمار سارے اتر گئے\n\nدیا لطف خوب صیام نے مجھے یوں نوازا قیام نے\nتہہِ جسم جتنے نقوش تھے اسی روشنی سے نکھر گئے\n\nہے صدا کلام قدیم کی کہ چھڑا ہے نغمۂ دائودی\nاسی سیل نور سے نفس کے سبھی تار و پود بکھر گئے\n\nوہ قسم خدا کی شہید ہیں وہ قریبِ رب مجید ہیں\nجو رہِ وفا پہ چلے سدا جو خدا کے نام پہ مر گئے\n\nہے خدا کا حکم ادب سے آ وہاں سر جھکا کے تو رہ کھڑا\n’’وہ جہاں جہاں بھی ٹھہر گئے وہ جہاں جہاں سے گزر گئے‘‘\n\nجو ہیں جان و دل سے محمدی وہی اولیاء ہیں مجدّدی\nجو خدا کے سامنے جھک گئے جو خدا کے غیض سے ڈر گئے"
  },
  {
    "id": 10,
    "title": "حمد باری تعالیٰ",
    "description": "گئے گزروں کو آخر بندگی کرنے کا ڈھب آیا\n’’گنہگاروں کے ہونٹوں پر درود پاک جب آیا‘‘\n\nحصارِ نورِ اسم ذات جس دل کو ہوا حاصل\nقریب اس دل کے کوئی خطرئہ ابلیس کب آیا\n\nکوئی قرآن کی آیت ہو یا ارشادِ قدسی ہو\nزبان مصطفی سے ہو کے ہی فرمانِ رب آیا\n\nقیامت تک ہے دنیا میں یہی اللہ کی رسی\nلیے قرآن جگ میں اک نرالی تاب و تب آیا\n\nکہیں ’’والنجّم‘‘ کی صورت کہیں ’’والطاّرق‘‘ کہہ کر\nقسم فرمائی اس محبوب کی جو وقت شب آیا\n\nنہ خالی لوٹ کر جائے در الطاف سے تیرے\nترا بندہ ترے در پر الٰہی جاں بلب آیا\n\nسر بزمِ جناں حمد و ثنا کے لے کے نذرانے\nکہا احباب نے وہ دیکھئے شہزادؔ اب آیا"
  },
  {
    "id": 11,
    "title": "حمد باری تعالیٰ",
    "description": "کہاں کے یہ زبان و لب مرا رنگِ ثنا کیا ہے\nیہ حسنِ صوت یہ طرز بیاں ، فکرِ رسا کیا ہے\n\nجمال خالق یکتا کا مظہر ہیں سبھی منظر\n’’یہ کلیاں ، پھول ، غنچے ، رنگ و بو ، موجِ صبا کیا ہے‘‘\n\nزمین و آسماں ، یہ بحر و بر ، مہر و مہ و انجم\nبس ان کو دیکھ لو اور جان لو شانِ خدا کیا ہے\n\nعنایت ہے تری فیضان ہے جود و کرم تیرا\nمرے دامن میں میرا اے مرے ربِّ عُلا کیا ہے؟\n\nخدا کے نام پر جس نے فدا کی زندگی اپنی\nکھلا اس بندئہ حق پر فنا کیا ہے ، بقا کیا ہے\n\nتشکرّ ، انکساری ، عاجزی ، گریہ ، پشیمانی\nنہیں ہے بندگی تو پھر مناجات و دعا کیا ہے\n\nیہ ابھرا مطلعٔ باطن سے کس کے نام کا سورج\nیہ کس کے فیضِ وحدت نے بھلایا ماسوا کیا ہے\n\nیہ میرے حجرئہ قلب حزیں میں کون رہتا ہے\nدلِ شہزادؔ سے جو اٹھ رہی ہے یہ صدا کیا ہے"
  },
  {
    "id": 12,
    "title": "حمد باری تعالیٰ",
    "description": "اک عہد بے مثال ہے اِیَّاکَ نَعْبُدُ\nتمجید ذوالجلال ہے اِیَّاکَ نَعْبُدُ\n\nاِیَّاکَ نَسْتَعِیْن ہے مقصودِ اہل دل\nمنشورِ اہلِ حال ہے اِیَّاکَ نَعْبُدُ\n\nدیباچۂ کتاب الٰہی ہے فاتحہ\nاور مرکزی خیال ہے اِیَّاکَ نَعْبُدُ\n\nوحی الٰہ بھی ہے یہ قولِ ثقیل بھی\nپیغامِ لازوال ہے اِیَّاکَ نَعْبُدُ\n\nاس سے عیاں قرینۂ اظہارِ بندگی\nتکمیلِ حال و قال ہے اِیَّاکَ نَعْبُدُ\n\nمنزل بھی راستہ بھی عقیدہ بھی ذکر بھی\nہر طور نیک فال ہے اِیَّاکَ نَعْبُدُ\n\nتقریب وصلِ عابد و معبود ہے نماز\nکیفیتِ وصال ہے اِیَّاکَ نَعْبُدُ\n\nدنیا و آخرت میں مسلمان کے لیے\nتمہیدِ ہر کمال ہے اِیَّاکَ نَعْبُدُ\n\nپوشیدہ ان حروف میں ہے روح بندگی\nقرآن کا جمال ہے اِیَّاکَ نَعْبُدُ\n\nہے سرمدی سرود یہ فرمان لَمْ یَزِلْ\nبرتر زِ ماہ و سال ہے اِیَّاکَ نَعْبُدُ\n\nجاتا ہے جو صفات سے موصوف کی طرف\nوہ جادئہ وصال ہے اِیَّاکَ نَعْبُدُ\n\nورد زبانِ بوذر و سلمان و مرتضیٰ\nذوقِ دلِ بلال ہے اِیَّاکَ نَعْبُدُ\n\nبندہ ہوا ہے فائزِ معراج بندگی\nکیا خوب اشتغال ہے اِیَّاکَ نَعْبُدُ\n\nنسخہ یہ ہے حصول فیوض و فلاح کا\nسرکوب ہر وبال ہے اِیَّاکَ نَعْبُدُ\n\nدل سے نکالتا ہے غم روزگار کو\nہاں دافعِ ملال ہے اِیَّاکَ نَعْبُدُ\n\nالحمد کے بیاں سے والاالضالین تک\nاک نقطۂ کمال ہے اِیَّاکَ نَعْبُدُ\n\nشہزادؔ کو نصیب ہو مولا وہ بندگی\nجس بندگی پہ دال ہے اِیَّاکَ نَعْبُدُ"
  },
  {
    "id": 13,
    "title": "حمد باری تعالیٰ",
    "description": "قرآن کی زبان میں ہوں محو گفتگو اِیَّاکَ نَعْبُدُ\nگویا ہوئے ہیں عابد و معبود روبرو اِیَّاکَ نَعْبُدُ\n\nحاضر ہوں دست بستہ تری بارگاہ میں لے لے پناہ میں\nآیا ہوں کرکے آج میں اشکوں سے پھر وضو اِیَّاکَ نَعْبُدُ\n\nسب رحم کرنے والوں سے بڑھ کر ہے تو رحیم اے قادرِ کریم\nبھر دے مئے فیوض سے میرا بھی اب سبو اِیَّاکَ نَعْبُدُ\n\nتجھ کو ہے میرے باطنی احوال کی خبر اے خالق بصر\nتجھ پر عیاں خلوص مرا میری جستجو اِیَّاکَ نَعْبُدُ\n\nدرکار پھر ہے روح کو تطہیر کا عمل اے رب لم یزل\nپھر قلب کو عطا ہو وہی ذوق آرزو اِیَّاکَ نَعْبُدُ\n\nدشت و چمن میں تیری ہی قدرت کے رنگ ہیں سب لوگ دنگ ہیں\nجاری ہے ہر گھڑی تری رحمت کی آ بجو اِیَّاکَ نَعْبُدُ\n\nکیسا یہ اسم ذات کے حرفوں میں نور ہے کیف و سرور ہے\nمستی میںجھوم جائے ہے ہر موجۂ لہو اِیَّاکَ نَعْبُدُ\n\nسجدے کو بے قرار تھی شہزادؔ کی جبیں اے اصل ہر حسیں\nجونہی سنا تھا امر ترا اس نے ’’اسجدوا‘‘ اِیَّاکَ نَعْبُدُ"
  },
  {
    "id": 14,
    "title": "حمد باری تعالیٰ",
    "description": "تو خالقِ عظیم ہے اِیَّاکَ نَسْتَعِیْنُ\nتو قادر و کریم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nہم غرق معصیت ہیں مگر اے غفور تو\nہر حال میں رحیم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nتو مبدی و معید ہے قیوّم و ذوالجلال\nسبحان ہے علیم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nفانی ہر ایک چیز ہے اس کائنات کی\nتو باقی و قدیم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nفریاد رس ہے آدم و نوح و خلیل کا\nتو مرجعِ کلیم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nتیرا جمال غنچہ و گل سے ہے ضوفشاں\nتو باری و کلیم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nانعام جن پہ تو نے کیا ان کا راستہ\nبس راہِ مستقیم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nشہزادؔ کو حضور کے صدقے میں ہو نصیب\nجو جنتِ نعیم ہے اِیَّاکَ نَسْتَعِیْنُ"
  },
  {
    "id": 15,
    "title": "حمد باری تعالیٰ",
    "description": "کتاب حکمت و دانش کی ابتدا ادراک\nخدائے لوح و قلم کا کرم عطا ادراک\n\nمیانِ عابد و معبود رابطے کی سبیل\nحصولِ فیضِ الٰہی کا واسطہ ادراک\n\nہنر دیا ہے اسی نے قلم چلانے کا\nاسی کا فضل ہیں علم ، آگہی ، نوا ، ادراک\n\nدل بشر پہ وہ کرتا ہے منکشف اسرار\nہے اس کے لطف و نوازش کا سلسلہ ادراک\n\nشہِ رسل کی حقیقت سے آشنا ہے وہی\nاور اس کی ذات کا رکھتے ہیں مصطفی ادراک\n\nزمین روح پہ برسا کے بارشِ الہام\nمجھے بھی بخش دے اپنا مرے خدا ادراک\n\nفضائے حمد میں شہزادؔ جب بھی سانس لیا\nتجلّیات سے معمور ہو گیا ادراک"
  },
  {
    "id": 16,
    "title": "حمد باری تعالیٰ",
    "description": "صبح دم جب کسی طائر کی صدا آتی ہے\nلب پہ بے ساختہ بس حمد خدا آتی ہے\n\nپھرنے لگتے ہیں مری آنکھ میں میزاب و حطیم\nیاد جب صحن مقدس کی فضا آتی ہے\n\nکوئی فن اور ہنر پاس نہیں ہے میرے\nتیرے محبوب کی بس حمد و ثنا آتی ہے\n\nمشکلیں جب کہیں آتی ہیں سر راہِ حیات\nدستگیری کو وہیں تیری عطا آتی ہے\n\nامت خیر مجسم کو بھی ہو خیر نصیب\nہر گھڑی لب پہ یہی ایک دعا آتی ہے\n\nساتھ لے آتی ہے محراب حرم کی خوشبو\nجب مدینے سے کوئی موج صبا آتی ہے\n\nخواہشِ نفس کا شہزادؔ چھٹے دل سے غبار\nتب کہیں جا کے سمجھ شانِ خدا آتی ہے"
  },
  {
    "id": 17,
    "title": "حمد باری تعالیٰ",
    "description": "بخش مولا مرے دل کو بھی وہی سوز و گداز\nجس خشیت سے مشرف تھے کبھی اہل حجاز\n\nجس کی ہر ضرب میں ہوتا ہے نہاں نغمۂ حق\nاسی مضراب کا طالب ہے مری روح کا ساز\n\nذوق سجدہ بھی عطا ہو مری پیشانی کو\nتیری محراب میں خم ہو یہ مرے بندہ نواز\n\nمانگتا ہوں ترے دربار سے مولا میں بھی\nجو دمکتا ہے جبینوں میں وہی عجز و نیاز\n\nدامن شافع محشر ہے مرے ہاتھوں میں\nمغفرت کو میری کافی ہے یہی ایک جواز\n\nیہ بھی تیری ہی عنایات کا اک پہلو ہے\n’’دل کے پردوں میں مچلتی ہے تمنائے حجاز‘‘\n\nتیری توفیق سے اٹھتے ہیں خودی کے پردے\nتیری تائید سے ہوتے ہیں عیاں ذات کے راز\n\nیہ سمجھنا ہو تو پتوں کی لکیریں دیکھو\nکیسے جاتی ہے حقیقت کی طرف راہِ مجاز\n\nمجھ سے عاصی کو بھی محبوب سے نسبت بخشی\nبس اسی ایک نوازش پہ ہے شہزادؔ کو ناز"
  },
  {
    "id": 18,
    "title": "حمد باری تعالیٰ",
    "description": "دلِ تیرہ کو چمکائوں مجھے توفیق دے مولا\nتجھے میں یاد کر پائوں مجھے توفیق دے مولا\n\nمری سانسیں ترے اسمِ گرامی سے معطر ہوں\nمشامِ جاں کو مہکائوں مجھے توفیق دے مولا\n\nفساد و شر سے میں فرش زمیں کو صاف کر ڈالوں\nہمیشہ امن پھیلائوں مجھے توفیق دے مولا\n\nمرے قول و عمل سے کوئی دل زخمی نہ ہو یا رب\nسراپا خیر بن جائوں مجھے توفیق دے مولا\n\nسلیقہ دے مرے مالک مجھے حسن تکلم کا\nزباں سے پھول برسائوں مجھے توفیق دے مولا\n\nکہوں حق بات میں دربار میں سلطانِ جابر کے\nمیں ہر باطل سے ٹکرائوں مجھے توفیق دے مولا\n\nمرا دشمن بھی میری راہ میں کانٹے بچھائے تو\nمیں اس پر پھول برسائوں مجھے توفیق دے مولا\n\nتعلق مستقل ہو جائے یوں ارضِ مدینہ سے\nترے گھر بار بار آئوں مجھے توفیق دے مولا\n\nتری تائید کا ہر وقت ہو سر پر مرے سایہ\nمیں مشکل میں نہ گھبرائوں مجھے توفیق دے مولا\n\nیہاں بھی لوگ پہچانیں مجھے تیرے حوالے سے\nوہاں بھی تیرا کہلائوں مجھے توفیق دے مولا\n\nتری حمد و ثنا شہزادؔ کے قلب و زباں پر ہو\nمیں تیرے گیت بس گائوں مجھے توفیق دے مولا"
  },
  {
    "id": 19,
    "title": "حمد باری تعالیٰ",
    "description": "ہر وقت رہے دل میں تری یاد الٰہی\nیہ شہر ہمیشہ رہے آباد الٰہی\n\nمغلوب نہ ہو جائوں کہیں نفس کے ہاتھوں\nہر حال میں درکار ہے امداد الٰہی\n\nدل میں ہے ترے دین کی خدمت کی تمنا\nمقصود نہیں مسندِ ارشاد الٰہی\n\nبس لاج سرِ حشر گنہگار کی رکھنا\nہو جائے نہ محنت کہیں برباد الٰہی\n\nمیرے کسی دشمن کو بھی تکلیف نہ پہنچے\nمیرے سبھی احباب رہیں شاد الٰہی\n\nہر شعر سے مطلوب فقط تیری رضا ہو\nمٹ جائے دلوں سے ہوس داد الٰہی\n\nآباء کو مرے بخش دے اے بخشنے والے\nقائم رہے دیں پر مری اولاد الٰہی\n\nہے خوار و زبوں سرورِ کونین کی اُمت\nفریاد ہے فریاد ہے فریاد الٰہی\n\nتو ارض و سمٰوٰت کا خالق ہے خدایا\nیہ دشت و جبل ہیں تری ایجاد الٰہی\n\nتخلیق تو تو نے ہی کئے ہیں یہ عناصر\nوہ آب ہو یا خاک ہو یا باد الٰہی\n\nتو نے ہی بنایا اسے فِیْ اَحْسَنْ تقویم\nانساں تو ہے مجموعۂ اضداد الٰہی\n\nکھاتے ہیں ترا رزق سبھی کافر و مسلم\nتو مالک کل اجودِ اجواد الٰہی\n\nحق تیری عبادت کا ادا ہو نہیں سکتا\nجتنی بھی عبادت کرے شہزادؔ الٰہی"
  },
  {
    "id": 20,
    "title": "حمد باری تعالیٰ",
    "description": "مرا سرمایۂ ہستی تری حمد و ثنا مولا\nتری توفیق سے پایا یہ گنج بے بہا مولا\n\nتو لامحدود میں محدود کیا تعریف ہو مجھ سے\nنہ تیری ابتدا مولا نہ تیری انتہا مولا\n\nدل بے تاب کی تسکیں ہے تیری یاد میں یا رب\nترے تذکار کی لذت ہے کتنی جاں فزا مولا\n\nمیں کیسے مان لوں رسوا کیا جائے گا محشر میں\nترے محبوب کا جو شخص ہو مدحت سرا مولا\n\nجزا کے دن تو اس خوش بخت کو کتنا نوازے گا\nتری خاطر خفا سارے جہاں سے جو رہا مولا\n\nازل سے کر رہے تھے جستجو تیری جہاں والے\nبتایا ہے ترے محبوب نے تیرا پتا مولا\n\nتری توحید پر اہل جہاں ایمان لے آئے\nتری برہان بن کر آ گئے جب مصطفی مولا\n\nتری صنعت کا ہیں شہکار یہ مہر و مہ و انجم\nتری قدرت کے ہیں عکاّس یہ ارض و سما مولا\n\nطواف کعبۂ اقدس کی پھر توفیق دے مجھ کو\nحریم جاں میں بھی اک دلنشیں کعبہ بنا مولا\n\nکرم شہزادؔ پر فرما بھی دے اے قادِر مطلق\nکھڑا ہے ہاتھ پھیلائے ترے در پر گدا مولا"
  },
  {
    "id": 21,
    "title": "حمد باری تعالیٰ",
    "description": "گو جدا ہاتھ سے قلم نہ ہوا\nتیرا اک وصف بھی رقم نہ ہوا\n\nکون سی شب تھی فضل سے خالی\nکون سے دن ترا کرم نہ ہوا\n\nیہ بھی تیری ہی مہربانی ہے\nمیں جو مشغول کیف و کم نہ ہوا\n\nسر وہ کس کام کا بھلا یا رب\nتیری دہلیز پر جو خم نہ ہوا\n\nجب سے بخشی ہے بندگی تو نے\nدل کبھی مائل حشم نہ ہوا\n\nجب سے ’’لَاتَقْنَطُوْ‘‘ کہا تو نے\nکوئی دکھ درد رنج غم نہ ہوا\n\nمیں مدینے میں مر تو سکتا ہوں\nگو وہاں پر مرا جنم نہ ہوا\n\nاس کو بھی اپنا گھر دکھا مولا\nجو کبھی مائل حرم نہ ہوا\n\nگو کہ ہوں لاالٰہ کا قائل\nمجھ سے اک بت بھی منہدم نہ ہوا\n\nاپنی خواہش کا میں پجاری ہوں\nمجھ سے تسخیر یہ صنم نہ ہوا\n\nدرج شہزادؔ جو ہے قرآں میں\nکوئی بھی امر کالعدم نہ ہوا"
  },
  {
    "id": 22,
    "title": "حمد باری تعالیٰ",
    "description": "میٹھی نیند سلاتا ہے تو\nدن کو ہمیں جگاتا ہے تو\n\nچیر کے سینہ ظلمت شب کا\nنیا سویرا لاتا ہے تو\n\nاپنی حمد کے نغمے مولا\nخود ہی ہمیں سناتا ہے تو\n\nاپنا ہر دم آپ تعارف\nبندوں سے کرواتا ہے تو\n\nپھر بھی تو بے رنگ ہے مولا\nگو سب رنگ بناتا ہے تو\n\nاپنی جانب آنے والے\nرستے سب سمجھاتا ہے تو\n\nکس حسن تدبیر سے یا رب\nکائنات چلاتا ہے تو\n\nگلشن گلشن پھول کھلا کر\nروئے ارض سجاتا ہے تو\n\nتو رحمن رحیم خدایا\nمشکل میں کام آتا ہے تو\n\nتو دیتا ہے سب کو روزی\nسب منگتے ہیں داتا ہے تو\n\nتیرے نام کا ورد رکھے جو\nاس کی شان بڑھاتا ہے تو\n\nجل تھل ہو جاتی ہے دھرتی\nبارش جب برساتا ہے تو\n\nہوتی ہے جس وقت ضرورت\nمیرا رزق بڑھاتا ہے تو\n\nپیاس لگے جب صحرائوں کو\nپانی انہیں پلاتا ہے تو\n\nتیرا در میں کیسے چھوڑوں\nمیرے من کو بھاتا ہے تو\n\nتجھ سے ہے ایماں کی حرارت\nجذبوں کو گرماتا ہے تو\n\nکسی کسی کو پاس بلا کر\nاپنا آپ دکھاتا ہے تو\n\nتو ہے ہفت افلاک کا خالق\nسورج شرق سے لاتا ہے تو\n\nہو شہزادؔ پہ فضل الٰہی\nاَرْحَم خود کہلاتا ہے تو"
  },
  {
    "id": 23,
    "title": "حمد باری تعالیٰ",
    "description": "رُوبرو ہے حرم تیری توفیق سے\nدر پہ حاضر ہیں ہم تیری توفیق سے\n\nلائقِ بارگاہِ کرم ہم نہ تھے\nہو گیا ہے کرم تیری توفیق سے\n\nدُھل گئے سب گناہوں کے د فتر یہاں\nہو گئی آنکھ نم تیری توفیق سے\n\nملتزم سے لپٹنے کی تھی آرزو\nرہ گیا ہے بھرم تیری توفیق سے\n\nپاس آئے نہیں دل کو بھائے نہیں\nاہل جاہ و حشم تیری توفیق سے\n\nتیرے دامانِ رحمت سے لپٹے ہیں ہم\nتیرے فضل و کرم تیری توفیق سے\n\nعشق ہے سرزمینِ عرب سے ہمیں\nگو ہیں اہل عجم تیری توفیق سے\n\nمجھ گنہگار کے ناتواں ہاتھ میں\nآج ہے مُلْتَزِمْ تیری توفیق سے\n\nقید خواہش سے تو نے کیا ہے رہا\nٹوٹے دل کے صنم تیری توفیق سے\n\nسب مسافر سفر کی تھکن بھول کر\nہو گئے تازہ دم تیری توفیق سے\n\nبوسۂ سنگ اسود کی تاثیر نے\nسب بھلائے ہیں غم تیری توفیق سے\n\nمیں کھڑا ہوں مقام براہیم پر\nہو کے ملت میں ضم تیری توفیق سے\n\nسعی کرتے ہوئے دل سے جاتا رہا\nخطرئہ بیش و کم تیری توفیق سے\n\nروح گویا حرم کی فضائوں میں ہے\nہے یہ نعمت بہم تیری توفیق سے\n\nآب زمزم کا ساغر لیا ہاتھ میں\nبھول کر جامِ جم تیری توفیق سے\n\nآئے بیٹھے ہیں اہل نظر دید کو\nمیں ہوا محترم تیری توفیق سے\n\nجاں سے جاتی ہے گردِ حرم گھوم کر\nفکرِ بود و عدم تیری توفیق سے\n\nمیں نے قربان خود کو منیٰ میں کیا\nمٹ گئے سب الم تیری توفیق سے\n\nتو نے بخشا ہے شہزادؔ کو یہ ہنر\nچل رہا ہے قلم تیری توفیق سے"
  },
  {
    "id": 24,
    "title": "حمد باری تعالیٰ",
    "description": "سوزِ حفیظؔ دے مجھے ذوق ندیمؔ دے\nفکرِ رسا نواز دے قلبِ سلیم دے\n\nخیرات من لدن کی مجھے اے علیم دے\nحینِ حیات یوں مجھے خلدِ نعیم دے\n\nتو ذائقہ چکھا مجھے اپنی صفات کا\nاپنے کرم سے کچھ تو مجھے بھی کریم دے\n\nمجھ کو بھی شہرِ علم کی خیرات ہو نصیب\nمولا مجھے بھی فہمِ الف لام میم دے\n\nہو جائے لطف خاص ظلوم و جہول پر\nاس بے ہنر کو جوہر نطقِ کلیم دے\n\nرب جہاں سناؔئی و عطارؔ کے طفیل\nجینے کے واسطے کوئی مقصد عظیم دے\n\nہر قلب کو نصیب ہو ذوق دل بلال\nبوذر کا جس میں رنگ ہو ایسی گلیم دے\n\nکس درجہ مہربان ہے انسانیت پہ تو\nجذبہ یہ آدمی کو بھی ربِّ رحیم دے\n\nہم سانس لے رہے ہیں فضائے کثیف میں\nباغ حبیب کی ہمیں مولا شمیم دے\n\nیہ آخری دہائی ہے ماہ صیام کی\nپیغامِ رُستگاریِ نارِ جحیم دے\n\nتیرے نبی کی نعت کے ہمراہ اے جلیل\nلکھتا رہوں میں حمد یہ عزمِ صمیم دے\n\nشہزادؔ کے لیے یہ اثاثہ ہے بے بہا\nحکمت کے مجھ کو لعل و گہر اے حکیم دے"
  },
  {
    "id": 25,
    "title": "حمد باری تعالیٰ",
    "description": "صل علیٰ کا ذکر ہے حمد و ثنا کے بعد\n’’اک مصطفی کا نام ہے نامِ خدا کے بعد‘‘\n\nہو گا نصیب خُلد میں روزِ جزا کے بعد\nملتا ہے جو سرور خدا کی رضا کے بعد\n\nکرتا ہے التفات وہ لطفِ مزید سے\nعرضی جو بھیجتا ہوں نئی ہر دعا کے بعد\n\nسنتا ہے سب کی عرض سمیع و بصیر خود\nگو سیلِ التجا ہے ہر اک التجا کے بعد\n\nجائے گا اس کے پاس جو توبہ کیے بغیر\nہوگا بری عذاب سے لیکن سزا کے بعد\n\nتواب ہے وہ ذات غفور و رحیم ہے\nبخشش کی ہے امید اسی سے خطا کے بعد\n\nکعبہ کے اردگرد فضائے مطاف میں\nرحمت کا سلسلہ تھا کرم کی ہوا کے بعد\n\nوقت اجل بھی حمد کی توفیق ہو مجھے\nمدح نبی ہو لب پہ ثنائے خدا کے بعد\n\nشہزادؔ کر وسیلۂ صدّیق اختیار\nپہلے امام تو ہیں وہی مصطفی کے بعد"
  },
  {
    "id": 26,
    "title": "حمد باری تعالیٰ",
    "description": "خدا گر نہ توفیق دے بندگی کی\nنہیں پھر ضرورت ہمیں زندگی کی\n\nوہ کیا آشنا ہو گا عرفان حق سے\nنہیں جس نے لذت چکھی بے خودی کی\n\nکہا حق نے محبوب ہے بس وہ میرا\nکرے گا اطاعت جو میرے نبی کی\n\nجہاں بھر میں ہے دربدر قوم مسلم\nالٰہی ہیں تصویر ہم بے بسی کی\n\nمیسر ہو اب فتحِ باب ہدایت\nنہیں کوئی حد اپنی بے رہروی کی\n\nخدایا! یہاں خضر و مہدی کئی ہیں\nفزوں تر ہے لیکن روش گمرہی کی\n\nکھلے پھر سے مولا چمن آرزو کا\nچلیں پھر ہوائیں یہاں آشتی کی\n\nسحر دم جو تجھ سے کریں التجائیں\nہوں مقبول یا رب دعائیں سبھی کی\n\nخدا جس کا شہزادؔ ہو آپ ہادی\nنہیں اس کو حاجت کسی رہبری کی"
  },
  {
    "id": 27,
    "title": "حمد باری تعالیٰ",
    "description": "خدایا رحم فرما سیدِّ کونین کا صدقہ\nہماری جھولیاں بھر سیدِّ دارین کا صدقہ\n\nعطا ہو سائلوں کو بارگاہِ پاک سے کچھ تو\nرفیقِ غار یعنی ثانیِ اثنین کا صدقہ\n\nجلالت بخش دے فاروق اعظم کے وسیلے سے\nسخاوت کر عطا عثمانِ ذوالنورین کا صدقہ\n\nعلوم حیدر کرّار سے حصہ ملے ہم کو\nعلی کے نام سے پہلے ہے جو اُس عین کا صدقہ\n\nکروں خدمت میں تیرے دین کی دن رات یا مولا\nیہ ہمت دے رسولُ اللہ کی نعلین کا صدقہ\n\nبفیض سیّدہ زہرا حیا و شرم دے ہم کو\nحمیّت ہو عطا اس قوم کو حسنین کا صدقہ\n\nمرا سینہ بھی نور حکمت و عرفان سے بھر دے\nالٰہی اہل بیتِ مصطفی سبطین کا صدقہ\n\nبچا راہِ صفا کی مشکلوں سے اور خطروں سے\nالٰہی غوثِ اعظم سیّدِ ثقلین کا صدقہ\n\nبفیض نقشبنداں نقشبندیّت پہ رکھ قائم\nمرے ہادی و مرشد اور نور عین کا صدقہ\n\nرہے شہزادؔ کی نسبت سدا شیخ مجدّد سے\nالٰہی مطمئن دل کے سکون و چین کا صدقہ"
  },
  {
    "id": 28,
    "title": "قرآن کی شان",
    "description": "حمدِ رب ہے مصطفی کی شان ہے قرآن میں\nدین کی تعلیم ہے ایمان ہے قرآن میں\n\nاِس کو مولا نے کہا ہے آپ فرقان حمید\nاُس کی یکتائی کی ہر برہان ہے قرآن میں\n\nنور کا منبع ہے یہ، حکمت کا بحرِ بے کنار\nروشنی ہے علم ہے عرفان ہے قرآن میں\n\nتزکیہ و صبر ، تسلیم و رضا کا درس ہے\nاک نظامِ عدل ہے ، احسان ہے قرآن میں\n\nولولہ انگیز ہیں آیات اس منشور کی\nفرد کے ہر درد کا درمان ہے قرآن میں\n\nزندہ کر دیتا ہے یہ اقوامِ مردہ کے ضمیر\nقادر و قیوّم کا فیضان ہے قرآن میں\n\nجس میں پوشیدہ ہیں الہام و فراست کے گہر\nحکمت و اسرار کی وہ کان ہے قرآن میں\n\nاس سے بڑھ کر اور کیا اعزاز ہو انسان کا\nخود مخاطب عبد سے رحمان ہے قرآن میں\n\nہے یہی شہزادؔ رب کی آخری زندہ کتاب\nریب سے خالی ہے جو فرمان ہے قرآن میں"
  },
  {
    "id": 29,
    "title": "شان قرآن",
    "description": "حکمتیں ہیں نور ہے اسرار ہیں قرآن میں\nذاتِ ربِّ عرش کے انوار ہیں قرآن میں\n\nرہنما و محسنِ انسانیت ہے یہ کتاب\nکامیابی کے سبھی اطوار ہیں قرآن میں\n\nزندگی میں بندگی کے رنگ بھر دیتا ہے یہ\nارفع و اعلیٰ سبھی اقدار ہیں قرآن میں\n\nناسخ و منسوخ ہیں کچھ محکم و متشا بھات\nگھاٹیاں کچھ راستے خم دار ہیں قرآن میں\n\nہے پیامِ زندگی یہ مردہ قوموں کے لیے\nروح پرور ، تازہ تر افکار ہیں قرآن میں\n\nدیکھتے ہیں صفحہ در صفحہ انہیں اہل نظر\nجلوہ فرما ہر جگہ سرکار ہیں قرآن میں\n\nمصدر و مہبط ہیں وہ وحی خدا کا اس لیے\nصاحب قرآن کے تذکار ہیں قرآن میں\n\nزمزمہ تسبیح کا ، نغمہ کہیں تہلیل کا\nجانفزا و دلنشیں اذکار ہیں قرآن میں\n\nقل ھواللہ احد ہے اس کی وحدت کا بیاں\nکبریائی کے کئی آثار ہیں قرآن میں\n\nسورئہ رحمان کی آیات میں جلوہ نما\nاس کی قدرت کے حسیں شہکار ہیں قرآن میں\n\nاکبر و اصغر ہو کوئی یا ہو کوئی خشک و تر\nگلشن و صحرا و نور و نار ہیں قرآن میں\n\nماضی و حال اور مستقبل کی ہے اس میں خبر\nجلوہ گر شہزادؔ سب ادوار ہیں قرآن میں"
  },
  {
    "id": 30,
    "title": "شان بیت اللہ کی",
    "description": "یاد آتی ہے مجھے ہر آن بیت اللہ کی\nہے نرالی ہی جہاں میں شان بیت اللہ کی\n\nروح کو سرشار کر دیتا ہے کعبے کا طواف\nبارشِ انوار ہے پہچان بیت اللہ کی\n\nعالم لاہوت تک ہے اس کی ہیبت کا اثر\nکرتے ہیں تکریم عالمیان بیت اللہ کی\n\nمصحفِ لاریب میں تاریخ ہے اس کی رقم\nکہہ رہا ہے داستاں قرآن بیت اللہ کی\n\nابرہہ کو عبدِ مطلب نے دیا تھا یہ جواب\nہے حفاظت کے لیے رحمان بیت اللہ کی\n\nاس کے معماروں میں شامل ہیں براہیم و ذبیح\nکیوں نہ پھر مضبوط ہو بنیان بیت اللہ کی\n\nروشنی تقویٰ کی اس کے دل کو ہوتی ہے نصیب\nکرتا ہے تعظیم جو انسان بیت اللہ کی\n\nحق نے نور مصطفی سے کر دیا روشن اسے\nہو گئی تھی جب فضا ویران بیت اللہ کی\n\nدید کو شہزادؔ کا دل ہو رہا ہے بے قرار\nہو زیارت ربِّ انس و جان! بیت اللہ کی"
  },
  {
    "id": 31,
    "title": "نعت رسول مقبول ا",
    "description": "نعت شریف\nبھلا کیسے ہو ہم سے حق ادا توصیف احمد کا\n\nسبق پڑھتے ہیں اس مکتب میں ہم تاحال ابجد کا\nنظر صدّیق کی حسنِ بیاں ہو امِ معبد کا\n\nتو شاید کچھ بیاں ہو پائے ان کے قامت و قد کا\nجسے حاصل ہوا اک ذرہ بھی عشق محمد کا\n\nوہ مشتِ خاک ہے مصداق بنیان مشیّد کا\nہر اک خوبی جہاں میں معتبر ہے ان کی نسبت سے\n\nانہیں سے فرق ہے تاحشر قائم نیک اور بد کا\nخدائے وحدہٗ نے کر دیا ہے لاشریک ان کو\n\nاسی کو علم ہے ان کے کمال اوج کی حد کا\nخدا کی رحمتیں بڑھ کر مرے لب چوم لیتی ہیں\n\nزباں پہ میری جس دم نام آتا ہے محمد کا\nخدا کے فضل سے مختار ہیں وہ حل و حرمت کے\n\nانہیں کو علم ہے قرآن کے منشا و مقصد کا\nفضیلت کی بنا تقویٰ پہ رکھی ہے شہ دیں نے\n\nکسی پہلو سے کم رتبہ نہیں احمر سے اسود کا\nریاض خلد ہو عرش معلی ہو کہ بیت اللہ\n\nہے بالاتر مقام ان سے مرے آقا کے مرقدکا\nہیں جس کے سائے میں جبریل قمری وار نغمہ گر\n\nنہیں ہے گلشن ہستی میں کوئی سرو اس قد کا\nسنا کوئی حکایت ہم کو بھی چشم فلک اس کی\n\nمدینہ میں ہوا تھا واقعہ جب ان کی آمد کا\nتعارف کے لیے شہزادؔ عمر خضر بھی کم ہے\n\nاگر ہو تذکرہ صرف ان کے اک تملیذِ ارشد "
  },
  {
    "id": 32,
    "title": "نعت شریف",
    "description": "خدا حضور کا قرآں مرے حضور کا ہے\nتمام عالمِ امکاں مرے حضور کا ہے\n\nکرم ہے سرورِ دیں کا ہر ایک امت پر\nہر اک رسول پر احساں مرے حضور کا ہے\n\nنوازشات ہیں عالم پہ ان کی ہر لحظہ\nہر آن فیض فراواں مرے حضور کا ہے\n\nنگاہ رشک سے تکتے ہیں اس کو قدسی بھی\nجو خوش نصیب کہ مہماں مرے حضور کا ہے\n\nکیے ہوئے ہیں گوارا ہمیں جو ارض و سما\nیہ سارا فیض میں قرباں مرے حضور کا ہے\n\nیہ خَلق و اَمر کا سب اہتمام ان کے لیے\nبہشت و عرش کا ساماں مرے حضور کا ہے\n\nنہیں ہے ان کی شریعت میں جبر کا پہلو\nتمام دین ہی آساں مرے حضور کا ہے\n\nسنائی حشر سے پہلے ’’انالھا‘‘ کی نوید\nیہ کس کمال کا فرماں مرے حضور کا ہے\n\nیہ کس کا نام ہے گونجا خدا کے نام کے ساتھ\nمرے حضور کا ہاں ہاں مرے حضور کا ہے\n\nجو درمیان ہے شہزادؔ بیت و منبر کے\nبہشت کا وہ گلستاں مرے حضور کا ہے"
  },
  {
    "id": 33,
    "title": "نعت شریف",
    "description": "مجھ سے پھر عرض مدعا نہ ہوا\nنعت کہنے کا حوصلہ نہ ہوا\n\nجیسے ہیں مصطفی کریم مرے\nایسا تو کوئی دوسرا نہ ہوا\n\nجس کے نقش قدم پہ خضر چلے\nایسا تو کوئی مقتدا نہ ہوا\n\nکوئی خورشید ہو کہ ماہ جبیں\nسامنے آپ کے کھڑا نہ ہوا\n\nجس کو نسبت ہے آپ کے در سے\nوہ مَرا تو مگر فنا نہ ہوا\n\nکیا تعلق خدا کے ساتھ اسے\nصدق دل سے جو آپ کا نہ ہوا\n\nنعت شہزادؔ عرض کی تو مگر\nان کی مدحت کا حق ادا نہ ہوا"
  },
  {
    "id": 34,
    "title": "نعت شریف",
    "description": "ایماں ہے بادباں تو ستارا ہے ان کا نام\nدنیا کے اس بھنور میں کنارا ہے ان کا نام\n\nمعمور کر دیا اسے انوار حمد سے\nخالق نے کیا ہی خوب سنوارا ہے ان کا نام\n\nوہ شخص سب کے دل میں اُترتا چلا گیا\nجس نے بھی اپنے دل میں اتارا ہے ان کا نام\n\nاز فرش تابہ عرش ہے صلِّ علیٰ کی گونج\nوردِ زباں ہمارا تمہارا ہے ان کا نام\n\nایوانِ لا اِلٰہ کا اک معتمد ستون\nشرعِ مبیں کی آنکھ کا تارا ہے ان کا نام\n\nکھولا یہ راز اسم گرامی کی میم نے\nتحمیدِ لم یزل کا اشارا ہے ان کا نام\n\nلوح و قلم کو اسم گرامی سے ہے شرف\nتقدیر کی جبیں کا ستارا ہے ان کا نام\n\nہے اصلِ حمد و حامد و محمود ایک ہی\nکس کس طرح سے حق نے ابھارا ہے ان کا نام\n\nاس نام ہی سے ارض و سما میں ہے روشنی\nلاریب روشنی کا منارا ہے ان کا نام\n\nمومن کا دل حریم مدینہ سے کم نہیں\nمومن کے دل میں انجمن آرا ہے ان کا نام\n\nقرباں کر رہا ہے وہ جاں ان کے نام پر\nجس جس کو اپنی جان سے پیارا ہے ان کا نام\n\nشہزادؔ میرے نطق کی معراج ہو گئی\nمیں نے زباں سے جونہی پکارا ہے ان کا نام"
  },
  {
    "id": 35,
    "title": "نعت شریف",
    "description": "مجھ سے عاصی پہ رحمت کی حد ہو گئی\nنعت محبوب ذاتِ صمد ہو گئی\n\nمل گیا اتباع نبی کا ثمر\nلو مری بندگی مستند ہو گئی\n\nمصطفی کی عنایت سے دل کی کلی\nیوں کھلی کہ گلِ سرسَبدْ ہو گئی\n\nروز محشر شفاعت کا دفتر کھلا\nفردِ عصیاں مری مسترد ہو گئی\n\nہم کہاں کے بھلا لائق خلد تھے\n’’نعتِ محبوب داور سند ہو گئی‘‘\n\nپھر سے ’’تقویمِ احسن‘‘ عطا ہو ہمیں\nزیست آئینہ ’’فِیْ کَبَد‘‘ ہو گئی\n\nجا بجا ان کی شانیں ہیں قرآن میں\nکوئی شد ہو گئی کوئی مدّ ہو گئی\n\nنعت گوئی کی نعمت سے ہوں بہرہ ور\nاب یہ نعمت بھی وجہ حسد ہو گئی\n\nجب سے مدح پیمبر کا خوگر ہوا\nہر عزازیل کو مجھ سے کد ہو گئی\n\nایک لشکر حوادث کا تھا سامنے\nان کی رحمت سے حاصل رسد ہوگئی\n\nمستنیر ان سے صبحِ ازل کی جبیں\nضوفشاں ان سے شامِ ابد ہو گئی\n\nاہل جنت کہیں گے یہ سرکار سے\nآج بے کس نوازی کی حد ہوگئی\n\nایسی توحید سمجھائی سرکار نے\nہر طرف ’’الاحد الاحد‘‘ ہو گئی\n\nتھا جو روشن چراغ رخِ مصطفی\nرشکِ مہتاب کنج لحد ہو گئی\n\nیہ بھی فیضان ہے شافع حشر کا\nخلد مطلوبِ ہر نیک و بد ہو گئی\n\nہم جہنم میں شہزادؔ گرنے کو تھے\nحائل ان کی شفاعت کی سد ہو گئی"
  },
  {
    "id": 36,
    "title": "نعت شریف",
    "description": "بہ ہر نفس شہ دیں پر ہزار بار درود\nخدا کے ذات پیمبر پہ بے شمار درود\n\nعجیب شان سے ہوتا ہے لطف بار درود\nپڑھا کرے جو کبھی کوئی بے قرار درود\n\nدلوں کو پاک یہ کرتا ہے ہر کدورت سے\nمحبتوں کی دکھاتا ہے رہگزار درود\n\nبلندیاں بھی یہ دیتا ہے زیر دستوں کو\nمٹے ہوئوں کو بناتا ہے نام دار درود\n\nیہ بندگی کو سجھاتا ہے نت نئے آہنگ\nرخ عروس عبادت کا ہے نکھار درود\n\nخدا کی رحمتیں اس پر اترتی رہتی ہیں\nجو بھیجتا ہے محمد پہ بار بار درود\n\nدھلے ہوئے ہوں جو کوثر میں وہ صلوٰۃ و ثنا\nڈھلے بہشت میں جو ہوں وہ طرح دار درود\n\nکہو ادب سے حضور آپ پر صلوٰۃ و سلام\nکبھی جو بھیجنا چاہو بہ اختصار درود\n\nصلاۃ بھیجے گا اس پر مرا خدا دس بار\nجو ان کی ذات پہ بھیجے گا ایک بار درود\n\nنماز میں بھی وہ کہتے ہیں ’’السلاّمُ علیک‘‘\nاذاں کے ساتھ بھی پڑھتے ہیں حق شعار درود\n\nچھلک رہا ہے مرے آنسوئوں سے رنگ قبول\n’’مری دُعا کے گلے میں اثر کا ہار درود‘‘\n\nحریم قدس میں پہنچے نہ کیوں مری آواز\n’’مری دعا کے گلے میں اثر کا ہار درود‘‘\n\nعطا ہوا جو مجھے صاحب درود کا قرب\nبروز حشر بنا وجہِ افتخار درود\n\nجو تیری شان کے لائق ہو اے خدائے عظیم\nتو ان پہ بھیج ہمیشہ وہ شان دار درود\n\nبچائے رکھتا ہے شہزادؔ ہر مصیبت سے\nدرود خواں کے لیے ہے حصیں حصار درود"
  },
  {
    "id": 37,
    "title": "نعت شریف",
    "description": "آرزوئے دیدئہ موسیٰ کو یوں پورا کیا\nعرش پر دیدارِ حق آقا نے بے پردہ کیا\n\nدوسرا ان جیسا کوئی پھر نہیں پیدا کیا\nخلق میں خلاّق نے سرکار کو یکتا کیا\n\nعالم بالا سے گزرے جب شہ دیں بے حجاب\nروئے تابان نبی کو عرش بھی دیکھا کیا\n\nکہکشائوں کو ملی حسن کف پا کی زکوٰۃ\nنور کو بھی مستنیر اس نور نے ایسا کیا\n\nکیا تھا گر کچھ اور رہتے ساتھ تا قصرِ دنیٰ\nطائر سدرہ نشیں یہ کیا شب اسریٰ کیا\n\nپیکر آدم میں تھا نور محمد جلوہ گر\nسب فرشتوں نے انہی کے نور کو سجدہ کیا\n\nصاحب ایماں نے جانا ’’ایکم مثلی‘‘ کو حق\nدشمنِ ایماں انہیں خود سا بشر سمجھا کیا\n\nدل کے گلشن میں اتر آئی بہارِ ہشت خلد\nکشت جاں پر آپ کا ابرِ کرم برسا کیا\n\nکس قدر لگتی ہے دلکش حضرت حسّاں کی بات\nآپ سا خوش رو کسی ماں نے نہیں پیدا کیا\n\nآپ کی خلقت کو رکھا رب نے ہر خامی سے پاک\nگویا خالق نے بھی جیسا آپ نے چاہا کیا\n\nآج پھر یاد آئے ہیں اہل جوار ذی سلم\nآج خوب آنسو بہائے اور جی ہلکا کیا\n\nیاد طیبہ سے ملا شہزادؔ کچھ دل کو سکوں\nنعت کے اشعار نے سینہ مرا ٹھنڈا کیا"
  },
  {
    "id": 38,
    "title": "نعت شریف",
    "description": "ملائوں کیا میں کسی سے نظر مدینے میں\nجھکا ہے بار ندامت سے سر مدینے میں\n\nمیں صبح و شام زیارت کو جائوں روضے کی\nالٰہی! کاش ہو میرا بھی گھر مدینے میں\n\nسوائے ’’لا‘‘ کے سبھی کچھ جہاں سے ملتا ہے\nکھلا ہوا ہے کرم کا وہ دَر مدینے میں\n\nمیں دیکھتا تھا مناظر حریم طیبہ کے\nتھی ساتھ ساتھ مری چشمِ تر مدینے میں\n\nجمالِ نورِ مجسمّ کو دیکھنے کے لیے\nاتر کے آ گئے شمس و قمر مدینے میں\n\nبہشت آپ ہے مشتاق جن کے جلوئوں کی\nچھپے ہوئے ہیں وہ لعل و گہر مدینے میں\n\nچمک اٹھے سبھی دیوار و در بقول انس\nجب آئے خیر سے خیرالبشر مدینے میں\n\nجو جارہی ہے گلستانِ خلد کو سیدھی\nے اس کمال کی اک رہ گزر مدینے میں\n\nبفیضِ کیفِ مسلسل کبھی یہ لگتا ہے\nتمام عمر ہوئی ہے بسر مدینے میں\n\nدعائیں ہم نے جو شہزادؔ رب سے مانگی تھیں\nوہ ہو گئی ہیں سبھی بارور مدینے میں"
  },
  {
    "id": 39,
    "title": "نعت شریف",
    "description": "جو ہو صدق طلب سلطان بحر و بر سے ملتا ہے\nسکونِ دل ، قرار جاں نبی کے در سے ملتا ہے\n\nمدینہ میں ہے جلوہ گر مدینہ علم و حکمت کا\nنشانِ جادئہ بخشش اسی رہبر سے ملتا ہے\n\nخدا کی دوستی مشروط ہے ان کی اطاعت سے\nپتا اللہ کا بس مصطفی کے گھر سے ملتا ہے\n\nنوازا ہے خدا نے سب رسولوں کو فضائل سے\nکسی کا مرتبہ بھی میرے پیغمبر سے ملتا ہے؟\n\nشہادت سورئہ احزاب میں ہے اس عقیدے کی\nقرار زندگانی لطفِ پیغمبر سے ملتا ہے\n\nنہیں ہے کام توصیف نبی میں زور بازو کا\nیہ توشہ بس عطائے خالق اکبر سے ملتا ہے\n\nقلم سجدہ کناں رہتا ہے جو محراب مدحت میں\nاسے فیض ثنا جبریل کے شہپر سے ملتا ہے\n\nخذف ریزے ہوئے تسبیح خواں ان کی توجہ سے\nجواب اس ڈھنگ سے سرکار کو کنکر سے ملتا ہے\n\nتصور میں ترے بھی ہم نشیں شاید ہیں وہ گلیاں\nتری آنکھوں کا نقشہ میری چشمِ تر سے ملتا ہے\n\nغم ہستی سے میں شہزادؔ جب بے تاب ہوتا ہوں\nمجھے اک حوصلہ سا گنبدِ اخضرسے ملتا ہے"
  },
  {
    "id": 40,
    "title": "نعت شریف",
    "description": "کیا بتائے بشر آپ کا مرتبہ جانتا ہے خدا ہی مقام آپ کا\nآپ کا عشق ایمان کی جان ہے روح دین متیں احترام آپ کا\n\nآپ خلقت میں لاریب ہیں اولیں آپ بعثت میں ہیں آخر آخریں\nکون جانے بھلا ابتدا آپ کی کون جانے بھلا اختتام آپ کا\n\nمعرکہ ہے صلیب و علم کا بپا اہل اسلام باہم ہوئے بے وفا\nکاش پھر کوئی رومی عجم سے اٹھے کاش پھر آئے کوئی غلام آپ کا\n\nیا نبی اس طرف پھر ہو چشم کرم ساری امت کا رہ جائے آقا! بھرم\nدستِ اغیار میں ہے کلید حرم نرغۂ کفر میں ہے نظام آپ کا\n\nآپ کو انبیاء کی قیادت ملی آپ کو اصفیاء کی سیادت ملی\n’’سارے نبیوں میں اونچا مقام آپ کا سب پہ لازم ہوا احترام آپ کا‘‘\n\nآپ سے نور تھا ظلمتِ دہر میں آپ سے نور ہے ظلمت دہر میں\nکام آیا تھا پہلے بھی نام آپ کا کام دے گا ہمیں اب بھی نام آپ کا\n\nآپ کا ذکر شہزادؔ کی نظم میں آپ کا ذکر شہزادؔ کی نثر میں\nاس عنایت کا ہو شکر کیسے ادا تذکرہ لب پر ہے صبح و شام آپ کا"
  },
  {
    "id": 41,
    "title": "نعت شریف",
    "description": "خیرالوریٰ کہوں انہیں شمس الضّحیٰ کہوں\nصدر العلیٰ کہوں کبھی بدرالدجیٰ کہوں\n\nکچھ کر کے اقتباس کلام مجید سے\nطہٰ کہوں ، نذیر کہوں، مصطفی کہوں\n\nزینت فزائے مسند محمود ہیں حضور\nایوان حشر کا انہیں صدر العلیٰ کہوں\n\nجن کی کرن سے صبح ازل کو ملی ضیاء\nان کو شب الست کا بدرالدجیٰ کہوں\n\nاس درجہ نور باریاں ہوتی ہیں روح میں\nجس درجہ اہتمام سے صلِّ علیٰ کہوں\n\nجی چاہتا ہے پھر ہو ’’بلی ‘‘ کا معاملہ\nپھر سے بلی کے ساتھ میں صل علیٰ کہوں\n\nمیرا درود اور ہے اس کا درود اور\nکیسے بھلا میں خود کو شریکِ خدا کہوں\n\nوہ جن کا ذکر خیر کیا تھا مسیح نے\nاللہ کے خلیل کی ان کو دعا کہوں\n\nآنکھوں میں ہیں مناظرِ فردوس گام گام\nارض حرم کو ساحلِ موج بقا کہوں\n\nشہزادؔ بھیجتا ہے خدا جس پہ خود درود\nاس ذات کو بزرگ میں بعد از خدا کہوں"
  },
  {
    "id": 42,
    "title": "نعت شریف",
    "description": "صحرا میں گل سبز دمکتا نظر آیا\nوہ دیکھئے وہ گنبدِ خضرا نظر آیا\n\nگلزار مدینہ کے ہراک غنچہ و گل میں\nپنہاں مجھے فردوس کا نقشہ نظر آیا\n\nسرکار دو عالم کی عنایت سے عطا سے\nبگڑا ہوا ہر کام سنورتا نظر آیا\n\nانوار سے معمور ہے وہ خاک ابھی تک\nہر ذرّہ سے خورشید ابھرتا نظر آیا\n\nمانند شب قدر ہے طیبہ کی ہر اک شب\nہر صبح کا چہرہ تر و تازہ نظر آیا\n\nکہتے ہیں جسے مسندِ محمود کا وارث\nمحشر میں شفاعت کو وہ تنہا نظر آیا\n\nجب دیکھا جدھر دیکھا دیار شہِ دیں میں\nہر سمت وہی نور سراپا نظر آیا\n\nشہزادؔ مدینہ کے مناظر میں مجھے تو\nعکسِ شہِ کونین جھلکتا نظر آیا"
  },
  {
    "id": 43,
    "title": "نعت شریف",
    "description": "مائل بہ کرم رہتے ہیں سرکار ہمیشہ\nیونہی نہیں آ جاتے گنہگار ہمیشہ\n\nارمان شفاعت لئے سرکار کے درپر\nآتے ہیں شفاعت کے طلب گار ہمیشہ\n\nسرمایۂ آدم ہے تری ذاتِ گرامی\nہیں زیر قدم ثابت و سیّار ہمیشہ\n\nتاحشر ہے اب تیرے لیے مسندِ ارشاد\nلو دیتے رہیں گے ترے افکار ہمیشہ\n\nبخشی ہے ترے رب نے ترے ذکر کو رفعت\nہوتے ہی رہیں گے ترے تذکار ہمیشہ\n\nخلاّقِ دو عالم بھی ترے ساتھ ہے ہر دم\nجبریل بھی ہیں تیرے طرف دار ہمیشہ\n\nہر نقش کفِ پا ہے ترا رہبر کامل\nہیں اہلِ نظر اس کے طلبگار ہمیشہ\n\nقرآن کی تفسیر فرامین ہیں تیرے\nہے تازہ شریعت کا چمن زار ہمیشہ\n\nہروصف ترا مظہر اخلاق الٰہی\nہر حرف ترا زندہ و ضوبار ہمیشہ\n\nمحبوب ہے تو باقی وحیِّ ابدی کا\nتابندہ رہیں گے ترے انوار ہمیشہ\n\nہر دور میں مقبول و مسلمّ رہی آقا\nدنیا میں تری خوبیِ کردار ہمیشہ\n\nپھٹکے نہ کبھی پاس مرے گردشِ دوراں\nمیں نعت کہوں اے شہ ابرار ہمیشہ\n\nرکھا ہے قدم تو نے جہاں فرشِ زمیں پر\nدیکھا ہے وہاں نور کا مینار ہمیشہ\n\nہے جس میں جڑا ختم نبوّت کا نگینہ\nسر پر ہے فضیلت کی وہ دستار ہمیشہ\n\nوالشمس ہے اے شمس ترا روئے فروزاں\nوالفجر ترے حسن کا اظہار ہمیشہ\n\nسرکار نے جو صبح و مسا خود بھی پڑھے ہیں\nرکھ وردِ زباں بس وہی اذکار ہمیشہ\n\nدیتا رہے خوشبو جو ترا اسم گرامی\nمہکا رہے شہزادؔ کا گھر بار ہمیشہ"
  },
  {
    "id": 44,
    "title": "نعت شریف",
    "description": "کب تک رہیں گے ایسے سنین و شہور اور\nتابِ فراق مجھ کو نہیں ہے حضور اور\n\nفرمائیے حضور! حضوری کی کچھ سبیل\nدیتا نہیں ہے ساتھ دلِ ناصبور اور\n\nآیا ہی چاہتا ہے حضوری کا اذن بھی\nرہ لے ریاضِ خلد سے کچھ روز دور اور\n\nہوں گے حضور تخت شفاعت پہ جلوہ گر\nمنظر ہمیں دکھائے گا یوم النشور اور\n\nتاباں ضیائے نعت سے رہتا ہے میرا دل\nاے ابرِ نور بار مجھے بخش نور اور\n\nحمد خدا نے روح کو دی تازگی نئی\nنعتِ نبی سے دل کو ملا اک سرور اور\n\nعہد رواں حضور ہے محتاج التفات\nدرکار ہے بشر کو ابھی کچھ شعور اور\n\nآتا ہے جب خیال کف پائے مصطفی\nشہزادؔ صحنِ جاں میں اترتا ہے نور اور"
  },
  {
    "id": 45,
    "title": "نعت شریف",
    "description": "اک عالم سرور میں باچشم تر ملے\nروضے کے سامنے جو کھڑے دیدہ ور ملے\n\nممکن نہیں کہ پھر وہ کبھی در بدر ملے\nباب السلاّم پر جو کھڑا بخت ور ملے\n\nمعبود مصطفی کا کرے شکر صبح و شام\nتوصیفِ مصطفی کا جسے کچھ ہنر ملے\n\nاکثر درِ نبی پہ بصد عجز و انکسار\nدستِ طلب دراز کیے تاجور ملے\n\nکاستہ بدست آپ کی چوکھٹ پہ ہوں کھڑا\nخیرات اب مجھے بھی مرے چارہ گر ملے\n\nانوارِ مصطفی سے ہوئے بہرہ یاب سب\nجتنے رُسل حضور سے افلاک پر مِلے\n\nمحشر میں انبیاء بھی پکاریں گے دیکھنا\n’’بندہ نواز صدقۂ لطفِ نظر ملے‘‘\n\nچلتا نہیں وہ جادئہ اہل فرنگ پر\nسلطانِ انبیاء کی جسے رہگزر ملے\n\nشہزادؔ زندگی میں مجھے خُلد ہو نصیب\nسرکار کی گلی میں اگر مجھ کو گھر ملے"
  },
  {
    "id": 46,
    "title": "نعت شریف",
    "description": "ختم الرسل ہیں سارے زمانوں کے مقتدا\nخوش بخت ہیں جو آپ کی کرتے ہیں اقتدا\n\nصلِّ علیٰ کا ورد ہے ہر درد کی دوا\nمدح و ثنائے رحمتِ عالم میں ہے شفا\n\nبندے ہیں ہم وہ خواجۂ کل خواجگان ہیں\nہیں سب کے آپ مُرشد و ہادی و رہنما\n\nخلاّقِ ہر جہان کا شہکار ہیں حضور\nآئینہ جمالِ الٰہی ہیں مصطفی\n\nاحوال وہ بیان ہوں لفظوں میں کس طرح\nحاضر درِ حضور پہ ہوتے ہیں جب گدا\n\nمیں ان کا مدح خواں ہوں نکیرین بس کرو\nرکھتا ہوں مصطفی سے محبت میں باخدا\n\nبے حد گراں تھا داورِ محشر کا سامنا\nآقا نے مجھ کو دامنِ رحمت میں لے لیا\n\nشہزادؔ تو نے حمد کے اشعار تو کہے\nاب اس زمین میں ہی نئی نعت اِک سنا"
  },
  {
    "id": 47,
    "title": "نعت شریف",
    "description": "لیے دلوں میں تمنائے ارض پاک چلے\nحرم کی سمت مسافر بصد تپاک چلے\n\nبذوق و شوق و حضوری و انہماک چلے\n’’جو سوئے عرش معلیٰ رسول پاک چلے‘‘\n\nحروف نعت کا ممنون میں رہوں گا سدا\nجو قلب و روح کو فرما کے تابناک چلے\n\nجہاں کی خاک سے ہو کہکشاں بھی شرمندہ\nوہاں پر مہر و نجوم و قمر کی خاک چلے\n\nکمال شوق سے آئے تھے جو سلامی کو\nدر نبی سے پلٹ کر وہ سینہ چاک چلے\n\nشفیع حشر کے جلوئوں کو دیکھنے کے لیے\nمسافرانِ لحد ہو کے گھر سے پاک چلے\n\nعجیب شان سے شہزادؔ ان کے در کے گدا\nبٹھا کے سارے زمانے پہ اپنی دھاک چلے"
  },
  {
    "id": 48,
    "title": "نعت شریف",
    "description": "وہی لمحے حاصل زندگی ہیں جو اُن کے در پہ گزر گئے\nمرے ریگ زارِ وجود کو گل و یاسمیں سے جو بھر گئے\n\nمیں چلا جو اسوئہ پاک پر مرے مصطفی ہوئے راہبر\nمجھے بندگی کی سند ملی مرے سارے کام سنور گئے\n\nیہ کمال ہے شہ دین کا دیا درس صدق و یقین کا\nجو اٹے تھے کفر کی دھند سے وہ نقوش سارے نکھر گئے\n\nیہ جو نور ہے شب قدر کا یہ ہے فیض سیِّد بدر کا\nاسے طاق رات میں ڈھونڈنے کا حضور حکم ہیں کر گئے\n\nملے بندگی کے وہیں نشاں بنی سجدہ گاہ وہاں وہاں\n’’وہ جہاں جہاں بھی ٹھہر گئے وہ جہاں جہاں سے گزر گئے‘‘\n\nہیں قسیم رحمتِ رب وہی سبھی رحمتوں کا سبب وہی\nشہ دوسرا ہی کے جود سے جوتہی تھے ظرف وہ بھر گئے\n\nبخدا وہ اہل نصیب ہیں شہ انس و جاں کے قریب ہیں\nوہ جو اتباع رسول میں غم دو جہاں سے گزر گئے"
  },
  {
    "id": 49,
    "title": "نعت شریف",
    "description": "جہاں کو کفر کی ظلمت سے کرنے پاک جب آیا\nعجب منظر تھا دنیا میں شہِ لولاک جب آیا\n\nنوازا اس کو بھی پیراہنِ الطاف و رحمت سے\nدر سرکار پر کوئی گریباں چاک جب آیا\n\nچلی بادِ بہاری کھل گئے جنت کے دروازے\n’’گنہگاروں کے ہونٹوں پر درودِ پاک جب آیا‘‘\n\nاسے سرشار کر ڈالا مسلسل جُود و بخشش سے\nکوئی عاصی بھی لے کر دیدئہ نمناک جب آیا\n\nصدائے ’’مارَمَیْتَ اِذْ رَمَیْتَ‘‘ گونج کر آئی\nحبیب حق لیے ہاتھوں میں مشت خاک جب آیا\n\nربیعہ اسلمی کو آپ نے جنت عطا کر دی\nلیے بہرِ وضو وہ کوزہ و مسواک جب آیا\n\nبہار جاودانی آ گئی گلزار عالم میں\nزبانِ خلق پر اسمِ شہِ لولاک جب آیا\n\nپگھل کر ہو گیا دل موم آنکھیں چار ہوتے ہی\nچلا بزم رسالت میں کوئی سفاک جب آیا\n\nخدا نے لے لیا بدبخت کو اپنی حراست میں\nشہِ کونین کی حد میں کوئی بے باک جب آیا\n\nفرشتوں کی زباں پر زمزمے مدح و ثنا کے تھے\nخداکا آخری مرسل سرِ افلاک جب آیا\n\nہمیں ثابت قدم شہزادؔ رکھا ان کی نسبت نے\nکوئی مغرب زدہ ہم پر بٹھانے دھاک جب آیا"
  },
  {
    "id": 50,
    "title": "نعت شریف",
    "description": "نگاہ زائرِ طیبہ میں گنبد، سبز سر چمکا\nسرِ شاخِ نہالِ دل عقیدت کا ثمر چمکا\n\nمظاہر تھے کمالات شہ کونین کے سارے\nدم عیسیٰ ہوا ظاہر ، ید بیضا اگر چمکا\n\nجدا کر کے دکھایا آپ نے حق اور باطل کو\nہر اک فرمان تابندہ میانِ خیر و شر چمکا\n\nنرالی شان سے ان کے کفِ پا نے ضیا بخشی\nبہر پہلو ابو ایوب انصاری کا گھر چمکا\n\nمری جانب نگاہ التفات آقا نے فرمائی\nستارہ میری قسمت کا سرِ مژگانِ تر چمکا\n\nچمک اٹھے تصور میں حروف اسم محمد کے\nپھر ان کے نور کی برسات سے دل کا نگر چمکا\n\nشب معراج نے اک معجزہ یوں بھی دکھایا ہے\n’’ستارہ بن کے ہر ذرّہ زمیں کا عرش پر چمکا‘‘\n\nحریم ذات میں صلِّ علیٰ کی روشنی پھیلی\nمرے دل میں دیا یادِ نبی کا رات بھر چمکا\n\nنہ چمکا ہے نہ چمکے گا کوئی شہزادؔ اس دھج سے\nجہاں میں آمنہ کا جس طرح نورِ نظر چمکا"
  },
  {
    "id": 51,
    "title": "نعت شریف",
    "description": "ادھر اسم گرامی لب پہ ہے فخرِ دو عالم کا\nادھر افلاک پر ہے زمزمہ صلِّ وسلم کا\n\nمجھ ایسے کو بھی ٹھہرایا ہے مورد لطفِ پیہم کا\nبھرم رکھا شہِ خوباں نے میرے دیدئہ نم کا\n\nشفا بخشی ، دیا ہے کام زخم دل کو مرہم کا\nعجب اعجاز ہے صلِّ علیٰ ذکر معظم کا\n\nاثر ہے کل جہاں میں اسوئہ نور مجسم کا\nہے شہرہ چار سو سرکار کے خلقِ مکرّم کا\n\nیہ اک انداز تھا خیرالوریٰ کے خیر مقدم کا\nزمینِ شور سے جاری ہوا چشمہ جو زمزم کا\n\nسعادت دیکھئے میری میں ان کا نام لیوا ہوں\nپھریرا عرش پر لہرا رہا ہے جن کے پرچم کا\n\nخدا کی بارگاہ خاص تک ان کی رسائی ہے\nوسیلہ ہیں وہی موسیٰ و عیسیٰ اور آدم کا\n\nقیامت تک وہی ہیں پیشوا و رہنما سب کے\nلقب بخشا خدا نے آپ کو نور مجسم کا\n\nخدا کی دوستی مشروط ہے ان کی اطاعت سے\nوہ بندہ کیا ہے جو تابع نہیں فرمانِ محکم کا\n\nیہ اک اعزاز ہے شہزادؔ بھاری سب فضائل پر\nکہ میں ہوں امتی اللہ کے محبوب اعظم کا"
  },
  {
    "id": 52,
    "title": "نعت شریف",
    "description": "رسائی بارگاہِ پاک میں جس دم ہوئی اپنی\nمقدر اوج پر تھا کیفیت تھی دیدنی اپنی\n\nحضور خواجۂ طیبہ ہوئی پھر حاضری اپنی\nخدا کے فضل سے کچھ رنگ لائی بندگی اپنی\n\nدل و روح و بدن تھے سامنے سرکار کے حاضر\nحقیقت اس گھڑی مجھ پر حقیقت میں کھلی اپنی\n\nیہ ان کے التفات بے کراں کا اک بہانہ ہے\nعزیز از جان مجھ کو اس لیے ہے بے کسی اپنی\n\nفضیلت آپ کی بعداز خدا سب پر مسلّم ہے\nجتائی ہی نہیں لیکن کسی پر برتری اپنی\n\nگرایا اس نے جب مجھ کو شہِ والا کی چوکھٹ پر\nفقط اس دن مجھے اچھی لگی یہ بے خودی اپنی\n\nچھٹی ظلمت اجالا ہو گیا سارے زمانے میں\nعرب کے چاند نے پھیلائی جس دم روشنی اپنی\n\nکمائی ہے یہی شہزادؔ عمر چند روزہ کی\nکٹی ہے مدحِ محبوب خدا میں زندگی اپنی"
  },
  {
    "id": 53,
    "title": "نعت شریف",
    "description": "رسول پاک سے سن عظمتِ حمد خدا کیا ہے\nخدا سے پوچھ شان و شوکت صلِّ علیٰ کیا ہے\n\nدیا پیغام یہ بدر و احد کے جاں نثاروں نے\nکسی کو کیا خبر قدر محمد مصطفی کیا ہے\n\nجناب سرور دیں کے تبسم کا تسلسل ہیں\n’’یہ کلیاں، پھول، غنچے، رنگ و بو موج صبا کیا ہے‘‘\n\nپناہِ عاصیاں ہے ان کا دامانِ شفاعت بھی\nبروزِ حشر یہ کھل جائے گا لطف و عطا کیا ہے\n\nیہ ان کی رحمۃ للعالمینی ہی کے جلوے ہیں\nجو پوچھو عاصیوں پر یہ کرم کا سلسلہ کیا ہے\n\nدرود خالق اکبر ہے مدّاحی محمد کی\nثنائے مصطفی کر بندئہ حق سوچتا کیا ہے\n\nمیں ان کے ذکر سے شہزادؔ اپنا قد بڑھاتا ہوں\nمری اوقات کیا ورنہ ، مرا حرفِ ثنا کیا ہے"
  },
  {
    "id": 54,
    "title": "نعت شریف",
    "description": "اس محبوب کا صدقہ میری مان ہوا\nتجھ پر نافذ ہے جس کا فرمان ہوا\n\nطیبہ میں اک نعت ہدیّہ لیتی جا\nکر دے مجھ پر اتنا تو احسان ہوا\n\nتو نے حرا میں وہ منظر بھی دیکھا تھا\nاترا تھا قرآن پہ جب قرآن ہوا\n\nکر معمور دل و جاں کو اس خوشبو سے\nلا طیبہ سے کچھ عطر و لوبان ہوا\n\nتو جالی کے اس جانب بھی جاتی ہے\nجس جانب ہے مولا کی برہان ہوا\n\nمیرے بھی ممدوح وہی ہیں تیرے بھی\nاور وہی ہیں ممدوح رحمن ہوا\n\nتو نے تو سرکار کے لب بھی چومے ہیں\nمیں تیری خوش بختی پر قربان ہوا\n\nساتھ رہی ہے اسریٰ و معراج میں تو\nپائے ہیں کیا کیا روح و ریحان ہوا\n\nتو گوش سرکار تلک پہنچاتی تھی\nنعت پڑھا کرتے تھے جب حسان ہوا\n\nتو محظوظ ہوئی ہے ان کی سانسوں سے\nرب نے تجھ کو بخشی کیسی شان ہوا\n\nتو بھی شامل تھی سرکار کی طینت میں\nتجھ پہ فدا ہو جائے میری جان ہوا\n\nمیں بھی تیرے ساتھ مدینے جا پہنچوں\nہے کوئی ہم راہی کا امکان ہوا\n\nآتی ہے شہزادؔ ریاض الجنّت سے\nتازہ تر کرنے میرا ایمان ہوا"
  },
  {
    "id": 55,
    "title": "نعت شریف",
    "description": "خود سنور جائیں گے حالات مدینے چلئے\nآپ بن جائے گی ہر بات مدینے چلئے\n\nرشکِ صد خلد ہے گلزار حریمِ طیبہ\nہیں وہاں نور کے باغات مدینے چلئے\n\nبارشِ نور برستی ہے گلی کوچوں میں\nدن کے جیسی ہے وہاں رات مدینے چلئے\n\nچھوڑئیے چھوڑئیے دنیا کے یہ جھنجٹ سارے\nآئیے آئیے حضرات مدینے چلئے\n\nدل میں رکھیے نہ کوئی زادِ سفر کا کھٹکا\nاک سے اک ہے وہاں سوغات مدینے چلئے\n\nحاصل عمر ہیں گھڑیاں جو وہاں پر گزریں\nقیمتی ہیں وہی لمحات مدینے چلئے\n\nقدسیوں کا وہاں رہتا ہے ہمیشہ مجمع\nہیں ہمہ رنگ فیوضات مدینے چلئے\n\nقاسم نعمتِ باری ہیں کرم پر مائل\nبٹ رہی ہے وہاں خیرات مدینے چلئے\n\nان کے دربار سے جاتا نہیں منگتا خالی\nہے رواں بحرِ عنایات مدینے چلئے\n\nراہِ طیبہ میں ہیں جتنے بھی دیار و امصار\nہیں وہ جنت کے مضافات مدینے چلئے\n\nجن کے سینے میں ہے تاریخِ رسالت پنہاں\nدیکھنے ہوں جو کمالات مدینے چلئے\n\nالجھنیں حل درِ سرکار پہ جا کر ہوں گی\nگر بدلنے ہیں خیالات مدینے چلئے\n\nصبح کی سانس معطر ہے مہک سے ان کی\nشام پر بھی ہیں عنایات مدینے چلئے\n\nکھینچتا ہے دل مومن کو اُحد کا منظر\nیاد آ جاتے ہیں غزوات مدینے چلئے\n\nجابجا ہیں وہاں آثار و مظاہر ان کے\nہر قدم پر ہیں کرامات مدینے چلئے\n\nکہہ رہی ہیں وہ ہوائیں بھی انہی کے قصے\nسن ہی لیجے وہ حکایات مدینے چلئے\n\nخواہشیں دہر کی چھوڑیں گی نہ دامن ہرگز\nتوڑیے اب یہ روایات مدینے چلئے\n\nپائوں شہزادؔ طبیعت پہ میں کیسے قابو\nہے تقاضا یہی دن رات مدینے چلئے"
  },
  {
    "id": 56,
    "title": "نعت شریف",
    "description": "محبوب ربِّ عرش ہے ، میر حجاز ہے\nنسبت سے جس کی نوعِ بشر سرفراز ہے\n\nعقدہ کھلا یہ رحمت عالم کو دیکھ کر\nفضل خدا کا سلسلہ کتنا دراز ہے\n\nیونہی نہیں رحیم کہا خود کریم نے\nمیرا نبی کریم ہے بندہ نواز ہے\n\n’’تِلکَ الرُّسُل‘‘ سے اور بھی کچھ ہو گیا عیاں\nپیغمبروں میں آپ کا جو امتیاز ہے\n\nجو کچھ ورائے عقل ہے قرآن پاک میں\nمابین مصطفی و خدا ایک راز ہے\n\nامت پہ چل گیا ہے عزازیل کا فسوں\nآقا یہ قوم در پئے تحریص و آز ہے\n\nاسریٰ کی شب گیا تھا جو تا رفعت دنیٰ\nبس ایک لامکاں کا وہی شاہباز ہے\n\nلہجے کو ان کے نام نے بخشی ہے اک مٹھاس\nدل میں انہی کے ذکر سے سوز و گداز ہے\n\nمعبود نے اسی کو فقط ’’عبدہ‘‘ کہا\nجس پر سلام بھیجنا روح نماز ہے\n\nشہزادؔ بس یہی ہے تعارف مرا کہ میں\nبندہ ہوں ان کی نسبتِ عالی پہ ناز ہے"
  },
  {
    "id": 57,
    "title": "نعت شریف",
    "description": "ہو کیسے حق ادا پھر ہم سے ان کی نعت و مدحت کا\nاَلم نشرح ہے سر آغاز جن کی شانِ رفعت کا\n\nنہیں کوئی کنارا رحمتِ آقا کی وسعت کا\nپھریرا عرش پر لہرا رہا ہے ان کی عظمت کا\n\nاِدھر بھی سرور دیں کوئی چھینٹا ابر رحمت کا\nکہ ابتر ہو رہا ہے حال اب تو ساری امت کا\n\nکھلا توحید کا روشن دریچہ شرک خانے میں\nیہ ایک اعجاز ہی تھا سرورِ عالم کی دعوت کا\n\nرسول ہاشمی کے امتی انمول ہوتے ہیں\nکسی کو کیا پتا ان موتیوں کی قدر و قیمت کا\n\nسوائے کوچۂ سرکار کے بک جائیں ناممکن\nاگر اندازہ ہو جائے ہمیں خود اپنی قیمت کا\n\nکہا اللہ نے قرآں میں ختم المرسلیں ان کو\n’’عقیدہ اس لیے رکھتے ہیں ہم ختم نبوت کا‘‘\n\nشہ کونین نے فرما دیا ہے ’’لانبی بعدی‘‘\n’’عقیدہ اس لیے رکھتے ہیں ہم ختم نبوت کا‘‘\n\nکسی کذاب کو جرأت نہ ہو پھر ایسے دعوے کی\n’’عقیدہ اس لیے رکھتے ہیں ہم ختم نبوت کا‘‘\n\nکسی کاذب سے کوئی معجزہ مانگے تو کافر ہے\nیہ فتویٰ ہے بہت مشہور سلطانِ فقاہت کا\n\nنیا کوئی نبی شہزادؔ ہو اب غیرممکن ہے\nرسولِ آخریں پر ختم ہے منصب رسالت کا"
  },
  {
    "id": 58,
    "title": "نعت شریف",
    "description": "سرور کون و مکاں سیّد ذیشان عرب\nباعثِ ارض و سما روحِ عجم جانِ عرب\n\nرونق بزمِ جہاں شمع شبستانِ عرب\nثانی باغ جناں حسنِ گلستانِ عرب\n\nگلشنِ روح پہ چھا جاتی ہے شادابی سی\nیاد آ جاتے ہیں جس دم گل و ریحانِ عرب\n\nتابع حکم شہِ دیں ہیں عجم کے دفتر\nدستِ محبوب خدا میں ہے قلمدانِ عرب\n\nذرّے ذرّے میں چمکتے ہیں یہاں ماہ و نجوم\nجادئہ عرشِ معلیٰ ہے خیابانِ عرب\n\nجب کھلا باب عنایات نبوت اس میں\nآسماں گیر ہوئی وسعتِ دامانِ عرب\n\nسنتِ سرورِ دیں صاحب ایماں کا وقار\nیعنی دستار کہ ہے زینتِ مردانِ عرب\n\nحامل وحی خداوند فرشتوں کا امام\n’’طائر سدرہ نشیں مرغِ سلیمانِ عرب‘‘\n\nبست و دو سال زیارت کو مسلسل آیا\n’’طائرِ سدرہ نشیں مرغ سلیمانِ عرب‘‘\n\nمجھ کو شہزادؔ کمک روحِ رضا سے پہنچی\nورنہ ہوتی نہ رقم مدحتِ سلطانِ عرب"
  },
  {
    "id": 59,
    "title": "نعت شریف",
    "description": "خلوص ، امن ، اخوت ، حیا وفا ادراک\nجہاں میں بانٹنے آئے تھے مصطفی ادراک\n\nضیائے سیرت انور سے ضوفشاں ہے حیات\nنقوش پائے نبی سے ہمیں ملا ادراک\n\nگزر گئے ہیں جہاں سے بھی تاج دار شعور\nبکھر گیا اسی رستے پہ جا بجا ادراک\n\nبلال و بوذر و سلمان بنتے جاتے ہیں\nدرِ حبیب سے ہوتا ہے جب عطا ادراک\n\nجبیں تمدّن و تہذیب کی چمکنے لگی\nعجیب شان سے جلوہ نما ہوا ادراک\n\nجو زیب چشم بصیرت ہو خاک راہ حجاز\nتو قلب و ذہن میں ہوتا ہے رونما ادراک\n\nترے حبیب کی مدحت کا حق ادا ہو پائے\nمجھے نصیب ہو اتنا تو اے خدا ادراک\n\nمرے نبی کا طریقہ ہے علم کی تقسیم\nمرے حضور کی سنت ہے بانٹنا ادراک\n\nاگر نصیب ہو دریائے مِنْ لَّدُنْ کی نمی\nخدا کے فضل سے ہوتا نہیں فنا ادراک\n\nمرے کفیل و مربی ہیں مصطفی شہزادؔ\nمجھے یقین ہے ہوگا فزوں مرا ادراک"
  },
  {
    "id": 60,
    "title": "نعت شریف",
    "description": "باران کرم مجھ پہ بھی برسائے مدینہ\nاے کاش مرے دل میں سما جائے مدینہ\n\nہے نقش مرے دل پہ ہر اک منظر طیبہ\nپھرتے ہیں میری آنکھ میں گلہائے مدینہ\n\nسب رنج بھلا دیتی ہے آغوش احد کی\nہے راحت جاں کوہِ دلآرائے مدینہ\n\nپنہاں ہیں تری خاک میں ایمان کے موتی\nتو رُوکشِ فردوس ہے صحرائے مدینہ\n\nبخشش کی سند ہے در سرکار سے نسبت\nجنت کی ضمانت ہے تولائے مدینہ\n\nکب دیکھئے ہم پر ہو عنایت کی نظر پھر\n’’کب دیکھئے بر آئے تمنائے مدینہ‘‘\n\nہر شخص میں انصار مدینہ کی جھلک ہے\nاک عالم ایثار ہے دنیائے مدینہ\n\nجو لطف کہ شہزادؔ شہیدیؔ پہ ہوا تھا\nوہ لطف کبھی مجھ پہ بھی فرمائے مدینہ"
  },
  {
    "id": 61,
    "title": "نعت شریف",
    "description": "یاد جب خلوتِ خورشیدِ حرا آتی ہے\nگوشۂ قلب سے اقراء کی صدا آتی ہے\n\nمسجد نعت میں جب سجدہ کناں ہونا ہو\nکام اس وقت مرے فکرِ رسا آتی ہے\n\nروح کا رزق اترتا ہے فلک سے جب بھی\nمیرے حصے میں شہِ دیں کی ثنا آتی ہے\n\nیاس کو پاس پھٹکنے نہیں دینا ہر گز\nدل کی بستی مرے آقا کو بسا آتی ہے\n\nروح کے دشت کو گلزار بنانے کے لیے\nصبح دم جنت طیبہ سے ہوا آتی ہے\n\nنسبت سرور کونین پہ ہے فخر مگر\nاپنے اعمال کو دیکھوں تو حیا آتی ہے\n\nگلشن جاں میں مہکتے ہیں درودوں کے گلاب\n’’جب مدینے سے کوئی موجِ صبا آتی ہے‘‘\n\nکعبۃ اللہ کے شہزادؔ ہر اک گوشے سے\n’’وَرَفَعْنَا لَکَ ذِکْرَکْ‘‘ کی صدا آتی ہے"
  },
  {
    "id": 62,
    "title": "نعت شریف",
    "description": "کوئی خوش بخت مرے شہر سے جب جائے حجاز\nیاد رہ رہ کے مجھے آئے ہے صحرائے حجاز\n\nاک تعلق ہے اسے فخر بنی ہاشم سے\nناز کیوں کر نہ کرے بخت پہ لیلائے حجاز\n\nایسا انفاس شہِ دیں نے نوازا ہے اسے\nرشکِ صد طور ہوئی وادی سینائے حجاز\n\nحظ اٹھا پائے گا وہ کوثر و تسنیم سے کیا\nچکھ نہ پایا جو یہاں بادئہ مینائے حجاز\n\nسجدہ کرتے ہیں وہاں جا کے مقدّر والے\nبخت ور ہوتے ہیں بس ناسیہ فرسائے حجاز\n\nرنگ توحید کا روحوں پہ وہاں چڑھتا ہے\nروپ بندوں کو نیا دیتی ہے دنیائے حجاز\n\nکیا لبھا پائے ہمیں پیرس و لندن کی کشش\n’’دل کے پردوں میں مچلتی ہے تمنائے حجاز‘‘\n\nبخدا طیبہ و بطحا کا شرف ہے ان سے\nنقشِ پائے شہِ دیں مرتبہ افزائے حجاز\n\nخود شفا آئے مریضوں کی بلائیں لینے\nنبض پر ہاتھ ہی رکھ دے جو مسیحائے حجاز\n\nاپنی آغوشِ میں لے لے اسے وقت رخصت\nلطف شہزادؔ پہ کچھ خاص جو فرمائے حجاز"
  },
  {
    "id": 63,
    "title": "نعت شریف",
    "description": "منگتے کا بھرم رکھنا سرکار کی سنت ہے\nسائل کی صدا سننا سرکار کی سنت ہے\n\nپرسش کے لیے جانا دکھ درد کے ماروں کی\nلاچار کے کام آنا سرکار کی سنت ہے\n\nتنہائی میں چھپ چھپ کر غیروں کے لیے رونا\nاپنوں کے ستم سہنا سرکار کی سنت ہے\n\nمخلوق سے پیش آنا ہر حال میں شفقت سے\nبندوں کا بھلا کرنا سرکار کی سنت ہے\n\nتعلیم شہِ دیں ہے ، تکریم بنی آدم\nتعلیم کو پھیلانا سرکار کی سنت ہے\n\nشیطاں کا طریقہ ہے سفاکی و خوں ریزی\nدشمن کو اماں دینا سرکار کی سنت ہے\n\nمشکل ہو بھلے جتنی ، حالات ہوں کیسے ہی\nحق بات سدا کہنا سرکار کی سنت ہے\n\nبیعت نہ کبھی کرنا فرعون زمانہ کی\nایمان پہ ڈٹ جانا سرکار کی سنت ہے\n\nکچھ وقت عبادت میں راتوں کو بسر کرنا\nآرام بھی فرمانا سرکار کی سنت ہے\n\nجس ذات نے بخشی ہیں شہزادؔ ہمیں سانسیں\nاس ذات کا دم بھرنا سرکار کی سنت ہے"
  },
  {
    "id": 64,
    "title": "نعت شریف",
    "description": "ابر کرم کچھ ایسا برسا تری گلی میں\nخالی رہا نہ کوئی منگتا تری گلی میں\n\nاٹکے ہوئے ہیں آنسو پلکوں پہ کس ادب سے\nآہوں میں ڈھل گیا ہے گریہ تری گلی میں\n\nسب زائروں کی خاطر ہے مژدئہ شفاعت\nیہ چیز ہے تو بس ہے تنہا تری گلی میں\n\nدیتی ہے پیار اتنا یہ سرزمین اقدس\nہر شخص لگ رہا ہے اپنا تری گلی میں\n\nملتی ہے سر بلندی سر کو یہاں جھکا کر\nدیکھا ہے ہم نے سجدہ تری گلی میں\n\nسورج میں اک جھجک سی وقت طلوع دیکھی\nمہتاب کو بھی گُم سُم پایا تری گلی میں\n\nہر شے میں ہم نے دیکھے حسنِ ازل کے جلوے\nاک چیز بھی نہیں ہے بے جا تری گلی میں\n\nپاس ادب سے دھڑکن دل میں سمٹ رہی ہے\nکچھ سہل تو نہیں ہے رہنا تری گلی میں\n\nشہزادؔ اس کرم کا گو اہل تو نہیں ہے\nاے کاش اور کچھ دن رہتا تری گلی میں"
  },
  {
    "id": 65,
    "title": "نعت شریف",
    "description": "جو اہل قرب ہیں کب آنکھ بھر کے دیکھتے ہیں\nرُخِ نبی کو وہ جاں سے گزر کے دیکھتے ہیں\n\nدکھائی دیتا ہے دھندلا سا گنبدِ اخضر\nجو آئینے میں کبھی چشم تر کے دیکھتے ہیں\n\nچلو چلو کریں سجدہ ریاض جنت میں\nنصیب ہم بھی ذرا اپنے سر کے دیکھتے ہیں\n\nاگر ہے مسئلہ ناموس مصطفی کا تو پھر\nہتھیلیوں پہ سروں کو بھی دھر کے دیکھتے ہیں\n\nفنا پذیر لگا ان کو رعب قصرِ شہی\nسدا جو روزن و در اُن کے گھر کے دیکھتے ہیں\n\nرخ حبیب تو شہزادؔ پھر ہے روئے حبیب\nادب شناس تو جالی کو ڈر کے دیکھتے ہیں"
  },
  {
    "id": 66,
    "title": "نعت شریف",
    "description": "اللہ نے یوں شان بڑھائی ترے در کی\nتعظیم خود انساں کو سکھائی ترے در کی\n\nہر لمحہ مجھے رہتا ہے احساسِ حضوری\nتصویر جو سینے میں سجائی ترے در کی\n\nطاری تھا مری روح پہ معراج کا عالم\nجالی جو مرے ہاتھ میں آئی ترے در کی\n\nتھا پاس ترے ذوق طہارت کا خدا کو\nسونپی جو فرشتوں کو صفائی ترے در کی\n\nاے رحمت عالم ہو کوئی وصل کا ساماں\nہے شاق بہت دل پہ جدائی ترے در کی\n\nلیتے ہیں فرشتے بھی یہاں سانس ادب سے\nوہ دھاک ترے رب نے بٹھائی ترے در کی\n\nپابندِ ادب ہیں یہاں صدّیق و عمر بھی\nتکریم وہ قرآں نے بتائی ترے در کی\n\nآیا مری سانسوں کو مہکنے کا سلیقہ\nخوشبو جو دل و جاں میں بسائی ترے در کی\n\nتوقیر ترے شہر کی مطلوب تھی رب کو\nقرآں میں قسم اس لیے کھائی ترے در کی\n\nکر آئوں چمن زار مدینہ کی زیارت\nہو پھر سے مقدر میں رسائی ترے در کی\n\nاس ہاتھ میں قدرت کا بھی کچھ ہاتھ تو ہوگا\nجس ہاتھ نے بنیاد اٹھائی ترے در کی\n\nاک بحر امڈنے لگا الطاف و عطا کا\nسائل نے جو زنجیر ہلائی ترے در کی\n\nاس قوم کو آیا نہیں جینے کا قرینہ\nجس قوم کو تعلیم نہ بھائی ترے در کی\n\nانسان کو احسان ترے یاد رہیں گے\nتاعمر نہ بھولے گی ، بھلائی ترے در کی\n\nشہزادؔ کے ہونٹوں پہ رہے نعت کا نغمہ\nآنکھوں میں رہے جلوہ نمائی ترے درکی"
  },
  {
    "id": 67,
    "title": "نعت شریف",
    "description": "مہکتا گلستان مدینے کی گلیاں\nہیں جنت بداماں مدینے کی گلیاں\n\nبہر سو ہیں شمع رسالت کی کرنیں\nفروزاں فروزاں مدینے کی گلیاں\n\nشہِ دوسرا ہیں یہاں جلوہ فرما\nنہ ہوں کیوں نمایاں مدینے کی گلیاں\n\nمنور ہیں مکّہ کے بازار کیسے\nہیں کتنی درخشاں مدینے کی گلیاں\n\nعقیدت کی دنیا ہے آباد ان سے\nمحبت کا عنواں مدینے کی گلیاں\n\nنگاہوں کی ٹھنڈک ہے گنبد کا جلوہ\nسکون دل و جاں مدینے کی گلیاں\n\nیہیں پر گنہگار پاتے ہیں تسکیں\nہیں بخشش کا ساماں مدینے کی گلیاں\n\nخدا کی عنایت ہے بطحا کی وادی\nنبی کا ہیں احساں مدینے کی گلیاں\n\nدلاتی ہیں رحمت کی امید سب کو\nبھلاتی ہیں عصیاں مدینے کی گلیاں\n\nہیں مرغوبِ اہل نظر مدتوں سے\nشبستاں شبستاں مدینے کی گلیاں\n\nتلاشِ نگاہِ طلب ان کا روضہ\nمرے دل کا ارماں مدینے کی گلیاں\n\nدکھاتی ہیں شہزادؔ اہل جہاں کو\nرہ علم و عرفاں مدینے کی گلیاں"
  },
  {
    "id": 68,
    "title": "نعت شریف",
    "description": "ہر اک خوبی اسے زیبا جو ہے تعریف کے لائق\nاسی کا نام ہے اعلیٰ اسی کی شان ہے فائق\n\nدرودِ سرمدی ہر وقت ہو سرکارِ والا پر\nتحیّت کی گھٹا برسے حبیب ربِّ اعلیٰ پر\n\nہر عظمت اس جہاں میں ان کے تلوے چومنے آئی\nوہ خوبی بن گئی میرے نبی کو جو ادا بھائی\n\nانہیں اچھی لگی جو بھی وہی عادت بھلائی ہے\nجو ان سے ہو گئی منسوب وہ خصلت اچھائی ہے\n\nشرف لوح و قلم کا بڑھ گیا اسم گرامی سے\nضیاء عرش معلیٰ کو ملی ماہِ تہامی سے\n\nشہ دیں کا نہیں جبریل کا سدرہ نشیمن ہے\nنہیں مطلوب قوسین آپ کا تو رب سے بندھن ہے\n\nملی آدم کو راحت اپنے نورالعین سے مل کر\nرُسل مسرور تھے اپنے دلوں کے چین سے مل کر\n\nخدا بھی ہو گیا خوش سیّدِ کونین سے مل کر\nمکمل دائرہ ہوتا ہے بس قوسین سے مل کر\n\nشفیع عاصیاں کا ذکر ہے رافع وبائوں کا\nطبیب دو جہاں کا نام ہے دافع بلائوں کا\n\nعقیدے کی مرے اسلاف بھی تصویب کرتے ہیں\nمری تصدیق خود اوراق ’’نشر الطیب‘‘ کرتے ہیں\n\nزیارت سے نبی کی نوریوں کو بھی قرار آیا\nفضائے عالم بالا پہ جیسے اک نکھار آیا\n\nوہ ذات وحدہٗ کا مصطفی کو عبدہٗ کہنا\nعجب تھا عابد و معبود کا وہ قبلہ رُو رہنا\n\nہوئے ہیں منکشف اسرار یہ اہل حقائق پر\nخدا کے کس قدر انعام ہیں خیرالخلائق پر\n\nگدائے بارگاہِ فخر موجودات ہیں سارے\nمعارف سرور دارین کی خیرات ہیں سارے\n\nحقیقت میں مقام خواجۂ کل خواجگاں کیا ہے\nخدا ہی جانتا ہے عظمتِ شاہ شہاں کیا ہے\n\nنہیں یہ جنس جو بدلے میں مال و زر کے ملتی ہے\nغذا شہزادؔ روحوں کو نبی کے در سے ملتی ہے"
  },
  {
    "id": 69,
    "title": "نعت شریف",
    "description": "دل کی بستی بسائی تری نعت نے\nبات بگڑی بنائی تری نعت نے\n\nتیری مدحت نے مجھ کو کیا محترم\nمیری عزت بڑھائی تری نعت نے\n\nجادئہ بندگی پرکیا گام زن\nحمد مجھ کو سُجھائی تری نعت نے\n\nمحو کرکے مری سب زیاں کاریاں\nدی مجھے ہر بھلائی تری نعت نے\n\nمیرے باطن کی تاریکیاں چھٹ گئیں\nشمع مدحت جلائی تری نعت نے\n\nمیں ہوں ممنون آقا تری نعت کا\nمیری قسمت جگائی تری نعت نے\n\nپھر کسی مشورے کی نہ حاجت رہی\nبات ایسی سنائی تری نعت نے\n\nبحر خواہش میں بس ڈوبتے ڈوبتے\nکشتی جاں بچائی تری نعت نے\n\nتیرے مولا سے لے کر مجھے بخش دی\nتیری مدح سرائی تری نعت نے\n\nاس طرح اپنے اندر فنا کر لیا\nمجھ کو ہر شے بھلائی تری نعت نے\n\nمجھ کو آغوش رحمت میں یوں لے لیا\nہر تمنا بھلائی تری نعت نے\n\nدیکھ کر نوریوں کو بھی رشک آ گیا\nایسی محفل سجائی تری نعت نے\n\nنعت سے مجھ پہ میری حقیقت کھلی\nکی مری رونمائی تری نعت نے\n\nبات کرنے کا مجھ کو سلیقہ نہ تھا\nبات کرنا سکھائی تری نعت نے\n\nہم بھی ہو آئے جنت کے باغات سے\nدی ہمیں یہ رسائی تری نعت نے\n\nوصل کی لذتوں سے کیا آشنا\nدور کی ہر جدائی تری نعت نے\n\nفکر عقبیٰ سے مجھ کو بری کر دیا\nدے کے ذوق گدائی تری نعت نے\n\nگرد حرص و ہوس کی چھٹی روح سے\nکی دلوں کی صفائی تری نعت نے\n\nمجھ کو حاصل ہے تائید روح امیں\nکی یہ عقدہ کشائی تری نعت نے\n\nاس عنایت پہ شہزادؔ ممنون ہے\nکی مری ہم نوائی تری نعت نے"
  },
  {
    "id": 70,
    "title": "نعت شریف",
    "description": "آپ کے ہو کے یا نبی ہم لوگ\nکیوں ہیں اخلاق سے تہی ہم لوگ\n\nآپ کے نام کا ادب ہے بہت\nنعت پڑھتے ہیں آپ کی ہم لوگ\n\nقلب میں احترام ہے بے حد\nآپ کے ہیں غلام بھی ہم لوگ\n\nیانبی رحم کیجیے ہم پر\nآپ ہی کے ہیں امتی ہم لوگ\n\nآپ سے عشق ہے حضور مگر\nہیں تمدن میں مغربی ہم لوگ\n\nآپ کی راہ سے ہٹے تو ہوئے\nنفس و شیطاں کے مقتدی ہم لوگ\n\nکفر دنیا پہ پھر مسلط ہے\nہیں اسیرانِ بے بسی ہم لوگ\n\nدر بدر ہو گئے زمانے میں\nہو کے محروم رہبری ہم لوگ\n\nمکتبِ علم و فن کے آپ رئیس\nہیں مگر اس کے مبتدی ہم لوگ\n\nنسبتِ شہرِ علم کے باوصف\nہیں فقیرانِ آگہی ہم لوگ\n\nجب تھی ہمراہ سنتوں کی ضیا\nظلمتوں میں تھے روشنی ہم لوگ\n\nپھر بھی شہزادؔ ہے امید کرم\nگو کہ ہیں صیدِ گمرہی ہم لوگ"
  },
  {
    "id": 71,
    "title": "نعت شریف",
    "description": "کس طرح نہ ہو منبعِ انوار عمامہ\nپہنے ہوئے ہیں سیّدِ ابرار عمامہ\n\nثابت ہے روایات صحیحہ سے یہ دعویٰ\nہے تاجِ نبی سنتِ سرکار عمامہ\n\nسجتا رہا جو سرور کونین کے سر پر\nوہ رحمت عالم کا طرح دار عمامہ\n\nشملے کی ہر اک تار میں رقصاں ہیں ستارے\nاللہ رے زیبا و ضیا بار عمامہ\n\nدر ہائے سیادت سے مرصع ہے ہر اک بل\nہے سارے عماموں کا یہ سردار عمامہ\n\nہے جس میں جڑا ختم نبوّت کا نگینہ\nسرکار کے سر پر ہے وہ شہکار عمامہ\n\nجبریل اُتر آتے تھے سدرہ سے زمیں پر\nدیتا جو کبھی دعوتِ دیدار عمامہ\n\nایمان کا اظہار ہے سرکار کی الفت\nسرکار سے الفت کا ہے اظہار عمامہ\n\nآتی ہیں سلامی کو فرشتوں کی قطاریں\nنکلیں جو پہن کر شہِ ابرار عمامہ\n\nدستار کی مانند جو روضے پہ سجا ہے\nکاشانہ اقدس کا ہے شہکار عمامہ\n\nہے اس کو سر سرور کونین سے نسبت\nکیوں کر نہ ہو پھر نور کا مینار عمامہ\n\nہے قول شہ ارض و سما فَاتَّبَعُوْنِیْ\nاس واسطے مومن کو ہے درکار عمامہ\n\nسرکار نے جو غزوئہ خیبر میں نوازا\nتھا زیبِ سرِ حیدرِ کرّار عمامہ\n\nسنت کے محافظ تھے سب اصحاب پیمبر\nرکھتے تھے مہاجر ہوں کہ انصار عمامہ\n\nتھی بدر میں دستار فرشتوں کے سروں پر\nباندھے ہوئے آئے تھے مددگار عمامہ\n\nشملے میں نہاں پشت پناہی کی ادا ہے\nہے ظلِّ ید ایزدِ غفاّر عمامہ\n\nاس پر ہے سجا نقشۂ نعلین مبارک\nکام آیا ہے مشکل میں کئی بار عمامہ\n\nسوراخ ہیں آقا کئی دامان طلب میں\nپھیلائے ہوئے ہوں سر دربار عمامہ\n\nسجدے کی جو اس در پہ نہیں سر کو اجازت\nہے سجدئہ بے سر کو بھی طیاّر عمامہ\n\nچوموں کبھی اس کو تو کبھی سر پہ سجائوں\nہے میرے لیے آپ کی پیزار عمامہ\n\nپگڑی نہ اچھل جائے کہیں اہل حرم کی\nآقا ہے توجہ کا طلبگار عمامہ\n\nشہزادؔ یہ سرکارِ مدینہ کا کرم ہے\nباندھے ہوئے ہے مجھ سا گنہگار عمامہ"
  },
  {
    "id": 72,
    "title": "نعت شریف",
    "description": "نانا کو کریں پیش جو حسنین عمامہ\nکیسے نہ ہو پھر قرۃ عینین عمامہ\n\nمکہ میں دیا آپ نے جب فتح کا خطبہ\nباندھے ہوئے تھے سرورِ کونین عمامہ\n\nجبریل بھی حیرت سے تکا کرتے تھے ان کو\nجب سر پر سجاتے شہِ دارین عمامہ\n\nرفعت یہ ملی صاحب معراج کے صدقے\nپہنچا تھا سرِ عرش یہ اک رَین عمامہ\n\nہر وقت مجھے رہتا ہے احساس حضوری\nہونے نہیں دیتا مجھے بے چین عمامہ\n\nشہزادؔ میں کیسے نہ انہیں سر پہ سجائوں\nمیرا تو ہیں سرکار کے نعلین عمامہ"
  },
  {
    "id": 73,
    "title": "نعت شریف",
    "description": "حیات بے ثابت کو خدا اگر دوام دے\nمجھے تو بس غلامی در شہِ انام دے\n\nاک آرزو سی ہے دبی دلِ نیاز مند میں\nاُنیس و بو تراب سا مجھے بھی کوئی نام دے\n\nمیں ایک نعت لکھ سکوں، کعب بن زُہیر سی\nمجھے قدیر و مقتدر قدرتِ کلام دے\n\nکہاں چلی گئی ہے تو ہوائے شہر مصطفی\nمرے دل حزیں کو بھی سکون کا پیام دے\n\nہماری سرزمین بھی ترس گئی ہے امن کو\nہمیں بھی خالق جہاں عمر سا اک امام دے\n\nمرے نبی سا سرپرست دے ہر اک غلام کو\nبلال سا ہر ایک سرپرست کو غلام دے\n\nعقیق سے بھی خوب تر نفس مثلِ آب زر\nثنائے نور کے لیے حروفِ نور فام دے\n\nازالہ ذکرِ مصطفی سے میں کروں خطائوں کا\nمیںخود سے لڑ سکوں مجھے وہ ذوقِ انتقام دے\n\nترس گئے ہیں امن کو ہم امن کے پیام بر\nہماری سمت بھی نظر ، ہمیں بھی اب سلام دے\n\nمجددّؔی میں امتی ہوں شہریار علم کا\nمیں کیسے مان لوں اگر کوئی دلیل خام دے"
  },
  {
    "id": 74,
    "title": "نعت شریف",
    "description": "تنویرِ سخن نیرّ تابانِ رسالت\nتابانی فن نیر تابانِ رسالت\n\nفریاد کناں ہے شبِ عصیاں کی سیاہی\n’’ہاں ایک کرن ، نیر تابانِ رسالت‘‘\n\nکرنے کو فدا آپ کی عزت پہ ملے ہیں\nیہ جان و بدن نیر تابان رسالت\n\nاک نعت لکھوں آپ کی میں خون جگر سے\nہے دل میں لگن نیر تابان رسالت\n\nپڑھتے ہیں درود آپ کو دیتے ہیں دعائیں\nیہ سرو و سمن نیر تابان رسالت\n\nکھلتے ہوئے پڑھتے ہیں سبق صلِّ علیٰ کا\nگل ہائے چمن نیر تابانِ رسالت\n\nلکھتے ہی ثنا دور نکل جاتے ہیں دل سے\nسب رنج و محن نیر تابانِ رسالت\n\nکرتے ہیں ہمیشہ شب بدعت کا ازالہ\nانوارِ سنن ، نیر تابانِ رسالت\n\nبے تاب فدا ہونے کو رہتے ہیں ہمیشہ\nسب اہل سنن نیر تابانِ رسالت\n\nپڑھتا ہی رہے نعت کا شہزادؔ وظیفہ\nہے ایک ہی دھن نیر تابان رسالت"
  },
  {
    "id": 75,
    "title": "نعت شریف",
    "description": "اللہ نے کر دی ہے بیاں شانِ رسالت\nقرآن کی آیات ہیں شایانِ رسالت\n\nدل جب سے ہے وابستۂ دامانِ رسالت\nحاصل ہے مسلسل مجھے فیضانِ رسالت\n\nہر گوشۂ پر نور ہے فردوس بداماں\nیہ عرش معلیٰ ہے کہ ایوانِ رسالت\n\nسجدے کو مچلتا ہے بہرگام یہاں دل\nہے کعبۂ عشاق خیابانِ رسالت\n\nسرکار نے فرمایا اسے پاک بتوں سے\nپہنچا تو ہے کعبے کو بھی فیضان رسالت\n\nحرف آئے تو کیسے کوئی سرکار پہ آئے\nہے ذاتِ احد آپ نگہبانِ رسالت\n\nآیاتِ الٰہی کے ہیں سرکار مفسر\nاللہ کا فرمان ہے فرمان رسالت\n\nاس منصب عالی پہ انہیں فخر نہیں ہے\nہیں سرورِ دیں ، سیّد و سلطان رسالت\n\nسایہ سرِ ناعت پہ ہے جبریل کے پر کا\nمولا کی اماں میں ہے ثنا خوانِ رسالت\n\nہو جائے ثمر بار مرا نخلِ تمنا\nبرسے جو کبھی قلب پہ بارانِ رسالت\n\nحسنین جو ہیں سیدّہ زہرا کے دُلارے\nدنیا میں ہیں دونوں گل و ریحانِ رسالت\n\nبے تاب چٹکنے کو ہے غنچہ مرے دل کا\nہاں ایک کرن نیرّ تابانِ رسالت\n\nہونٹوں پہ نئی نعت کے اشعار سجائے\nہے زمزمہ خواں بلبلِ بستانِ رسالت\n\nہیں عالم حیرت میں اولوالعزم پیمبر\nخالق نے بنائی ہے عجب شانِ رسالت\n\nقرآن میں خالق نے قسم کھائی ہے اس کی\nایمان کی جاں یونہی نہیں جانِ رسالت\n\nاس در کے جو اکرام کا قائل ہی نہیں ہے\nلو بن کے کھڑا ہے وہی دربانِ رسالت\n\nیہ گلشن بے خار ہے محفوظ خزاں سے\nشہکار ہے فطرت کا گلستانِ رسالت\n\nموقوف ہے اس بات پہ انساں کی ترقی\nانسان کو کس درجہ ہے عرفانِ رسالت\n\nانسان کو سرکار نے انسان بنایا\nانسان پہ کیا کم ہے یہ احسانِ رسالت\n\nشہزادؔ یہ اعزاز کوئی کم تو نہیں ہے\nمجھ ایسا گنہگار ہو مہمانِ رسالت"
  },
  {
    "id": 76,
    "title": "نعت شریف",
    "description": "جمال سرورِ دیں کا کہاں سے لائوں پیمانہ\nکہ جبرائیل بھی شمع رسالت کا ہے پروانہ\n\nمرے آقا مرے احوال پر بھی رحم فرمانا\nخصائل آپ کو خالق نے بخشے ہیں کریمانہ\n\nشہنشاہ دو عالم کی گلی کا ہے عجب منظر\nیہاں ہر ایک دیوانہ نظر آتا ہے فرزانہ\n\nفرازِ عرش سے ہر دم نئے انوار اترتے ہیں\nشہِ کونین کے روضے کا عالم ہے جداگانہ\n\nخدا کے نور نے جلوہ نمائی کی ہے اس دھج سے\n’’کہ سینہ ارض طیبہ کا بنا رشک پری خانہ‘‘\n\nبسے انوار خورشید حرم اِس شان سے اس میں\n’’کہ سینہ ارض طیبہ کا بنا رشک پری خانہ‘‘\n\nبھٹکتے آدمی کو دے دیا کردار کا جوہر\nسجایا پیکر اخلاق نے یوں دل کا ویرانہ\n\nنگاہِ لطف پھر ہو رحمۃ للعالمیں اس پر\nہوئے جاتے ہیں پھر انسان کے تیور بہیمانہ\n\nرہی اس کو ہمیشہ کدّ شہ دیں گے غلاموں سے\nروش ابلیس نے سرکار سے رکھی حریفانہ\n\nجہاں روح و بدن کے گھائو سارے بھرتے جاتے ہیں\nمدینہ میں طبیب حق نے کھولا وہ شفاخانہ\n\nثنا خوان شہ دیں کی بڑی توقیر ہے لوگو\nخدا کا فضل ہے اتنی بڑی توفیق مل جانا\n\nوہ اپنے مدح گُستر کے لیے ان کا دعا کرنا\nوہ اپنے شاعر دربار کا اکرام فرمانا\n\nمجھے روح القدس اپنے قریں محسوس ہوتے ہیں\nکبھی جب یاد آ جاتی ہے ان کی داد شاہانہ\n\nثنا خوانِ شہ دیں کے لیے بے حد ضروری ہے\nادب ، صدق و وفا، حسن عمل ، سیرت شریفانہ\n\nمرے آقا ہی زیب مسندِ محمود جب ہوں گے\nتو پھر کیا عرصۂ محشر سے اے شہزادؔ گھبرانا"
  },
  {
    "id": 77,
    "title": "نعت شریف",
    "description": "ان پر درود بھیجئے حمدِ خدا کے بعد\nپڑھئے نبی کی نعت خدا کی ثنا کے بعد\n\nیہ بات مانتے ہیں خلیل و کلیم بھی\nخیرالوریٰ کی شان ہے ذوالکبریا کے بعد\n\nتاج سر وظائف و اذکار ہے درود\nباقی ہر ایک ورد ہے صلِّ علیٰ کے بعد\n\nبعد از خدا بزرگ ہیں وہ قصہ مختصر\n’’اک مصطفی کا نام ہے نامِ خدا کے بعد‘‘\n\nکچھ بھی نہ تھا خدا کے سوا کائنات میں\nعالم تمام خلق ہوا مصطفی کے بعد\n\nسرکار سے ہیں عالم امکاں کی رونقیں\nہر واقعہ ہوا ہے شہِ دوسرا کے بعد\n\nہمسائیگی ملے شہِ دارالسلام کی\nکیا اور مانگتا میں بھلا اس دعا کے بعد\n\nسرشار کر دیا اسے رحمت پناہ نے\nپہنچا درِ حضور پہ جو بھی خطا کے بعد\n\nشہزادؔ کو بھی ہے اسی چادر کی جستجو\nپائی تھی کعب نے جو حصولِ رضا کے بعد"
  },
  {
    "id": 78,
    "title": "نعت شریف",
    "description": "ذکر شہ انام ہے نامِ خدا کے بعد\nیہ ورد صبح و شام ہے نامِ خدا کے بعد\n\nپہلے اسی کا ذکر ہے ہر کار خیر سے\nسرکار پر سلام ہے نامِ خدا کے بعد\n\nتحریر ہے جو نور کے حرفوں سے عرش پر\n’’اک مصطفی کا نام ہے نامِ خدا کے بعد‘‘\n\nحمد خدا کے بعد ہے مولائے کل کی نعت\nمدحت کا اہتمام ہے نامِ خدا کے بعد\n\nہیں حرز جاں درود و تحیّت کے زمزمے\nجچتا یہی کلام ہے نامِ خدا کے بعد\n\nہر دم نیا مراقبہ محراب نعت میں\nا پنا تو بس یہ کام ہے نامِ خدا کے بعد\n\nپڑھتا ہوں ان کے اسم گرامی پہ میں درود\nپونجی یہی تمام ہے نامِ خدا کے بعد\n\nقطعہ ہو یا رباعی ، قصیدہ ہو یا غزل\nمدح نبی مدام ہے نامِ خدا کے بعد\n\nاس نام سے ہے بزمِ عناصر کی ابتدا\nاس پر ہی اختتام ہے نامِ خدا کے بعد\n\nاس نام سے ہے خیمۂ گردوں تنا ہوا\nاس نام کو دوام ہے نامِ خدا کے بعد\n\nیہ بات ہر کتاب مقدس میں ہے لکھی\nسرکار کا مقام ہے نامِ خدا کے بعد\n\nلوح مبیں پہ نام ہے سرکار کی رقم\nیہ نام ہی امام ہے نامِ خدا کے بعد\n\nشہزادؔ میرے آقا و مولا کے نام کا\nکس درجہ احترام ہے نامِ خدا کے بعد\n\nنعت شریف\nجیسے خدا کی ذات سے ہیں ٗمصطفی قریب\n\nایسے نہ لا یزال کے کوئی ہوا قریب\nجو جتنا بارگاہ نبی سے رہا قریب\n\nاتنا ہی ذوالجلال کے ہوتا گیا قریب\nکرتا ہے طے وہ قرب الٰہی کی منزلیں\n\nکرتے ہیں جب کسی کو حبیب خدا قریب\nوہ خوش نصیب کون ہے ازغار تا مزار\n\nہرحال میں حضور نے جس کو رکھا قریب\nدنیا کو رنگ و نور سے معمور کر گیا\n\nاس پیکر جمال کے جو بھی رہا قریب\nمضموں ملا یہ سورئہ احزاب سے مجھے\n\nمومن کی جاں سے بھی ہیں شہ انبیاء قریب\nپابند قرب و بُعد نہیں ان کی بارگاہ\n\nیہ ان کا مسئلہ ہی نہیں دور یا قریب\nذکر نبی کو جو بھی بنائے گا حرز جاں\n\nاس کو رکھیں گے حشر میں خیرالوریٰ قریب\nآقا نے اپنی ذات مقدّس کا جُز کہا\n\nکس درجہ تھیں حضور کے خیر النساء قریب\nہوتی ہے سہل اسوئہ اقدس کی پیروی\n\nرکھتا ہوں نقشِ پائے نبی کو سدا قریب\nشہزادؔ زندگی میں مزے لوں بہشت کے\n\nدو چار دن جو رکھ لیں شہِ دوسرا قر"
  },
  {
    "id": 79,
    "title": "نعت شریف",
    "description": "یہی میرا وظیفہ ہے ، یہی میری عبادت ہے\nمیں اہل نعت میں سے ہوں ، میسر یہ سعادت ہے\n\nزمانے بھر کی مہمانی کو وا بابِ عنایت ہے\nہیں جس کے ریزہ چیں سلطاں ، یہ ایسا خوانِ نعمت ہے\n\nسنو! تقویم عشق مصطفی پر جس کی خلقت ہے\nاسے جینے کی حاجت ہے ، نہ مرنے کی ضرورت ہے\n\nقدم فرما ہوئے ہیں رحمۃ للعالمیں e جس جا\nوہاں کا ذرہ ذرہ آج تک خورشید سیرت ہے\n\nنہ ہو پابوسیٔ مولائے عالمe سے جو بہرہ مند\nوہ دنیا کوئی دنیا ہے وہ جنت کوئی جنت ہے\n\nمراگریہ بھی اک فیضان ہے اس ابرِ رحمت کا\nکہ چشم تر میں جو بھی قطرہ ہے ، دریا بضاعت ہے\n\nمحمدe کے غلاموں ، جانثاروں ، فیض یابوں میں\nہر اک شاہِ ولایت ہے ، ہر اک میرِ امامت ہے\n\nکہا جبریل نے اپنے مراتب کو بیاں کر کے\nیہ سب حضرت تمہاری مہربانی ہے ، عنایت ہے\n\nیہی احساس رکھتا ہے تروتازہ مجھے ہر دم\nمیں کس کا امتی ہوں اور میری کس سے نسبت ہے\n\nہمیشہ سے رہے ہیں متفق اہل نظر اس پر\n’’یہ دنیا ایک صحرا ہے ، مدینہ باغ جنت ہے‘‘\n\nدیار قدس میں شہزادؔ تھا امسال بھی حاضر\nہوا پھر سے کرم بے حد ، شہ طیبہ کی شفقت ہے"
  },
  {
    "id": 80,
    "title": "نعت شریف",
    "description": "زہے مقدر ہمیں بھی نسبت ہے بارگاہِ شہ شہاں ا سے\nغبار کو بھی تو کچھ علاقہ ہوا ہی کرتا ہے کارواں سے\n\nہر ایک تشبیہ سے مبرّا ، ورا ہے بے شک وہ ہر مکاں سے\n’’ملا خدا بھی اگر کسی کو ، ملا محمدا کے آستاں سے‘‘\n\nجہانِ فانی میں آ رہے ہم ہجوم ارواح سے نکل کر\nتمنا ان کی لیے پھرے ہے ، یہاں وہاں سے ، وہاں یہاں سے\n\nمرا حوالہ یہاں بھی ان کی عنایتیں ہیں ، نوازشیں ہیں\nخدا نے چاہا تو جانا جائوں گا حشر میں بھی اِسی نشاں سے\n\nثنائے خواجہ کی کیف افزا فضا میں لیتا ہوں سانس جب میں\nاترنے لگتا ہے قلبِ مضطر پہ اک سکینہ سا آسماں سے\n\nمقام محمود پر قیامت کے روز ہوں گے حضورا فائز\nانہی کی مدحت سنائی دے گی ہر ایک لب سے ، ہر اک زباں سے\n\nبرستا جائے گا ابر بخشش باذن مولا وہاں وہاں پر\nگزرتے جائیں گے سرور دیں بروز محشر جہاں جہاں سے\n\nوہ دیکھ شہزادؔ ان کا روضہ ریاض جنت سے متصل ہے\nبہشت بھی فیض پا رہی ہے شہ مدینہ کے گلستاں سے"
  },
  {
    "id": 81,
    "title": "نعت شریف",
    "description": "شکر ہو سکتا نہیں اس پر خدائے پاک کا\nنعت گو اس نے کیا مجھ کو شہِ لولاک کا\n\nمرتکب ہے جو بھی ایذائے رسول پاک کا\nہے جہنم مستقر ایسے ہر اک بے باک کا\n\nاشک مشغولِ دعا ہیں جالیوں کے روبرو\nبخت جاگ اٹھا ہے میرے دیدئہ نمناک کا\n\nجو تھے محروم بصیرت ، ہو گئے اہل نظر\nسرمہ آنکھوں میں لگا کر اس گلی کی خاک کا\n\nنوع انساں تھی تباہی کے کنارے پر ، کہ بس\n’’ہاتھ آیا دامنِ رحمت شہِ لولاک کا‘‘\n\nمجھ پہ ہوتی ہے نچھاور خود بہار ہشت خلد\nغنچہ دل میں جب چٹکتا ہے درود پاک کا\n\nاس کی امت پر بھی کھول ابوابِ رحمت اے کریم!\nجس کی خاطر وا کیا تھا تو نے ، در افلاک کا\n\nیہ بھی تھا سرکارِ والا کے خصائص میں سے ایک\nدور ہی سے دشمن پر بیٹھ جانا دھاک کا\n\nکس ادب سے چومتی ہو گی لب و دندان کو\nمرتبہ اعلیٰ ہے کتنا آپ کی مسواک کا\n\nدھو کے پیتے تھے قمیص پاک کا پانی مریض\nمعجزہ مشہور ہے سرکارا کی پوشاک کا\n\nمیں کہ اک موج غبار کاروان نعت ہوں\nہے کرم شہزادؔ یہ بھی اس خس و خاشاک کا"
  },
  {
    "id": 82,
    "title": "نعت شریف",
    "description": "مجھے فیضان صبح و شام آتا ہے محمد کا\nزباں پر میری جس دم نام آتا ہے محمد کا\n\nمصائب دنیوی ہوں یا مراحل قبر و محشر کے\nوسیلہ بے کسوں کے کام آتا ہے محمد کا\n\nمسافر جادئہ سیرت کے رکھ ملحوظ یہ نکتہ\nمدینہ راہ میں ہر گام آتا ہے محمد کا\n\nسناتا ہے جب آ کر ذکر طیبہ کا کوئی زائر\nتو لگتا ہے کہ بس پیغام آتا ہے محمد کا\n\nقصیدہ جب بھی دربار نبی میں نذر کرتا ہوں\nنیا ہر بار اک انعام آتا ہے محمد کا\n\nفلاح و فوز کے حق دار ہیں دنیا و عقبیٰ میں\nبجا لانا جنہیں اکرام آتا ہے محمد کا\n\nپکاریں اہل جنت جب پڑے مجھ پر نظر ان کی\nوہ دیکھو بندئہ بے دام آتا ہے محمد کا\n\nمجھے شہزادؔ ان کی تشنگی پہ رشک آتا ہے\nبجھانے پیاس جن کی جام آتا ہے محمد کا"
  },
  {
    "id": 83,
    "title": "نعت شریف",
    "description": "دو عالم کی زینت رسالت کسی کی\nخدا کی عنایت رسالت کسی کی\n\nکمال بدایت رسالت کسی کی\nجمال نہایت رسالت کسی کی\n\nفروغ شریعت رسالت کسی کی\nہے روح طریقت رسالت کسی کی\n\nکرم کی روایت رسالت کسی کی\nسراسر ہے رحمت رسالت کسی کی\n\nرسل آئے آدم سے تا ابن مریم\nکہ تھی غرض و غایت رسالت کسی کی\n\nازل تا ابد جلوہ گر اب رہے گی\nبصد شان و شوکت رسالت کسی کی\n\nہوئی ضوفشاں عرصۂ تیرگی میں\nبصدق و امانت رسالت کسی کی\n\nقلم لم یزل کی بنائی گئی ہے\nبرائے اطاعت رسالت کسی کی\n\nرسل مقتدی ہوں گے روز قیامت\nکرے گی قیادت رسالت کسی کی\n\nنہ کیوں دو جہاں پھر کریں استفادہ\nدو جگ میں ہے رحمت رسالت کسی کی\n\nجو رسوائے عالم تھے اب محترم ہیں\nہے وجہِ کرامت رسالت کسی کی\n\nہماری شفاعت کو شہزادؔ ہو گی\nبروز قیامت رسالت کسی کی"
  },
  {
    "id": 84,
    "title": "نعت شریف",
    "description": "خدا کا تقرب ہے قربت کسی کی\nکہ ہے اصل ایمان الفت کسی کی\n\nکلام الٰہی کی آیات بن کر\nہوئی جلوہ فرما فضیلت کسی کی\n\nنمازی صلوٰۃ و ثنا پڑھ رہے ہیں\nادا ہو رہی ہے عبادت کسی کی\n\nسبھی انبیاء و رسل محترم ہیں\nمسلّم ہے سب پر قیادت کسی کی\n\nہے سب اہل ایماں کا پختہ عقیدہ\nہمیں کام دے گی شفاعت کسی کی\n\nبہرحال دامان سائل کو بھرنا\nہمیشہ رہی ہے روایت کسی کی\n\nخدا کی قسم نعت بھی خوب شے ہے\nکسی کی نجات اور مدحت کسی کی\n\nعجب دلکشی ہے مدیحِ نبی میں\nکسی کی ثنا اور سعادت کسی کی\n\nکسی کے کرم پر لگی ہیں یہ آنکھیں\nنوازے گی آخر عنایت کسی کی\n\nہمارے فضائل بھی قرآن میں ہیں\nکہ آخر کو ہم بھی ہیں امت کسی کی\n\nہمارا بھی شہزادؔ ہے کوئی وارث\nہے حاصل ہمیں بھی حمایت کسی کی"
  },
  {
    "id": 85,
    "title": "نعت شریف",
    "description": "ہر عقیدت پہ مقدّم ہے عقیدت اپنی\nفیض سرکارِ دو عالم ہے عقیدت اپنی\n\nدل تصور میں مدینے کے سفر پر مائل\nساتھ باعزم مصمم ہے عقیدت اپنی\n\nمستقل ربط ہے بارانِ کرم سے ہم کو\nموسم زرد میں رم جھم ہے عقیدت اپنی\n\nفرد اعمال میں مرقوم ہیں نعتیں ان کی\nلفظ در لفظ مجسم ہے عقیدت اپنی\n\nالتفات شہ کونین میسر ہے ہمیں\nایک سرشاری پیہم ہے عقیدت اپنی\n\nبے خودی میں بھی رہا صحو کا عالم طاری\nتابش نور مجسم ہے عقیدت اپنی\n\nاک تسلسل ہے تحیات و ثنا کا ہر پل\nمحو تسلیم دما دم ہے عقیدت اپنی\n\nطے کیے ایسے محبت کے مدارج ہم نے\nرب کے محبوب سے محکم ہے عقیدت اپنی\n\nجب سے وابستۂ دامان کرم ہوں شہزادؔ\nبے نیازِ الم و غم ہے عقیدت اپنی"
  },
  {
    "id": 86,
    "title": "نعت شریف",
    "description": "رسول ہر دو عالم کا ہے یہ فرمان ’’لا تَغْضِب‘‘\nیہ فرمانِ نبی ہے صاحب ایمان ’’لا تَغْضِب‘‘\n\nنصیحت کے لیے جب کی گزارش اک صحابی نے\nکہا سرکار نے ہر بار اے انسان ’’لا تَغْضِب‘‘\n\nخطا سے در گزر کرنا بہت محبوب ہے رب کو\nکسی حالت میں بھی اے بندئہ رحمان ’’لا تَغْضِب‘‘\n\nخدا کو ہے بہت ہی پیار غصہ پینے والوں سے\nبڑی ’’والکاظمین الغیظ‘‘ کی ہے شان ’’لا تَغْضِب‘‘\n\nشہ کونین کی سیرت کا ہے اک دلنشیں پہلو\nکرو تم دشمنوں کے ساتھ بھی احسان ’’لا تَغْضِب‘‘\n\nشعار انبیاء و اصفیاء ہے درگزر کرنا\nیہی ہے شیوئہ اہل رہ عرفان ’’لا تَغْضِب‘‘\n\nچلو یہ باہمی بے زاریاں سب ختم کر ڈالیں\nفنا ہو جائیں گے اک دن یہ مال و جان ’’لا تَغْضِب‘‘\n\nترا سب سے بڑا دشمن ہے تیرے ساتھ ہر لمحہ\nکہیں چنگاریاں بھڑکا نہ دے شیطان ’’لا تَغْضِب‘‘\n\nجسے قابو ہو اپنے نفس پر غصے کی حالت میں\nہے طاقتور حقیقت میں وہی انسان ’’لا تَغْضِب‘‘\n\nتکبرّ بندئہ ناچیز کو زیبا نہیں ہرگز\nانا کو چھوڑ دے اے پیکرِ ایقان ’’لا تَغْضِب‘‘\n\nخدائے قاہر و جبار کی بھی ہے رضا اس میں\nجسے سب مانتے ہیں تو بھی اس کی مان ’’لا تَغْضِب‘‘\n\nخدا نے بھی کیا غصے پہ اپنے فضل کو غالب\nوہ بے شک ہے حلیم و غافر و سبحان ’’لا تَغْضِب‘‘\n\nمری اس بات پر شہزادؔ ہے ’’ماینطق‘‘ شاہد\nحدیثِ سرور دیں ہی تو ہے قرآن ’’لا تَغْضِب‘‘"
  },
  {
    "id": 87,
    "title": "مدینے کی کھجوریں",
    "description": "آتی ہیں بہت یاد مدینے کی کھجوریں\nہیں رزقِ خداداد مدینے کی کھجوریں\n\nہمراہ یہ لے آتی ہیں زمزم کے کٹورے\nکر دیتی ہیں دل شاد مدینے کی کھجوریں\n\nگزری تھی جو حجاج پہ دوران زیارت\nکہتی ہیں وہ روداد مدینے کی کھجوریں\n\nجو باغ کہ سیراب نہ ہوتا ہو کسی سے\nکر دیتی ہیں آباد مدینے کی کھجوریں\n\nاللہ کے محبوب سے نسبت جو ہے ان کو\nپاتی ہیں بہت داد مدینے کی کھجوریں\n\nکرتی ہیں کرم زائر طیبہ پہ خصوصی\nبن جاتی ہیں ہم زاد مدینے کی کھجوریں\n\nیہ جذبۂ ایمان کو دیتی ہیں حرارت\nہیں دافعِ الحاد مدینے کی کھجوریں\n\nجب بھوک ستاتی ہے مسافر کو سفر میں\nفرماتی ہیں امداد مدینے کی کھجوریں\n\nہر آن تصور میں ہیں زمزم کے کٹورے\nآنکھوں میں ہیں آباد مدینے کی کھجوریں\n\nسرکار کے فیضان سے معمور ہیں ریشے\nہیں پیکرِ ارشاد مدینے کی کھجوریں\n\nاللہ رہے وہ عنبر و عجوہ کی حلاوت\nکیا خوب ہیں شہزادؔ مدینے کی کھجوریں"
  },
  {
    "id": 88,
    "title": "قطعات",
    "description": "کبھی تبت یدا کا تازیانہ تا و تب آیا\nکہیں ما اغنیٰ عنہٗ مالہٗ اور مَاکَسَبْ آیا\n\nتری ناموس کا خود قادر مطلق محافظ ہے\nحمایت میں تری یا مصطفی قرآن سب آیا"
  },
  {
    "id": 89,
    "title": "اگر توبہ پہ ہے مائل طبیعت",
    "description": "وضو کر لیجیے پہلے دعا سے\nنہیں ہے آنکھ میں پانی تو کر لیں\n\nتیمم خاکِ پائے مصطفی "
  },
  {
    "id": 90,
    "title": "قطعات",
    "description": "حاصل عمر ہے بشر کے لیے\nسرور دیں کی ذات کا ادراک\n\nنعت میں نعت ہی کا ہو مضموں\nاس کو کہتے ہیں نعت کا ادراک"
  },
  {
    "id": 91,
    "title": "غرّنی رحمۃ ربیّ",
    "description": "کر دیا غافل تجھے کس نے خدا کی ذات سے\nمجھ سے پوچھا ایک دن یہ آیۂ قرآن نے\n\nجھوم کر شہزادؔ میں نے یوں دیا اس کا جواب\nکر دیا بے باک مجھ کو رحمت رحمن نے"
  },
  {
    "id": 92,
    "title": "تبصرہ",
    "description": "شہزادؔ مجدّدی کی نعت کے کئی پہلو ہیں۔ ان کے ہاں نعتیہ موضوعات کا بڑا تنوع ہے۔ جذبات و احساسات اور نظریات کو بیان کرنے کے الگ الگ انداز ہیں۔ موصوف دیار مصطفیا جانے اور وہاں زیست کرنے کے جذبات اور خواہشات کو جس طرح بیان کرتے ہیں اور پھر جس طرح دورانِ حاضری درودیوار حبیب کبریا کی بات کرتے ہیں۔ اس سے ان کا عشق اور عقیدت واضح جھلکتی نظر آتی ہے۔ شہزادؔ مجدّدی فن نعت گوئی کو سعادت بھی سمجھتے ہیں اور پھر اس سعادت اورعطا پر فخر بھی کرتے ہیں۔ اس فخر کا اظہار وہ جس انداز سے کرتے ہیں قاری خود اس انداز میں کیف و سرشاری محسوس کرنے لگتا ہے۔\nشہزادؔ مجدّدی کے ہاں نعت میں غزل کا رنگ بھی نمایاں ہے اور خوبصورت الفاظ کا استعمال بھی جوکہ آپ کی نعت کو فنی حوالے سے حسین ترین بنا رہا ہے۔\n\nآپ نے نعت لکھتے ہوئے عقل و شعور کے سارے در وا کیے ہوتے ہیں کہ بات کہیں مقام مصطفیا سے پیچھے نہ رہ جائے۔ شہزادؔ کی حمد و مناجات میں جو دعائیں اور التجائیں ہیں وہ بھی درحبیب خدا پہ زیست کرنے اور نعت رسول مصطفیالکھنے اور پڑھنے کی ہیں۔ ان کی نعت سے مکمل وابستگی ہی ہے جوکہ ان کی نعت کو زندہ رکھے ہوئے ہے کیوں کہ ان کے ہاں روایتی اور مصنوعی خیال نہیں ہیں۔ ہر خیال میں سچائی اور رعنائی ہے۔ عشق اور محبت ہے اور وہ اس فن نعت کو زندگی تصور کرتے ہوئے کہتے ہیں۔\n؎مرا آغاز اور انجام ہے شہزادؔ نعت ان کی\n\nہوا ہے کام اک مجھ سے یہی مقدور بھر افضل\n؎روح کا رزق اترتا ہے فلک سے جب بھی\n\nمیرے حصے میں شہ دیں کی ثنا آتی ہے\nشہزادؔ مجدّدی فن نعت میں اور حمدنگاری کے راستے میں عشق کو ہی رہبر و مرشد اور روشنی و نور سمجھتے ہیں کیوں کہ اس کے علاوہ نہ تو نعت لکھی جاتی ہے اور نہ ہی زندگی بسر ہوتی ہے۔ انہوں نے اپنی حمد و نعت میں فلسفہ عشق کو بڑے خوبصورت پیرائے میں بیان کیا ہے اور عاشقان رسول خداا کو دو جہانوں میں معتبر و افضل گردانا ہے۔ شہزادؔ مجدّدی کی نعت ہمیں سیرت و صورت مصطفی سے عشق سکھاتی ہے اور آپ ا کے خلق عظیم کی بات کو ہمارے قلب و روح میں ایسے اتارتی ہے کہ ہمارے ذہن و فکر پر عشق کے معانی کھلتے جاتے ہیں۔ ہماری بصیرتوں اور بصارتوں میں رنگ، روشنی اور نور کے دروا ہوتے جاتے ہیں۔ ہمارا دامن خیرات مصطفیا سے بھر جاتا ہے اور ہم اپنے آپ کو دنیا کے بادشاہوں میں محسوس کرنے لگتے ہیں۔\n\nسہ ماہی مفیض\n(نعت تبصرہ نمبر)\n\nشمارہ ۲۷، ۲۰۰"
  },
  { "id": 93, "title": "محاسن", "description": "" },
  {
    "id": 94,
    "title": "حمدباری تعالیٰ",
    "description": "میٹھی نیند سلاتا ہے ہر روز خدا\nخود ہی مجھے جگاتا ہے ہر روز خدا\n\nاپنے سارے بھولے بھٹکے بندوں کو\nاپنی سمت بلاتا ہے ہر روز خدا\n\nمیں اس کے محبوب کی نعتیں لکھتا ہوں\nیہ تحریک دلاتا ہے ہر روز خدا\n\nمیری سوچ کی دنیا روشن رہتی ہے\nنیا خیال سمجھاتا ہے ہر روز خدا\n\nدن اور رات کی آمد کے آئینے میں\nاپنی شان دکھاتا ہے ہر روز خدا\n\nہم اس سے ہر روز بغاوت کرتے ہیں\nپھر بھی ہمیں کھلاتا ہے ہر روز خدا\n\nاس کی ہے تعریف کہ ہم سے بندوں کو\nاپنے گھر بلواتا ہے ہر روز خدا\n\nکتنے نابینا لوگوں کو دنیا میں\nسیدھی راہ دکھاتا ہے ہر روز خدا\n\nجو اس کے عرفان کی خواہش رکھتے ہیں\nان سے پیار بڑھاتا ہے ہر روز خدا\n\nحمد و نعت کے زیور سے یوں لگتا ہے\nمجھ کو خوب سجاتا ہے ہر روز خدا\n\nدل کے آنگن میں شہزادؔ محبت کی\nاک قندیل جلاتا ہے ہر روز خدا"
  },
  {
    "id": 95,
    "title": "قطعہ",
    "description": "ظلمتوں کی طرف سے نور کی سمت\nفکر کے رخ کو کس نے موڑ دیا\n\nنعت کے گلشنوں کی سیر کے بعد\nمیں نے دشت غزل کو چھوڑ دیا"
  },
  {
    "id": 96,
    "title": "حمدباری تعالیٰ",
    "description": "پتھر میں تیرے فضل نے پودے اگا دیے\nتیرے کرم کی موج نے مردے جلا دیے\n\nکیا کیا نوازشات ہیں تیری جہان پر\nبندوں پہ نعت کے خزانے لٹا دیے\n\nپھولوں ، پھلوں سے بخش دی زینت زمین کو\nمہر و مہ و نجوم فلک پر سجا دیے\n\nپیدا ہمیں حضور کی امت میں کر دیا\nسوئے ہوئے نصیب ہمارے جگا دیے\n\nطبع بشر کا ان سے تعلق ہے اس لیے\nموسم یہ سرد گرم خدا نے بنا دیے\n\nدعوت ہے غوروفکر کی تخلیق روز و شب\nقدرت کے راز ارض و سما میں چھپا دیے\n\nاہل نظر کو بخش کر اپنی رضا کا شوق\nان کو حصول قرب کے نسخے بتا دیے\n\nفتح و ظفر ہے تیرے سپاہی کے سر کا تاج\nباطل کے تیری فوج نے چھکے چھڑا دیے\n\nبخشا ہے تو نے نعت کا شہزادؔ کو ہنر\nتو نے ہی اس کو حمد کے مضمون سجھا دیے"
  },
  {
    "id": 97,
    "title": "حمدباری تعالیٰ",
    "description": "دل کو لذت آشنا کرتا ہے تو\nعاصیوں کو باصفا کرتا ہے تو\n\nتیری رحمت کی کوئی حد ہی نہیں\nنعمتیں سب کو عطا کرتا ہے تو\n\nدوستوں سے ہو گا تیرا کیا سلوک\nدشمنوں کا جب بھلا کرتا ہے تو\n\nنفس امارہ کو کر دے مطمئن\nبادِ صرصر کو صبا کرتا ہے تو\n\nایک بچے کے لیے ماں باپ کو\nپرورش کا واسطہ کرتا ہے تو\n\nاس جہاں میں بھیج کر اپنے رسول\nحق و باطل کو جدا کرتا ہے تو\n\nاللہ اللہ تیری شفقت کا کمال\nبے وفائوں سے وفا کرتا ہے تو\n\nتو فقیروں کو بنا دیتا ہے شاہ\nبادشاہوں کو گدا کرتا ہے تو\n\nاے مرے مشکل کشا میرے کریم!\nدور مجھ سے ہر بلا کرتا ہے تو\n\nمرکز امید تیری ذات ہے\nعرض سائل کی سنا کرتا ہے تو\n\nجب کجی شہزادؔ پائے نفس میں\nاس کو سیدھا اے خدا کرتا ہے تو"
  },
  {
    "id": 98,
    "title": "قطعہ",
    "description": "وقف فساد جادئہ لطف و کرم پہ چل\nخواہش کو چھوڑ سیرت شاہِ امم پہ چل\n\nنکلیں گی آپ منزلیں تیری تلاش میں\nرہرو! ذرا حضور کے نقش قدم پہ چل"
  },
  {
    "id": 99,
    "title": "نعت شریف",
    "description": "سراپا فضائل حریص’‘ علینا\nکریم الخصائل حریص’‘ علینا\n\nرئوف’‘ ، رحیم’‘ ، صبیح’‘ ، قسیم’‘\nجمیل الشمائل حریص’‘ علینا\n\nبشیر’‘ ، نذیر’‘ ، حبیب’‘ ، طبیب’‘\nمحل المسائل حریص’‘ علینا\n\nمعلم ، مبلغ ، مدبر ، منظم\nامیر القبائل حریص’‘ علینا\n\nوہ کنزالحقائق وہ خیرالخلائق\nقوی الدلائل حریص’‘ علینا\n\nنہیں ان کا ثانی دو عالم میں کوئی\nزمانہ ہے قائل حریص’‘ علینا\n\nمیں گیت ان کے شہزادؔ کیونکر نہ گائوں\nوہ داتا میں سائل حریص’‘ علینا"
  },
  {
    "id": 100,
    "title": "نعت شریف",
    "description": "ان کی مدح و ثنا کرے گا کون\nنعت کا حق ادا کرے گا کون\n\nجیسے کرتے ہیں التفات حضور\nایسے لطف و عطا کرے گا کون\n\nاقتدائے شہ ہدیٰ کے بغیر\nجستجوئے خدا کرے گا کون\n\nیوں ازل تا ابد خشیت سے\nہاتھ اٹھا کر دعا کرے گا کون\n\nان سا عادل ہوا نہ ہے کوئی\nان سا اب فیصلہ کرے گا کون\n\nسرکشوں کو کرے گا کون اسیر\nآندھیوں کو صبا کرے گا کون\n\nکون بدلے گا دل کی دنیا کو\nخار کو گل ادا کرے گا کون\n\nہم سے شہزادؔ بے سہاروں پر\nلطف ان کے سوا کرے گا کون"
  },
  {
    "id": 101,
    "title": "نعت شریف",
    "description": "کوئی ایسا کمال ہو جائے\nعام طرزِ بلال ہو جائے\n\nفکر کو روشنی ملے ایسی\nنعت میرا خیال ہو جائے\n\nنعت گوئی اگر شعار نہ ہو\nمیرا جینا محال ہو جائے\n\nہجر کی قید کاٹ لی آقا\nاب میسر وصال ہو جائے\n\nسامنے ہو حضور کا روضہ\nاور وہ لمحہ سال ہو جائے\n\nجھلملاتا ہے جو سرمژگاں\nہر ستارہ سوال ہو جائے\n\nقرب شہزادؔ گر ملے ان کا\nزندگی لازوال ہو جائے"
  },
  {
    "id": 102,
    "title": "نعت شریف",
    "description": "جمال حریم دنیٰ دیکھ آئے\nخدا کو حبیب خدا دیکھ آئے\n\nازل سے ابد تک کے سارے مناظر\nنظام جزا و سزا دیکھ آئے\n\nتجلی سے جس کی ہوا طور سرمہ\nوہ اس نور کو برملا دیکھ آئے\n\nبھلا اس کا ثانی کہاں کوئی ہوگا\nجو خود جا کے اپنا خدا دیکھ آئے\n\nجو بالا ہیں وہم و گماں کی حدوں سے\nمقامات وہ مصطفی دیکھ آئے\n\nہوئے آپ دارالفنا سے روانہ\nگھڑی بھر میں دارالبقا دیکھ آئے\n\nیہ نکتہ بھی شہزادؔ معراج میں تھا\nکہ رستے کو خود رہنما دیکھ آئے"
  },
  {
    "id": 103,
    "title": "نعت شریف",
    "description": "یوں ہے ہمارے قلب کا طیبہ سے رابطہ\nجیسے جبین عجز کا کعبہ سے رابطہ\n\nہوتا رہے حضور کی مدحت سے فیضیاب\nقائم رہے غلام کا آقا سے رابطہ\n\nدنیا رہی حضور کے زیرنگیں مگر\nرکھا نہیں حضور نے دنیا سے رابطہ\n\nظاہر میں بندگانِ خدا سے ہے بات چیت\nباطن میں اپنے مالک و مولا سے رابطہ\n\nہر دم ہوں کشت روح پر رحمت کی بارشیں\nٹوٹے نہ تشنہ کام کا دریا سے رابطہ\n\nفیض نبی سے جسم میں ہونے کے باوجود\nرکھتی ہے روح عالم بالا سے رابطہ\n\nپاتا ہوں اپنے آپ کو شہزادؔ خلد میں\nہوتا ہے جب حضور کے روضہ سے رابطہ"
  },
  {
    "id": 104,
    "title": "نعت شریف",
    "description": "قربت کا شرف دے کر تصدیق وفا کر دو\nاے سرورِ دیں مجھ کو اک نعت عطا کر دو\n\nصدیق کے صدقے میں ہو جائے کرم ایسا\nہم نفس کے ماروں کو اخلاص نما کر دو\n\nہم بھول گئے آقا! فرق ابیض و اسود کا\nظلمت کو الگ کر دو انوار جدا کر دو\n\nگردن میں رہے ہر دم ، ڈورا تیری نسبت کا\nہم درد کے ماروں کے حق میں یہ دعا کر دو\n\nدیکھے جو مجھے کوئی ، یاد آئے تری سیرت\nخیرات مجھے اپنی سیرت کی عطا کردو\n\nانوارِ محبت سے ہو جائے منور دل\nہر ایک رگ جاں کو یوں نعت سرا کر دو\n\nشہزادؔ یہ نسخہ ہے ایماں کی حفاظت کا\nسرکار کی یادوں میں سوچوں کو فنا کر دو"
  },
  {
    "id": 105,
    "title": "نعت شریف",
    "description": "اے شاہِ زمن! تیرا ہر رنگ یگانہ ہے\nہر پل تیری رحمت کا محتاج زمانہ ہے\n\nمنظر میری نظروں میں ہے صبح مدینہ کا\nکیا خوب ہیں یہ لمحے کیا وقت سہانا ہے\n\nاسرار الٰہی کا بنتا ہے وہ دل مخزن\nاس نور مجسم کا جس دل میں ٹھکانا ہے\n\nسنت میں تری آقا ہے زینت و رعنائی\nاپنا کے تری سنت کردار سجانا ہے\n\nبے مانگے اسی در سے پاتے ہیں جہاں والے\nسرکار کے دامن میں رحمت کا خزانہ ہے\n\nمقصود تھا دنیا میں شہزادؔ ظہور ان کا\nتخلیق دو عالم تو بس ایک بہانہ ہے"
  },
  {
    "id": 106,
    "title": "نعت شریف",
    "description": "سرورِ دیں رحمت کونین کی باتیں کریں\nآمنہ بی بی کے نور عین کی باتیں کریں\n\nچین ملتا ہے دلوں کو ذکر سے سرکار کے\nغم کے مارو آئو ہم سکھ چین کی باتیں کریں\n\nبادشاہوں کے سروں پر تاج ہیں جس کے طفیل\nسید سادات کے نعلین کی باتیں کریں\n\nاہل بیت مصطفی کے ذکر سے گرمائیں دل\nفاطمہ، زہرا، علی، حسنین کی باتیں کریں\n\nعرش والے جھوم اٹھتے ہیں وفور شوق سے\nفرش والے جب شہ کونین کی باتیں کریں\n\nیاد آ جاتی ہیں اس دم بنتین مصطفی\nجب بھی ہم عثمان ذوالنورین کی باتیں کریں\n\nآئو اے شہزادؔ ہم بغض و حسد کو چھوڑ کر\nہر گھڑی اس محسن دارین کی باتیں کریں"
  },
  {
    "id": 107,
    "title": "نعت شریف",
    "description": "در سے آقا کے خیرات لے کر اٹھا\nجب بھی بیٹھا میں سوغات لے کر اٹھا\n\nرات سویا جو ان کا تصور لیے\nصبح روشن خیالات لے کر اٹھا\n\nجب بھی بیٹھا تفکر کا کاسہ لیے\nان کے در سے نئی نعت لے کر اٹھا\n\nسرور دیں کو اس کی خبر ہو گئی\nدل میں جب بھی کوئی بات لے کر اٹھا\n\nپڑھتے پڑھتے لگی آنکھ صل علیٰ\nلب پہ حمد و مناجات لے کر اٹھا\n\nپھر ستایا ہے محبوب کی یاد نے\nپھر میں شوق ملاقات لے کر اٹھا\n\nبارگاہِ صحابہ میں جب بھی گیا\nجذبۂ حب سادات لے کر اٹھا\n\nدل میں شہزادؔ جتنے سوالات تھے\nدر سے ان کے جوابات لے کر اٹھا"
  },
  {
    "id": 108,
    "title": "نعت شریف",
    "description": "تیرے ہر ایک پل میں زمانہ دکھائی دے\nسارا جہان تیرا گھرانہ دکھائی دے\n\nمحو سفر ہے وقت کے ہمراہ تیری ذات\nہر ہر گھڑی میں تیرا ٹھکانہ دکھائی دے\n\nتیری ہر اک دلیل کے آگے شہ شعور!\nباطل کا ہر جواز بہانہ دکھائی دے\n\nممکن نہیں حضور کے فیضان کے بغیر\nمجھ سا ضعیف شخص توانا دکھائی دے\n\nشہزادؔ تو بھی جنت طیبہ میں کر قیام\nمنظر جہاں ہر ایک سہانا دکھائی دے"
  },
  {
    "id": 109,
    "title": "نعت شریف",
    "description": "سکون جاں ہے خیال تیرا\nنظر کی ٹھنڈک جمال تیرا\n\nتو میرے دل کا مکیں ہے لیکن\nمیں پھر بھی چاہوں وصال تیرا\n\nجو تو نے رخ سے نقاب اٹھایا\nسہوں گا کیسے جلال تیرا\n\nکنیز تیری ہر ایک ساعت\nغلام ہر ایک سال تیرا\n\nاے وجہ تحریک نبض ہستی\nہر اک عمل بے مثال تیرا\n\nنہ کیوں ہو مقبول قدسیوں میں\nغلام جو ہے بلال تیرا\n\nتری حقیقت خدا ہی جانے\nخدا ہی جانے کمال تیرا\n\nرگوں میں شہزادؔ کی رواں ہے\nلہو کے ہمرہ خیال تیرا"
  },
  {
    "id": 110,
    "title": "نعت شریف",
    "description": "تسکین دل خستہ دلاں رحمت عالم\nہے نام ترا راحت جاں رحمت عالم\n\nلاریب ترے لطف کا انداز ہے یہ بھی\nآنکھوں سے جو ہیں اشک رواں رحمت عالم\n\nدنیا میں ترا شہر ہے بس جس میں ہمیشہ\nہوتا ہے دل افروز سماں رحمت عالم\n\nحرکت میں ترے لطف سے ہے نبض زمانہ\nقائم ہے ترے دم سے جہاں رحمت عالم\n\nکرتی ہے ترے لطف مسلسل پہ دلالت\nموجودگیٔ کون و مکاں رحمت عالم\n\nہر پھول ہے تازہ ترے گلزار کا اب تک\nتیرا ہے ہر اک نقش جواں رحمت عالم\n\nاللہ رے یہ لطف و کرم ، بندہ نوازی\nہے عبد سے معبود عیاں رحمت عالم\n\nمحور ہے تری ذات مرے فکر و سخن کا\nہے نعت تری میرا نشاں رحمت عالم\n\nمحتاج ہے شہزادؔ تری چشم کرم کا\nاے سرور دیں! شاہِ شہاں رحمت عالم"
  },
  {
    "id": 111,
    "title": "نعت شریف",
    "description": "فرش تا عرش ہے جو حسن و جمال اچھا ہے\nسب خیالوں سے محمد کا خیال اچھا ہے\n\nہجر لاحق ہو تو لیتے ہیں مزہ دوری کا\nقرب حاصل ہو تو کہتے ہیں وصال اچھا ہے\n\nیادِ سرکار میں جو رہتا ہے دل پر طاری\nساری خوشیوں سے وہی حزن و ملال اچھا ہے\n\nگلشن جاں میں مہکتے ہیں در و دوں کے گلاب\nاس لیے مجھ سے گنہگار کا حال اچھا ہے\n\nفیض سے جس کی فصاحت نے تعارف پایا\nوہ شہ اہل سخن، شیریں مقال اچھا ہے\n\nان کی آمد سے ہلے قیصر و کسریٰ کے مکاں\nدبدبہ، رعب یہ ہیبت یہ جلال اچھا ہے\n\nجس کے اسہد کو ہے اشہد پہ تفوق حاصل\nسارے اصحاب میں کیا نطق بلال اچھا ہے\n\nشہر طیبہ کی فضائوں میں جو ہو جائے بسر\nوہ مہینہ، وہی ہفتہ، وہی سال اچھا ہے\n\nآپ سے آپ کو شہزادؔ نے مانگا آقا\nسائل اچھا نہیں سائل کا سوال اچھا ہے"
  },
  {
    "id": 112,
    "title": "نعت شریف",
    "description": "محمد کا در ہے دعا مانگ لوں میں\nسماں پُراَثر ہے دعا مانگ لوں میں\n\nملے گا یہیں سے سکونِ دل و جاں\nسخاوت کا گھر ہے دعا مانگ لوں میں\n\nلگا دیں گے مہر اجابت وہ خود ہی\nیہ طیبہ نگر ہے دعا مانگ لوں میں\n\nملا تو ہے وقت زیارت و لیکن\nبڑا مختصر ہے دعا مانگ لوں میں\n\nہے رقت سی طاری دل مضطرب پر\nمری آنکھ تر ہے دعا مانگ لوں میں\n\nمدینہ سے رخصت ہوا چاہتا ہوں\nسفر پھر سفر ہے دعا مانگ لوں میں\n\nمری سانس لے لے فضائوں کے بوسے\nگھڑی بھر اگر ہے دعا مانگ لوں میں\n\nتصور میں شہزادؔ ہے ان کا روضہ\nیہ ان کی نظر ہے دعا مانگ لوں میں"
  },
  {
    "id": 113,
    "title": "نعت شریف",
    "description": "قافلہ زائروں کی راہ میں ہے\nسبز گنبد مری نگاہ میں ہے\n\nذہن فارغ ہے فکر دنیا سے\nسوچ تک بھی تری پناہ میں ہے\n\nفیض ہے تاجدار بطحا کا\nیہ جو تاثیر میری آہ میں ہے\n\nآشنائی غموں سے تیرے لیے\nآبلہ پائی تیری چاہ میں ہے\n\nناز کرتے ہیں اس پہ کون و مکاں\nجو بھی شامل تری سپاہ میں ہے\n\nمسجد و خانقاہ میں بھی نہیں\nلطف جو تیری بارگاہ میں ہے\n\nنعت سرور کی روشنی کے سوا\nاور کیا دفتر سیاہ میں ہے\n\nخوبیاں ان پہ ختم ہیں شہزادؔ\nوصف ہر ایک ذات شاہ میں ہے"
  },
  {
    "id": 114,
    "title": "نعت شریف",
    "description": "جن و انسان و ملائک کا وظیفہ نعت ہے\nسرورِ دیں تک رسائی کا وسیلہ نعت ہے\n\nامتی کے لب پہ رہنی چاہیے مدح رسول\nمذہب عشاق میں پہلا فریضہ نعت ہے\n\nراحت قلب و نظر ، تسکین جاں کے واسطے\nکاملوں کا آزمودہ خاص نسخہ نعت ہے\n\nحج ہو میقات ہو زم زم کہ تلبیہ و رمی\nمیرا مزدلفہ، منیٰ، صفا و مروہ نعت ہے\n\nخوش نصیبی سے ملا کرتی ہیں ایسی نعمتیں\nورثۂ اہل نظر رب کا عطیہ نعت ہے\n\nکشت قلب و جاں ہوئی سیراب جس کے فیض سے\nآب کوثر کا وہ ٹھنڈا میٹھا چشمہ نعت ہے\n\nہر گھڑی شہزادؔ میری سوچ ہے محو طواف\nمیرے فکر و فن کا قبلہ اور کعبہ نعت ہے"
  },
  {
    "id": 115,
    "title": "نعت شریف",
    "description": "حد محسوسات سے آگے لطافت آپ کی\nقدسیوں میں بھی مروج ہے ثقافت آپ کی\n\nآپ ہی پر ختم ہیں سب خوبیاں بعد از خدا\nسب رسولوں میں مسلم ہے امامت آپ کی\n\nدیکھتے ہیں سوئے طیبہ مشرقین و مغربین\nمانتے ہیں عرش والے بھی قیادت آپ کی\n\nآپ کی تعلیم غالب ساری تعلیمات پر\nپتھروں پر بھی موثر ہے خطابت آپ کی\n\nدست بستہ سارا عالم ہے کھڑا دربار میں\nجلسۂ کونین میں آقا! صدارت آپ کی\n\nہم سیہ کاروں کی بخشش کا وسیلہ ہے فقط\nحشر کے دن یارسول اللہ! شفاعت آپ کی\n\nآپ ہی کی پیروی میں ہے فلاح دوجہاں\nحق تعالیٰ کی اطاعت ہے اطاعت آپ کی\n\nکیجیے امداد میری اہل باطل کے خلاف\nاہل حق کے ساتھ ہوتی ہے حمایت آپ کی\n\nمیں رہا ہو جائوں زندان رواج و رسم سے\nاپنے ہر انداز میں پائوں شباہت آپ کی\n\nبے بسی شہزادؔ کی فریاد کرتی ہے حضور\nبے کسوں پر رحم فرمانا ہے عادت آپ کی"
  },
  {
    "id": 116,
    "title": "قطعہ",
    "description": "غریق بحر عصیاں پر نگاہِ التفات آقا\nمری  مضطر  خیالی کو  عطا  کیجے ثبات آقا\n\nمجھے ملتی رہے مدحت کی کرنوں سے توانائی\nرہے سر سبز بس یونہی مری شاخ حیات آقا"
  },
  {
    "id": 117,
    "title": "نعت شریف",
    "description": "شان محبوب خدا ہے منفرد\nمصطفی کی ہر ادا ہے منفرد\n\nمنفرد ہیں سرورِ کونین بھی\nاور ان کا ہر گدا ہے منفرد\n\nگلستان عشق کے نغمات میں\nنغمہ صل علیٰ ہے منفرد\n\nمانگنا سرکار سے سرکار کو\nسب دعائوں میں دعا ہے منفرد\n\nسر جھکایا اور طیبہ میں گئے\nعاشقوں کا راستہ ہے منفرد\n\nحضرت صدیق اکبر کے طفیل\nنقشبندی سلسلہ ہے منفرد\n\nباغ جنت میں بھی ہے تسکیں مگر\nشہر طیبہ کی فضا ہے منفرد\n\nظرف سے بڑھ کر بھی کرتے ہیں عطا\nآپ کا جود و سخا ہے منفرد\n\nانبیاء شہزادؔ سب ہیں باکمال\nسب میں ذات مصطفی ہے منفرد"
  },
  {
    "id": 118,
    "title": "نعت شریف",
    "description": "خالق انوار کی تخلیق پتلا نور کا\nآ گیا شکل بشر میں وہ سراپا نور کا\n\nعرش والے رشک کرتے ہیں یہ منظر دیکھ کر\nآدمی کے سر پہ رکھا حق نے سہرا نور کا\n\nنعت کے ہر شعر میں پنہاں ہے ایسی روشنی\nجیسے شاخ جاں پہ پھوٹا ہو شگوفہ نور کا\n\nمہر و مہ میں ہے شہ کونین کے رخ کی ضیاء\nنور کو خیرات دیتا ہے یہ چہرہ نور کا\n\nنور کے اصحاب اہلبیت اور ازواج نور\nنور ہی کے ساتھ ہو سکتا ہے رشتہ نور کا\n\nکہکشائیں گم ہیں شہر نور کے ذرات میں\nبھیک لیتا ہے انہیں سے ہر ستارہ نور کا\n\nظلمتوں کو کر دیا ہے روشنی سے آشنا\nآدمی کو آپ نے بخشا ہے تحفہ نور کا\n\nنقش پائے مصطفی ہے منزل اہل نظر\nسیرت سرکار ہے دراصل رستہ نور کا\n\nنعت لکھتا نور کے الفاظ سے شہزادؔ میں\nکاش میرے پاس ہوتا کوئی خامہ نور کا"
  },
  {
    "id": 119,
    "title": "نعت شریف",
    "description": "جب ارادہ ثنا کا کرتا ہوں\nحرف لکھتے ہوئے میں ڈرتا ہوں\n\nان کی خدمت میں پیش کرنے کو\nاپنے دامن میں اشک بھرتا ہوں\n\nیاد خلوت میں کرکے آقا کو\nجانے کس کیف سے گزرتا ہوں\n\nمیری جانب ہے ایک پاک نگاہ\nاس لیے ہی تو میں سنورتا ہوں\n\nذکر سرکار کی یہ برکت ہے\nمیں خزاں رت میں جو نکھرتا ہوں\n\nکشتیٔ نعت کا سوار ہوں میں\nدیکھیے پار کب اترتا ہوں"
  },
  {
    "id": 120,
    "title": "نعت شریف",
    "description": "کون جانے یہ کیسی نعمت ہے\nنعت میں اک عجیب لذت ہے\n\nبات کرتا ہوں اس طرح ان کی\nجیسے حاصل مجھے وہ صحبت ہے\n\nذکر سرکار جا بجا کرنا!\nعشق والوں کی یہ تو عادت ہے\n\nشہر طیبہ کو سوچتے رہنا\nمستقل یہ میری عبادت ہے\n\nیاد کر کے حضور کو رونا!\nقرب سرکار کی علامت ہے\n\nسبز گنبد کی تابناک شعاع\nزندگی کے لیے غنیمت ہے\n\nآپ مالک ہیں آپ ہی جانیں\nہم غلاموں کی کتنی قیمت ہے\n\nعاصیوں کے لیے پیام سکوں\nشافع حشر کی شفاعت ہے\n\nدیکھتے ہیں رخ رسول کریم\nاللہ والوں کو یہ سہولت ہے\n\nخوف شہزادؔ موت سے کیسا\nیہ تو میرے نبی کی سنت ہے"
  },
  {
    "id": 121,
    "title": "قطعہ",
    "description": "آ گئے کونین کے سرتاج غارِ ثور میں\nنعمت عظمیٰ بٹے گی آج غار ثور میں\n\nتین دن اور تین راتیں ساتھ خلوت میں رہے\nہو گئی صدیق کی معراج غار ثور میں"
  },
  {
    "id": 122,
    "title": "نعت شریف",
    "description": "رواں ہوں سوئے زوال آقا\nمیں گر رہا ہوں سنبھال آقا\n\nمیں ناقصوں میں مثال آقا\nتو کاملوں میں کمال آقا\n\nتری ثنا کی تجلیوں سے\nچمک رہا ہے خیال آقا\n\nفنا کے منصب پہ کر کے فائز\nبھلا دے قیل و مقال آقا\n\nہوئے ہیں تخلیق تیری خاطر\nیہ روز و شب ، ماہ و سال آقا\n\nازل سے شہزادؔ تشنہ لب ہے\nپلا دے جام وصال آقا"
  },
  {
    "id": 123,
    "title": "نعت شریف",
    "description": "شانِ پروردگار کے صدقے\nمصطفائی وقار کے صدقے\n\nہجر میں آپ کے جو ہو بے چین\nاس دل بے قرار کے صدقے\n\nجس کے باعث ہے اہتمام سجود\nاس تہجد شعار کے صدقے\n\nراہ حق کے ہر اک شہید کا خون\nبدر کے شہسوار کے صدقے\n\nشرق تا غرب جس کی شاہی ہے\nاس شہ انکسار کے صدقے\n\nسنت مصطفی پہ جان نثار\nاسوئہ پائدار کے صدقے\n\nآپ کے نقش پا پہ ہم قربان\nآپ کی رہگزار کے صدقے\n\nان سے شہزادؔ جس کو نسبت ہے\nایسی ہر یادگار کے صدقے"
  },
  {
    "id": 124,
    "title": "نعت شریف",
    "description": "مصطفی کا دیار دیکھیں گے\nگلشن پر بہار دیکھیں گے\n\nحسن کا شاہکار دیکھیں گے\nروضۂ پروقار دیکھیں گے\n\nسرورِ دیں کی بارگاہ میں ہم\nدل کو ہوتے نثار دیکھیں گے\n\nروبرو ان کے ہم جھکا کر سر\nشانِ پروردگار دیکھیں گے\n\nحکمرانی دلوں پہ ہے جس کی\nہم بھی وہ تاجدار دیکھیں گے\n\nسبز گنبد کا دلنشیں منظر\nجھوم کر بار بار دیکھیں گے\n\nہم پہنچ کر فضائے طیبہ میں\nہر سو بے اختیار دیکھیں گے\n\nوادیٔ لذت و سکون میں ہم\nنور کی آبشار دیکھیں گے\n\nمسجد خاتم الرسل کی طرف\nہم تو دیوانہ وار دیکھیں گے\n\nاذن شہزادؔ گر ملا ہم کو\nجا کے پردے کے پار دیکھیں گے"
  },
  {
    "id": 125,
    "title": "نعت شریف",
    "description": "دنیا جو چاہے اس کو خدائی نصیب ہو\nمجھ کو درِ نبی کی گدائی نصیب ہو\n\nمدت سے ہوں حضور میں اپنی تلاش میں\nمجھ تک مجھے بھی اب تو رسائی نصیب ہو\n\nرائی کی مثل ہاتھ پہ پائوں جہان کو\nقلب و نظر کو ایسی صفائی نصیب ہو\n\nسوتے ہوئے تو اور بھی ہوتے ہیں فیضیاب\nبیداریوں میں جلوہ نمائی نصیب ہو\n\nاس پر نثار خلد کی رنگینیاں تمام\nجس کو نبی کی مدح سرائی نصیب ہو\n\nدامن رسول پاک کا چھوٹے نہ ہاتھ سے\nچاہے جہان بھر سے جدائی نصیب ہو\n\nشہزادؔ کچھ ہو سنت سرکار کے بغیر\nممکن نہیں کہ ہم کو بھلائی نصیب ہو"
  },
  {
    "id": 126,
    "title": "نعت شریف",
    "description": "شہر طیبہ میں نظر آئے در و دیوار مست\nقربت سرکار سے ہیں گنبد و مینار مست\n\nلوگ چاہے کچھ کریں میرے جنوں پر تبصرہ\nمیں ہوں یادِ مصطفی میں برسر بازار مست\n\nشہر طیبہ کی فضائوں میں کچھ ایسا ہے اثر\nجائے جتنی بار کوئی ہو گا اتنی بار مست\n\nخرقہ پوشان حرم کا وجد تو جو ہے سو ہے\nاس جگہ دیکھے ہیں اہل جبہ و دستار مست\n\nروح میری مائل پرواز ہے سوئے حجاز\nفرطِ راحت سے ہوا ہے ، طائر رفتار مست\n\nاللہ اللہ ان کی آمد سوئے گلشن دیکھئے\nجھومتے ہیں لالہ و گل سرو قد گلزار مست\n\nپھر رہا ہے ان کی الفت میں فلک دیوانہ وار\nان کی چاہت میں زمیں، پتھر، ثمر، اشجار مست\n\nدیکھ لیتا ہے مجھے جو مست ہو جاتا ہے وہ\nآپ نے اس درجہ مجھ کو کر دیا سرکار مست\n\nآپ کی آمد سے آ جائے دل و جاں کو قرار\nآپ کی برکت سے ہو جائے مرا گھر بار مست\n\nگہ جلالی گہ جمالی نور کی برسات ہے\nجالیوں گے گرد آتے ہیں نظر انوار مست\n\nدر حقیقت عشق میں سرکار کے سچا ہے وہ\nسن کے ان کا نام نامی جو ہوا ہر بار مست\n\nنعت ہی شہزادؔ ساری مستیوں میں ڈھل گئی\nفیض تذکار نبی سے ہیں سبھی اشعار مست"
  },
  {
    "id": 127,
    "title": "نعت شریف",
    "description": "ب بسم اللہ میم محمد ا\nآدم کی تکریم محمد ا\n\nخالق کے عرفان کا باعث، تنزیل قرآن کا باعث\nوجہ ہفت اقلیم محمد ا\n\nتیرے صدقے قلب مصفّٰی، روح منور، نفس مزکی\nصدق تری تعلیم محمد ا\n\nاللہ اللہ تیری عظمت تیری حرمت تیری رفعت\nسب نے کی تسلیم محمد ا\n\nسرکش تیری جانب مائل ، کفر تری تاثیر سے گھائل\nتیرا خلق عظیم محمد ا\n\nجن و انس ملائک سارے روشن سورج چاند ستارے\nتیری ہے تنظیم محمد ا\n\nتیرا عشق ایمان کی جاں ہے تیری عظمت روح جہان ہے\nدین تیری تعظیم محمد ا\n\nاب میرے حالات ہیں ایسے ظلمت نور کو ڈھونڈے جیسے\nکھول در تفہیم محمد ا\n\nسنتا ہے فریاد خدا ہی دیتا ہے شہزادؔ خدا ہی\nکرتے ہیں تقسیم محمد ا"
  },
  {
    "id": 128,
    "title": "نعت شریف",
    "description": "سر کی آنکھوں سے شانِ خدا دیکھئے\nچشم دل سے رخ مصطفی دیکھئے\n\nکیجئے مانگنے کا ارادہ ادھر\nپھر ادھر سے عطا پر عطا دیکھئے\n\nجس نے مانگا اسے رشک حاتم کیا\nشاہ طیبہ کا جود و سخا دیکھئے\n\nبھول جائیں گے جتنے حسیں عکس ہیں\nسبز گنبد کا منظر ذرا دیکھئے\n\nمیرے آقا کی رفتار کو دیکھ کر\nاک طرف ہٹ گیا راستہ دیکھئے\n\nعقل کی انتہا دیکھنے کے لیے\nسیر معراج کی ابتدا دیکھئے\n\nدشمنوں کے لیے بھی سراپا کرم\nشفقت خاتم الانبیاء دیکھئے\n\nشہر سرکار میں ایسی تاثیر ہے\nبے وفا کر رہے ہیں وفا دیکھئے\n\nآفتاب رسالت کے انوار سے\nبجھ گیا کفر کا ہر دیا دیکھئے\n\nبارگاہِ نبی میں عجب کیف ہے\nہو رہے ہیں ملائک فدا دیکھئے\n\nجس کی تعظیم شہزادؔ ایمان ہے\nکر کے اس ذات سے رابطہ دیکھئے"
  },
  {
    "id": 129,
    "title": "نعت شریف",
    "description": "میں ، مری سوچیں، جوانی اور نعت\nپاک جذبوں کی گرانی اور نعت\n\nفکر و فن کی پاسبانی اور نعت\nرحمتوں کی میزبانی اور نعت\n\nسوچتا ہوں کس طرح یکجا ہوئے\nباد ، مٹی، آگ ، پانی اور نعت\n\nساتھ دیتی ہیں یہ کب تک دیکھئے\nمیری سانسیں، عمر فانی اور نعت\n\nایک ہی تصویر کے دو رُخ ہیں یہ\nمیرے بچپن کی کہانی اور نعت\n\nاک طرف ساحل پہ میں اور اک طرف\nریت ، موجوں کی روانی اور نعت\n\nہو گئے شہزادؔ لمحے یادگار!\nآنکھ پرنم ، شب سہانی اور نعت"
  },
  {
    "id": 130,
    "title": "نعت شریف",
    "description": "جب سے دل ان کا مستقر ٹھہرا\nگفتگو میں مری اثر ٹھہرا\n\nکھل گیا اس پہ راز صبح حیات\nجو مدینے میں رات بھر ٹھہرا\n\nنسبت فخر انبیاء کے طفیل\nمیں زمانے میں معتبر ٹھہرا\n\nمیری معراج ہوگئی جب سے\nان کے نقش قدم پہ سر ٹھہرا\n\nجونہی پہنچا ریاض طیبہ میں\nخشک پتہ ہرا شجر ٹھہرا\n\nراستہ گو طویل تھا لیکن\nمیری منزل انہیں کا در ٹھہرا\n\nنقش پائے حضور پہ چل کر\nآدمی رب سے باخبر ٹھہرا\n\nسر پہ ہے نقش نعل سرور دیں\nمیں بھی شہزادؔ تاجور ٹھہرا"
  },
  {
    "id": 131,
    "title": "نعت شریف",
    "description": "ہے ایک مدت سے یہ تمنا\nکہ مطلعٔ جاں پہ نام تیرا\n\nہمیشہ سورج کی مثل چمکے\nجو میری ہستی میں کج روی ہے\n\nجو کم نگاہی ہے بے حسی ہے\nجو ضعف ارادوں میں رچ چکا ہے\n\nجو نفس میں سرکشی ہے میرے\nہیں خواہشوں کے پہاڑ اندر\n\nیہ لمحے لمحے کی بے یقینی\nکہ میری رگ رگ میں بس چکی ہے\n\nکچھ ایسی چشم کرم ہو آقا\nکچھ ایسا بدلے نظام باطن\n\nکہ استقامت کی ایک زندہ\nمثال بن جائوں میں جہاں میں"
  },
  {
    "id": 132,
    "title": "نعت شریف",
    "description": "رشک خوبی مری خطا ہو جائے\nنعت تازہ اگر عطا ہو جائے\n\nگفتگو کر رہی ہو خاموشی!\nاشک آئینۂ دعا ہو جائے\n\nایسی روحانیت عطا ہو حضور\nمجھ سے نفسانیت جدا ہو جائے\n\nجب بھی پڑھتا ہوں میں درود و سلام\nساتھ شامل مرے خدا ہو جائے\n\nنعت لکھنے کو بیٹھ جاتا ہوں\nضبط کی جب بھی انتہا ہو جائے\n\nمصطفی سے رہوں میں وابستہ\nزندگی پیکر وفا ہو جائے\n\nیہ بھی ان کے کرم سے ممکن ہے\nمجھ سے مدحت کا حق ادا ہو جائے\n\nتذکرہ جب ہو شاہِ بطحا کا\nہر نفس شامل ثنا ہو جائے\n\nہر عمل میں چمک دمک ہو تری\nدل کا آئینہ حق نما ہو جائے\n\nمیرا ہر ہر قدم ہو تیرے لیے\nہر عمل میرا بے ریا ہو جائے\n\nاس کو حاجت نہیں کوئی رہتی\nجو بھی سرکار کا گدا ہو جائے\n\nروح آلائشوں سے پاک رہے\nذات میری بھی باصفا ہو جائے\n\nآپ کی قید میں رہے یہ غلام\nاور ہر قید سے رہا ہو جائے\n\nکاش شہزادؔ کا ہر ایک خیال\nآپ کی ذات میں فنا ہو جائے"
  },
  {
    "id": 133,
    "title": "نعت شریف",
    "description": "دن ہو یا رات ہو ہی جاتی ہے\nروز اک نعت ہو ہی جاتی ہے\n\nبات مجھ سے کوئی کرے نہ کرے\nان سے تو بات ہو ہی جاتی ہے\n\nجب بھی پڑھتے ہیں ہم درود و سلام\nمدح سادات ہو ہی جاتی ہے\n\nسامنے جب بھی کوئی مشکل ہو\nساتھ وہ ذات ہو ہی جاتی ہے\n\nان کی خدمت میں پیش کرنے کو\nکوئی سوغات ہو ہی جاتی ہے\n\nسرور دیں کی اک توجہ سے\nنفس کو مات ہو ہی جاتی ہے\n\nسنت مصطفی سے پیار تو ہو\nترک عادات ہو ہی جاتی ہے\n\nجتنا شہزادؔ ظرف ہے میرا\nاتنی خیرات ہو ہی جاتی ہے"
  },
  {
    "id": 134,
    "title": "نعت شریف",
    "description": "میرے فکر و شعور کی دنیا\nبن گئی رنگ و نور کی دنیا\n\nفیض مدحت سے ہے جہان دل\nاطمینان و سرور کی دنیا\n\nآئو جھک جائیں ان کی چوکھٹ پر\nچھوڑ کر یہ غرور کی دنیا\n\nآسمان و زمین کے اندر\nہے نرالی حضور کی دنیا\n\nان کے صدقے کلیم اور کلام\nان کے صدقے ہے طور کی دنیا\n\nسایۂ رحمت دو عالم میں\nہے وحوش و طیور کی دنیا\n\nخادم ان کے ملائکہ شہزادؔ\nان کے تابع ہے حور کی دنیا"
  },
  {
    "id": 135,
    "title": "نعت شریف",
    "description": "احاطہ ہو نہیں سکتا کمالات محمد کا\nشناسا کیا کوئی ہو گا مقامات محمد کا\n\nاجابت منتظر رہتی تھی استقبال کی خاطر\nخدا سے پوچھئے رتبہ مناجات محمد کا\n\nدرود پاک سے ہوتی ہے باطن کی صفائی بھی\nذریعہ بھی یہ اچھا ہے ملاقات محمد کا\n\nہنر کیا کیا عطا فرما دیے ہم سے نکموں کو\nبیاں ہو ہی نہیں سکتا عنایات محمد کا\n\nمیرے لب پہ رہیں ہر دم رسول پاک کی باتیں\nرہوں راوی خدایا میں روایات محمد کا\n\nقلم میرا لکھے تو بس نبی کی نعت ہی لکھے\nمرے شعروں میں ہو چرچا حکایات محمد کا\n\nکسی کو ہو اگر دعویٰ فصاحت اور بلاغت کا\nتو وہ لے کر جواب آئے سوالات محمد کا\n\nسواری پر ہے خادم اور آقا پاپیادہ ہیں\nیہ اک روشن نمونہ ہے مساوات محمد کا\n\nمیں ہوں شہزادؔ وصاف النبی اللہ کی رحمت سے\nمرا ہر شعر مظہر ہے ، فیوضات محمد کا"
  },
  {
    "id": 136,
    "title": "نعت شریف",
    "description": "جس کی لغت سے لفظ مدینہ نکل گیا\nجنت کا اس کے ہاتھ سے زینہ نکل گیا\n\nعشق نبی میں ذرہ برابر جو ہو کمی!\nسمجھو کہ زندگی سے قرینہ نکل گیا\n\nخوشبو رچی جو قلب میں حب رسول کی\nسارا دل و نگاہ سے کینہ نکل گیا\n\nکر ہی نہ پائے خلد مدینہ میں اعتکاف\nایسے ہی رحمتوں کا مہینہ نکل گیا\n\nشہر رسول پاک کے ذروں کو دیکھ کر\nدل سے مرے خیال نگینہ نکل گیا\n\nساحل پہ رہ گیا میں اکیلا بچشم نم\nلے کر سواریوں کو سفینہ نکل گیا\n\nاتنے گناہ دھل گئے شہزادؔ جسم سے\nشہر نبی میں جتنا پسینہ نکل گیا"
  },
  {
    "id": 137,
    "title": "نعت شریف",
    "description": "بلبل باغ خلد ہے نغمہ سرائے مصطفی\nحور و ملک ہیں عرش پر محو ثنائے مصطفی\n\nحق کی رضا وہ پا گیا بگڑی ہوئی بنا گیا\nفضل خدا سے مل گئی جس کو ر ضائے مصطفی\n\nدامن نبی کا تھام کر مست کچھ ایسا ہو گیا\nعالم سے بے نیاز ہے دیکھو گدائے مصطفی\n\nایک طرف ہے مستجاب، دوسری سمت ہے مجیب\nشان قبولیت لیے نکلی دعائے مصطفی\n\nظلمت کفر و شرک سے بچ کر رہیں گے بس وہی\nجن کے دلوں میں جاگزیں ہوگی ولائے مصطفی\n\nفتنوں کا زور و شور ہے چاروں طرف جہان میں\nآئو پناہ ڈھونڈ لیں زیر ردائے مصطفی\n\nدر پہ رسول پاک کے دامن بھی تنگ پڑ گئے\nاور رہا عروج پر جود و سخائے مصطفی\n\nنعت نبی کا فیض ہے شعر و سخن کی روشنی\nمیرا کمال کچھ نہیں یہ ہے عطائے مصطفی"
  },
  {
    "id": 138,
    "title": "نعت شریف",
    "description": "کتنی عظیم سرور عالم ہے تیری ذات\nروشن ہے تیرے نور سے ہر دم یہ کائنات\n\nدونوں جہاں ہیں سیرت اطہر سے مستنیر\nدریا ہے رنگ و نور کا آقا تری حیات\n\nتیرا کرم کنارے لگاتا ہے کشتیاں\nتیری نگاہ لطف سے ٹلتی ہیں مشکلات\n\nجن و بشر ، ملائکہ رکھتے ہیں احتیاج\nپاتے ہیں فیض شہر مدینہ سے شش جہات\n\nروشن ہے ان کی یاد سے میرا ہر ایک دن\nتاباں ہے نور نعت سے میری ہر ایک رات\n\nبزم خیال یونہی ابد تک سجی رہے\nطاری رہیں ہر آن حضوری کی کیفیات\n\nمرنے کے بعد زندگی دیتا ہے تیرا عشق\nفانی جہاں میں تیری محبت کو ہے ثبات\n\nجن کے اثر سے آئینہ دل کا چمک اٹھے\nباطن پہ میرے ڈال دو ایسی تجلیات\n\nدامن شفیع حشر کا شہزادؔ تھام لیں\nحسن عمل کے زور پہ ممکن نہیں نجات"
  },
  {
    "id": 139,
    "title": "نعت شریف",
    "description": "خوشبو جمال نور نشانی حضور کی\nہر اک ادائے پاک سہانی حضور کی\n\nحرفوں میں ہے مٹھاس اور باتوں میں چاشنی\nاللہ رے گفتگو میں روانی حضور کی\n\nبھولی نہیں ہے وادیٔ بطحا کو آج تک\nحق کے لیے وہ شعلہ بیانی حضور کی\n\nایسا مقام دے دیا اپنے حبیب کو\nکی ہے خدا نے بات زبانی حضور کی\n\nسارا حرم ہے سرور عالم سے مستفید\nکرتا ہے یاد رکن یمانی حضور کی\n\nمانند عندلیب ، ریاض رسول میں\nکرتا رہوں میں زمزمہ خوانی حضور کی\n\nاس کی ہر ایک بات میں ہوتی ہیں حکمتیں\nجس نے ہر ایک بات ہے مانی حضور کی\n\nحج کا سفر نصیب میں شہزادؔ گر ہوا\nکعبہ سے ہم سنیں گے کہانی حضور کی"
  },
  {
    "id": 140,
    "title": "نعت شریف",
    "description": "جلوہ فرما ہوں خیرالبشر خواب میں\nعمر ہو جائے ساری بسر خواب میں\n\nسامنے آنکھ کے ہو رخ مصطفی\nدیکھ لوں میں دعا کا اثر خواب میں\n\nشہر طیبہ میں ہو جائے یوں حاضری\nدیں دکھائی وہ دیوار و در خواب میں\n\nسبز گنبد کی چھائوں میں بیٹھا رہوں\nان کی چوکھٹ پہ ہو میرا سر خواب میں\n\nروضۂ پاک کی جالیاں چوم لوں\nہو میسر مجھے یہ اگر خواب میں\n\nچومتی تھی جو نعلین سرکار کو\nدیکھ لیں ہم بھی وہ رہگزر خواب میں\n\nآنے والے ہیں شاید زیارت کے دن\nخود کو دیکھا ہے باچشم تر خواب میں\n\nمجھ کو نسبت ریاض مدینہ سے ہے\nدیکھتا ہوں میں برگ و شجر خواب میں\n\nشاہِ طیبہ کی شہزادؔ قربت ملے\nآہ و زاری کا پائوں ثمر خواب میں"
  },
  {
    "id": 141,
    "title": "نعت شریف",
    "description": "دل سے آلودگی کو صاف کریں\nآئو طیبہ میں اعتکاف کریں\n\nرات بھر ہو مراقبہ میں بسر\nدن میں کعبے کا ہم طواف کریں\n\nان کی سیرت سے فیض لے لے کر\nنت نئے روز انکشاف کریں\n\nلاتعلق ہیں حسن فطرت سے\nجو شہ دیں سے اختلاف کریں\n\nپیروی میں رسول اکرم کی\nدشمن جاں کو ہم معاف کریں\n\nروح سے دور ہر کثافت ہو\nنعت کو روح کا غلاف کریں\n\nعشق شہزادؔ خام ہے ان کا\nکام سنت کے جو خلاف کریں"
  },
  {
    "id": 142,
    "title": "نعت شریف",
    "description": "در سے نبی کے دولت گفتار مل گئی\nمجھ ناتواں کو قدرت اظہار مل گئی\n\nبخشش گلے لگائے گی اس خوش نصیب کو\nمحشر میں جس کو قربت سرکار مل گئی\n\nکرتے ہیں بادشاہ بھی اس کی گداگری\nجس بے نوا کو دولت دیدار مل گئی\n\nاس پاک باز روح کی عظمت نہ پوچھئے\nجس روح کو حضوریٔ دربار مل گئی\n\nمیں بھی لکھوں گا مدحت محبوب کبریا\nشہزادؔ جب لطافت افکار مل گئی"
  },
  {
    "id": 143,
    "title": "نعت شریف",
    "description": "بیٹھے بیٹھے جو ان کی یاد آئی\nظلمت جاں نے روشنی پائی\n\nعارض شام سرخ ہے ان سے\nان سے چشم سحر میں بینائی\n\nسبز گنبد میں ہے عجیب کشش\nجس کو دیکھا ہے اس کا شیدائی\n\nنقرئی جالیاں وہ روضے کی\nدے رہی ہیں نظر کو رعنائی\n\nزیر سایہ ہیں سبز گنبد کے\nکتنے خوش بخت ہیں یہ صحرائی\n\nمسئلہ کوئی مسئلہ نہ رہا\nآپ نے جب نگاہ فرمائی\n\nنعت اتری جو خلوت جاں میں\nساتھ پیغام جانفزا لائی\n\nموت کو زندگی بنا ڈالا\nاللہ اللہ یہ مسیحائی\n\nمجھ گنہگار کے لیے شہزادؔ\nنعت کتنی بشارتیں لائی"
  },
  {
    "id": 144,
    "title": "نعت شریف",
    "description": "لے کے رحمت شہ ابرار چلے آتے ہیں\nدیکھئے دیکھئے سرکار چلے آتے ہیں\n\nظلمت جاں کے لیے نور کا ساماں بن کر\nوہ مرے پیکر انوار چلے آتے ہیں\n\nبیٹھ جاتا ہوں لیے سوچ کا خالی کاسہ\nغیب سے نعت کے اشعار چلے آتے ہیں\n\nشدت غم سے نہ گھبرائو اے غم کے مارو\nاک ذرا صبر کہ غم خوار چلے آتے ہیں\n\nدیکھنے شان شفاعت کا حسیں نظارہ\nجوق در جوق گنہگار چلے آتے ہیں\n\nجن و انسان و ملک جن کے مطیع و تابع\nساری مخلوق کے سردار چلے آتے ہیں\n\nزور جب بڑھنے لگے وقت کے فرعونوں کا\nمصطفی بن کے مددگار چلے آتے ہیں\n\nروضۂ پاک پہ بے سمجھے نہیں آ جاتے\nفیض ملتا ہے تو بیمار چلے آتے ہیں\n\nبھول ہو جاتی ہے شہزادؔ ہمیشہ مجھ سے\nدستگیری کو وہ ہر بار چلے آتے ہیں"
  },
  {
    "id": 145,
    "title": "نعت شریف",
    "description": "طور کے طالبوں کو طور ملے\nہم کو بس قربت حضور ملے\n\nمجھ سے کم فہم کو بھی میرے حضور\nآپ کی ذات کا شعور ملے\n\nفرش تا عرش جس سے دیکھ سکوں\nیا نبی! آنکھ کو وہ نور ملے\n\nروح میری رہے بس آپ کے پاس\nقبر مجھ کو اگرچہ دور ملے\n\nاس کے ایمان کا میں شاھد ہوں\nنعت سن کر جسے سرور ملے\n\nذکر شہزادؔ جب چھڑے ان کا\nقلب بیتاب کو سرور ملے"
  },
  {
    "id": 146,
    "title": "نعت شریف",
    "description": "ترے در کی گدائی مل گئی ہے\nہر اک غم سے رہائی مل گئی ہے\n\nتری خوشبو رچی باطن میں جب سے\nدل و جاں کو صفائی مل گئی ہے\n\nترے لطف و کرم سے عاصیوں کو\nردائے پارسائی مل گئی ہے\n\nحضوری ہو اگر ان کی میسر\nتو یوں سمجھو خدائی مل گئی ہے\n\nملے ہیں جب سے سرکارِ دو عالم\nمجھے ساری خدائی مل گئی ہے"
  },
  {
    "id": 147,
    "title": "نعت شریف",
    "description": "جوق در جوق آئے نظر قافلے\nسوئے طیبہ ہیں محو سفر قافلے\n\nآئو آئو سلامی کو ان کی چلیں\nجا رہے ہیں نبی کے نگر قافلے\n\nکھو گئے جلوئہ نور میں سربسر\nدیکھ کر نور والے کا گھر قافلے\n\nبڑھتا جاتا ہے اتنا ہی ذوق سفر\nجتنا کرتے ہیں طے رہگزر قافلے\n\nلوٹ آئے تو ہیں شہر سرکار سے\nدل وہیں چھوڑ آئے مگر قافلے\n\nجب نظر سے وہ شہزادؔ اوجھل ہوئے\nکر گئے میری آنکھوں کو تر قافلے"
  },
  {
    "id": 148,
    "title": "نعت شریف",
    "description": "مہر و مہ میں تری نظر سے نور\nتارے لیتے ہیں تیرے گھر سے نور\n\nگلستانِ نبی کا کیا کہنا!\nپھوٹتا ہے ہر اک شجر سے نور\n\nمصطفی کے قدم لگے ہیں اسے\nکیسے نکلے نہ رہگزر سے نور\n\nمختصر قصۂ شب معراج\nنور سے تا بشر ، بشر سے نور\n\nپہلے پھٹتی ہے پو مدینہ میں\nپھر نکلتا ہے ہر سحر سے نور\n\nہو عطا مجھ کو نور سیرت کا\nتیرگی ہو مرے اثر سے نور\n\nشمع دل میں جلائی ہے شہزادؔ\nلے کے بطحا کے تاجور سے نور"
  },
  {
    "id": 149,
    "title": "نعت شریف",
    "description": "بہاروں کی جاں ہے بہار مدینہ\nہے جنت سے بڑھ کر دیارِ مدینہ\n\nعجب حق نے رکھی ہے تاثیر اس میں\nشفا ہی شفا ہے غبار مدینہ\n\nفرانس اور لندن سے کیا کام مجھ کو\nمیں ہوں رہرو رہگزار مدینہ\n\nدھنک ، روشنی ، رنگ انوار ، خوشبو\nگل و گلستاں سب نثار مدینہ\n\nملے مجھ کو زندانِ غم سے رہائی\nہو چشم کرم تاجدار مدینہ\n\nتصور میں شہزادؔ ہے سبز گنبد\nنگاہوں میں نقش و نگارِ مدینہ"
  },
  {
    "id": 150,
    "title": "نعت شریف",
    "description": "مدینے کے شام و سحر اللہ اللہ\nوہ پرنور دیوار و در اللہ اللہ\n\nمری رات مکے کی گلیوں میں گزرے\nمدینہ میں دن ہو بسر اللہ اللہ\n\nنبی کے نشان قدم کی بدولت\nہے روشن مری رہگزر اللہ اللہ\n\nسکھایا نبی کا ادب خود خدا نے\nیہ تعظیم خیرالبشر ، اللہ اللہ\n\nسفر ہیں حسیں سے حسیں ترجہاں میں\nمدینے کا لیکن سفر ، اللہ اللہ\n\nخدا کے خزانے کے قاسم ہیں لیکن\nنہیں پاس کچھ مال و زر اللہ اللہ\n\nمہینوں نہ جلتا تھا چولہا جہاں پر\nوہ شاہِ دو عالم کا گھر اللہ اللہ\n\nوہ شہزادؔ شاہد ہیں از روئے قرآں\nنہیں کس پہ ان کی نظر اللہ اللہ"
  },
  {
    "id": 151,
    "title": "نعت شریف",
    "description": "ان کے بارے سوچنا اچھا ہے بس\nان کی جانب دیکھنا اچھا ہے بس\n\nکارواں کی کوئی کل سیدھی نہیں\nکارواں کا رہنما اچھا ہے بس\n\nاور سارے راستے باطل ہوئے\nاک نبی کا راستہ اچھا ہے بس\n\nآپ ہی سے ہے مری وابستگی\nآپ ہی سے رابطہ اچھا ہے بس\n\nمانگنے سے کر دیا ہے بے نیاز\nاب اسی در پر گدا اچھا ہے بس\n\nنعت کہتا ہے شہ کونین کی\nیہ عمل شہزادؔ کا اچھا ہے بس"
  },
  {
    "id": 152,
    "title": "نعت شریف",
    "description": "کیا لکھے کوئی بشر شان رسول\nہے خدا ہی مرتبہ دان رسول\n\nوہ پریشاں حال ہو ممکن نہیں\nہاتھ میں جس کے ہے دامانِ رسول\n\nیاالٰہی! آج کیوں مظلوم ہیں\nساری دنیا میں غلامان رسول\n\nحیدر و صدیق و فاروق و بلال\nایسے ہیروں سے ہے پُر کانِ رسول\n\nمست رہتے ہیں فرشتے بھی یہاں\nمصدر فرحت ہے ایوان رسول\n\nقرۃ العین نبی ہیں فاطمہ\nعائشہ ہیں راحت جان رسول\n\nوالدین و جان و مال اولاد سب\nکیجئے شہزادؔ قربان رسول"
  },
  {
    "id": 153,
    "title": "نعت شریف",
    "description": "جس میں ان کی رضا نہیں ہوتی\nوہ عبادت روا نہیں ہوتی\n\nنیکیاں اور رہ بھی جاتی ہیں\nنعت لیکن قضا نہیں ہوتی\n\nدل میں یوں بس گئی ہے یادِ نبی\nاب تو پل بھر جدا نہیں ہوتی\n\nہائے افسوس ایسی محفل پر\nجس میں ان کی ثنا نہیں ہوتی\n\nحسرت اس دن پہ آتی ہے جس دن\nنعت خیرالوریٰ نہیں ہوتی\n\nلذت نفس جس کا باعث ہو\nہم سے ایسی وفا نہیں ہوتی\n\nجس میں شامل نہ ہو درود و سلام\nوہ دعا تو دعا نہیں ہوتی\n\nہو نہ شہزادؔ گر خدا کا کرم\nمدحت مصطفی نہیں ہوتی"
  },
  {
    "id": 154,
    "title": "نعت شریف",
    "description": "کرم ان کا جو ہوتا جا رہا ہے\nدلوں سے زنگ اترا جا رہا ہے\n\nنگاہیں سبز گنبد پر جمی ہیں\nیہیں مرنے کا سوچا جا رہا ہے\n\nمیں جو ہوں میرے آقا جانتے ہیں\nنہیں ہوں وہ جو سمجھا جا رہا ہے\n\nکوئی ثانی نہیں شاہِ زمن کا\nہر اک لمحہ یہ کہتا جا رہا ہے\n\nچلو بک جائیں ہم جا کر مدینے\nسنا ہے بھائو اچھا جا رہا ہے\n\nعنایات در خیرالوریٰ سے\nرخ ہستی نکھرتا جا رہا ہے\n\nقدم کا کام لو شہزادؔ سر سے\nمدینے کو یہ رستہ جا رہا ہے"
  },
  {
    "id": 155,
    "title": "درود پاک",
    "description": "کیوں کر نہ ہم ہوں وقف برائے درود پاک\nپڑھتا ہے خود درود خدائے درود پاک\n\nچہرہ ہے نور سنت آقا سے مستنیر\nجلوہ نما ہے دل میں ضیائے درود پاک\n\nاللہ رے یہ ذکر محمد کی رفعتیں\nمسجد سے آ رہی ہے صدائے درود پاک\n\nصل علیٰ کا ذکر ہی ہونٹوں پہ ہو مدام\nکر دیں تمام ورد فدائے درود پاک\n\nبخشش ، خدا کی رحمتیں دید رخ رسول\nکتنی عظیم تر ہے جزائے درود پاک\n\nلگتی نہیں ہیں تلخ زمانے کی سختیاں\nبے شک ہے یہ بھی ایک عطائے درود پاک\n\nخوف و خطر ہو کیا اسے دوزخ کی آگ کا\nاوڑھی ہوئی ہو جس نے ردائے درود پاک\n\nآتا ہے اس کے ساتھ عبادت پہ اک نکھار\nپھیکی دعا میں چاشنی لائے درود پاک\n\nاس گھر کے بام و درپہ برستی ہیں رحمتیں\nجس گھر سے اٹھ رہی ہو صدائے درود پاک\n\nہوتے ہیں خوش ملائکہ شہزادؔ عرش پر\nجب بھی کوئی کسی کو سنائے درود پاک"
  },
  {
    "id": 156,
    "title": "نعت شریف",
    "description": "شان شمس الضحیٰ لکھی جائے\nنعت خیرالوریٰ لکھی جائے\n\nسیرت و صورت رسول کی بات\nجا بجا جا بجا لکھی جائے\n\nایک چٹھی بنام شاہ عرب\nبرجبین صبا لکھی جائے\n\nان کی عظمت کا ہو بیاں کیوں کر\nکیسے ان کی ثنا لکھی جائے\n\nتھا یہ پروردگار کو منظور\nان کی ہر اک ادا لکھی جائے\n\nحرمت حرف کا تقاضا ہے\nنعت احمد سدا لکھی جائے\n\nنعت ہے بحر بیکراں شہزادؔ\nزکجا تا کجا لکھی جائے"
  },
  {
    "id": 157,
    "title": "نعت شریف",
    "description": "جنگ و جدل میں امن کا پرچم ہے تیری ذات\nزخم جگر کے واسطے مرہم ہے تیری ذات\n\nتیری تجلیات سے عالم ہے مستنیر\nمہر منیر ، نور مجسم ہے تیری ذات\n\nتیرا کرم ہے اپنے پرائے کے واسطے\nخیرالوریٰ و رحمت عالم ہے تیری ذات\n\nکیوں کر نہ ہو وہ شخص زمانے کا رہنما\nجس کی نظر کے سامنے ہر دم ہے تیری ذات\n\nمہکا ہے تیرے فیض سے گلشن کا پھول پھول\nسامان خوشگواریٔ موسم ہے تیری ذات\n\nآباد تیرے واسطے مکہ کیا گیا\nوجہ ظہور چشمۂ زم زم ہے تیری ذات\n\nرہتا ہے اس خیال سے شہزادؔ مطمئن\nاک مغفرت کے واسطے کیا کم ہے تیری ذات"
  },
  {
    "id": 158,
    "title": "نعت شریف",
    "description": "سوئے طیبہ چل پڑا اچھا ہوا\nدل جہاں سے اٹھ گیا اچھا ہوا\n\nان کی چشم لطف سے ہر اک عمل\nابتدا تا انتہا اچھا ہوا\n\nفرق اچھے اور برے اعمال میں\nان کے آنے سے ہوا اچھا ہوا\n\nبے مزہ تھی زندگی ان کے بغیر\nآ گئے خیرالوریٰ اچھا ہوا\n\nبندگی معیار سے واقف ہوئی\nاز طفیل مصطفی اچھا ہوا\n\nخوب ان کے لطف سے سب خوبیاں\nان سے ہر اک سلسلہ اچھا ہوا\n\nچھوڑ کر شہزادؔ شاہی کا خیال\nبن گیا ان کا گدا اچھا ہوا"
  },
  {
    "id": 159,
    "title": "خیرالانام",
    "description": "اے حبیب حق تعالیٰ الصلوۃ والسلام\nصاحب اخلاق اعلیٰ الصلوۃ والسلام\n\nماہ طیبہ مہر بطحا الصلوۃ والسلام\nاے ضیائے روئے کعبہ الصلوۃ والسلام\n\nاے مراد قلب موسیٰ الصلوۃ والسلام\nاے سکون روح عیسیٰ الصلوۃ والسلام\n\nگونج ہے صل علیٰ کی خلد کے باغات میں\nقدسیوں کا ہے ترانہ الصلوۃ والسلام\n\nتیری برکت سے مزّین ہو گیا صحن حرم\nتجھ سے روشن ہے مدینہ الصلوۃ والسلام\n\nہم گنہگاروں کو اپنے لطف کی خیرات دو\nدرد دل کا ہو مداوا الصلوۃ والسلام\n\nہم فقیروں کو خدا کے بعد ہے تم سے امید\nبے کسوں کو دو سہارا الصلوۃ والسلام\n\nجگمگاتی ہیں دلوں کی بستیاں اس ذکر سے\nہے محبت کا تقاضا الصلوۃ والسلام\n\nقبر میں میری جب آئیں گے رسولوں کے رسول\nمیں کھڑا ہو کر کہوں گا الصلوۃ والسلام\n\nخالق کون و مکاں کو ہے یہی نغمہ عزیز\nہے فرشتوں کا وظیفہ الصلوۃ والسلام\n\nفرش والوں کو ہے تیری اک جھلک کی آرزو\nعرش والوں کی تمنا الصلوۃ والسلام\n\nزندگی میں قبر میں محشر کے رنج و یاس میں\nکامیابی کا طریقہ الصلوۃ والسلام\n\nکیجئے شہزادؔ کی جانب سے یہ ہدیہ قبول\nمیرے مولا میرے آقا الصلوۃ والسلام"
  },
  { "id": 160, "title": "ثناء کا موسم", "description": "" },
  {
    "id": 161,
    "title": "انتساب",
    "description": "اہلِ محاسن کے نام\nاُحِبُّ الصَّالِحِینَ وَ لَسْتُ مِنْہُم\n\nلَعَلَّ اللّٰہَ یَرْزُقُنِیْ صلاح\n_________________________________\n\nمیں صالحین سے محبت رکھتا ہوں گو ان میں سے نہیں ہوں شاید اللہ تعالیٰ(اس باعث) میری بھی اصلاح فرما دے\nمحاسن … ایک تاثر\n\nحضورِ اکرم اکی اتباع کرنے والے اور ان کے لائے ہوئے پیغام کو عملی شکل میں باقی رکھنے کی کوشش کرنے والے لوگ اللہ تعالیٰ کی محبت کے حق دار بن جاتے ہیں ۔اللہ تعالی جن لوگوں سے محبت فرماتا ہے ان کی محبت اپنی مخلوق کے دلوں میں بھی پیدا فرمادیتا ہے۔ اس لیے کہ اس نے پہلے تو اپنے حبیب جنابِ محمد مصطفیا کی زبانی یہ اعلان کروایا……:’’فَا تَّبِعُوْنِْی یُحْبِبْکُمُ اللّٰہُ……الخ ‘‘……(تم میرے فرمانبردار ہوجاؤ اللہ تمہیں دوست رکھے گا …آلِ عمران …آیت ۳۱)۔ پھر اللہ تعالیٰ نے یہ اعلان فرمادیا … اِنَّ الَّذِیْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ سَیَجْعَلُ لَھُمُ الرَّحْمٰنُ وُدًّاO ترجمہ:-بے شک وہ جو ایمان لائے اور اچھے کام کیے ان کے لیے رحمن محبت [عام] کردے گا ۔                                                                (سورہ مریم،آیت: ۹۶)\nاللہ تعالیٰ نے اپنے حبیب جنابِ محمدٌ رَّسول اکی نعت لکھنے کاذوق بھی شعراء میں اپنے اسی قانون کے تحت پیدا فرمایاجو ہر بالغ نظر اور سلیم الفطرت انسان کی طبیعت کا خاصہ بنادیا گیا ہے………یعنی ’’خیر‘‘ سے محبت کرنا………اور یہ طے ہے کہ اصل خیر صرف اور صرف انسان کی سیرت کے ذریعے ہی پھیلتا ہے۔ حضورِ اکرم  ا کی حیاتِ طیبہ سے خیر کی کرنیں پھوٹیں تو کائنات جگمگا گئی اور ان کی اتباع کرنے والوں کی سیرت سے جو خیرپھیلا اس نے دلوں کی کائنات کو روشن کردیا۔منقبت کی تخلیق اسی جذبہء خیرطلبی کے زیرِ اثر ہوتی ہے۔\n\nعلامہشہزاد مجددی نوجوان علماء میں ایک ثقہ عالم کے طورپر معروف ہیں ۔جب کوئی عالم شعر گوئی کی طرف متوجہ ہوتا ہے تو اکثر دو طرح کی صورتِ حال سامنے آتی ہے۔یا تو علم ،شاعری میں ڈھل کر شعر کے آفاق کو مزید وسعت دینے کا سبب بنتا ہے یا فنِ شاعری پر مسلط ہوکر شعریت کی موت کا سبب بنتا ہے۔مگر شہزاد مجددی کے ہاں علم اور شاعری کی خو ش آئند رفاقت نے سلیقے، قرینے اور توازن کی ایک ایسی مثال قائم کی ہے جس میں شعریت کا حسن بھی برقرار ہے اور علم کی روشنی بھی جزوِ شعر بن کے قاری کو متاثر کرتی ہے۔یہ بات میں نے ان کے مجموعی کلام کے تناظر میں کہی ہے۔ ان کے دو نعتیہ مجموعے میری نظر سے گزر چکے ہیں اور اب’’ محاسن ‘‘ اپنے پورے ادبی اور روحانی محاسن کے ساتھ پیشِ نظر ہے۔محاسن کا مطالعہ صرف ہمیں شاعر کے روحانی رشتوں سے آشنا نہیں کراتا بلکہ قرآنِ مجید ، احادیثِ نبوی اور مسلم تاریخ کا فہم و شعور بھی عطا کرتا ہے۔\nکتاب میں شامل مناقب میں شاعر کا اخلاص، محبت اور خیر طلبی کو عام کرنے کے جذبے کا شعری محاسن کے ساتھ نمایاں ہونا اس بات کی علامت ہے کہ شہزاد مجددی اپنے تخلیقی سفرمیں بھی اپنے ان تمام لوازمات کے ساتھ کامیابی سے ہم کنار ہوئے ہیں۔کتاب کے انتساب نے ان کی منقبت نگاری کی غایت کو جس خوبی سے اجاگر کیا ہے وہ سراسر اخلاص پر مبنی ہے اور اس سفر میں اخلاص ہی کامیابی کی ضمانت ہے۔\n\nسید صبیح الدین رحمانی\nمدیرــ’’ نعت رنگ‘‘\n\n(نعت ریسرچ سینٹر انٹرنیشنل)\nکراچی"
  },
  {
    "id": 162,
    "title": "تقریظ",
    "description": "علامہ شہزاد مجددی ابھی نوجوان ہیں لیکن ایک ہمہ صفت موصوف شخصیت کی حیثیت سے معروف ہوچکے ہیں ،یہ ایک مستند عالم ہیں لیکن انھوںنے صرف نصاب کی تحصیل پر اکتفاء نہیں کیابلکہ اپنے مطالعے کو بڑی وسعت دی ہے،جدید وقدیم علوم کی شناوری کے ساتھ ساتھ یہ عمل کی دشوار گزار گھاٹیوں سے بھی بڑی کامیابی سے گزرے ۔کسی شخصیت میںعلم اورزہد یکجاہو جائیںتو بسااوقات وہ اپنے بارے میں کسی مغالطے کا شکار بھی ہوجاتی ہے۔لیکن شہزاد مجددی فقرو درویشی کی طرف مائل ہوئے اوراس طرح اللہ تبارک وتعالیٰ نے انھیں زاہدِ خشک ہونے سے بچالیا۔صوفی عشق و محبت کی کیفیت سے سرشارہوتے ہیں اوریہ کیفیت اکثر اپنے اظہار کے لیے شعر کا اسلوب اختیار کرتی ہے۔شہزاد مجددی ایک معیاری اورصاحب اسلوب شاعر کی حیثیت سے بھی سامنے آئے ہیں۔\nزیر نظر مجموعہ ان کے اس کلام پر مشتمل ہے جو مختلف شخصیات کی مدح میں کہا گیا ہے،اس میں اردو ،فارسی اورپنجابی زبان میں کہے گئے مناقب یکجاکردیے گئے ہیں ۔منقبت کا دائرہ بظاہر محدود نظرآتا ہے لیکن شہزاد مجددی نے مناقب کہتے ہوئے بھی مضامین کے تنوع کو برقرار رکھا ،اورطبیعت کی سرشاری اورحسن تغزل کا بھرپور اظہارکیا ہے۔ان کا مطالعہ چونکہ بہت وسیع ہے تو جب وہ کسی بھی شخصیت کی مدح میں قلم اٹھاتے ہیں تو اس کی شخصیت، اس کے دور اوراس کے نمایاں کارنامے بڑی خوبصورت تلمیحات کے ساتھ سامنے لے آتے ہیں،ان کے ممدوح چونکہ کوئی ’’نوابانِ نان پارہ‘‘نہیں ہیں لہذا وہ جس شخصیت کا ذکر بھی کرتے ہیںیوں محسوس ہوتا ہے کہ انھوںنے اس کی محبت اوراس کے محاسن کو اپنی روح میں اتار لیا ہے۔مجھے بطورِ خاص جس پہلو نے بہت متاثر کیا ہے وہ یہ ہے کہ علامہ نے منقبت کہتے ہوئے ایک صوفی کی وسیع المشربی کا بھر پوراظہارکیا ہے۔وہ خلفاء راشدین کی عالیٰ مرتبت شخصیت کا بھرپور وابستگی کے ساتھ تذکرہ کرتے ہیںاور اس کے ساتھ اہل بیت اطہار کے ذکر کو بھی کمالِ حلاوت اور کمالِ احترام کے ساتھ چھیڑتے ہیں۔وہ خود نقشبندی مشرب سے تعلق رکھتے ہیںلیکن تمام سلاسل کے بزرگوںکا ذکر خیر کرتے ہیںاوران کی عقیدت ومحبت میں کوئی کمی محسوس نہیں ہوتی ، انھوںنے اپنے مشائخ سلسلہ سے بھر پور فیض اٹھایا ہے لیکن اس کے ساتھ ساتھ وہ اپنے زمانے کے بہت سے معروف اورباکمال افراد کی صحبت اوررفاقت سے بھی استفادہ کرتے ہوئے نظر آتے ہیں۔اور اپنی شاعری میں ان کے محاسن کا بھرپوراعتراف بھی کرتے ہیں۔فی زمانہ معیاری زبان اوردلکش تراکیب کے ساتھ کلام کرنے والے لوگ بہت کم ہیں۔ شہزاد مجددی نے زبان کا ایک خاص معیار اختیار کیا ہے اور اسے ہر جگہ برقرار بھی رکھا ہے۔ان کی جولانی طبع اردو کے ساتھ فارسی اورپنجابی میں بھی اسی طرح رواں نظر آتی ہے۔\n\nمضامین کے تنوع ،زبان کے معیار اورحسن تراکیب کے ساتھ شہزاد مجددی فن شعر کی نزاکتوں سے بھی پوری طرح واقفیت رکھتے ہیں۔انھوں نے مدح و منقبت کے میدان میں بھی بڑی ندرت دکھائی ہے اوربڑی خوش اسلوبی کے ساتھ مختلف زمینوں پر طبع آزمائی کی ہے۔خاکسار چونکہ شعر وادب کا بھی ثقہ نقاد نہیں ہے کہ وہ’’ محاسن ‘‘کے مکمل محاسن کا احاطہ کرسکے ۔کلام کا مطالعہ کرنے کے بعد جو چند باتیں مجھے فوری طور پر محسوس ہوئیں وہ عرض کردی گئیں۔یہ حسن اتفاق ہے کہ جس وقت یہ مسودہ مجھے تفویض کیا گیا میں دیارِ رسول صلی اللہ علیہ وسلم کی حاضری اوربیت اللہ کی زیارت کے لیے روانہ ہورہا تھا۔دورانِ سفر شہزاد مجددی کے کلام کا مطالعہ میرے لیے محبت اورخدمت کی تاریخ کا ایک سفر بھی ثابت ہوا۔\nزاویہ نشین\n\nرضاء الدین صدیقیؔ\nـ’’مناقب سے محاسن تک‘‘\n\nاللہ والوں کے مناقب و محاسن ہوں یا اُن کے تزکار و اذکار ہوں،بات ان کے فضائل و کمالات کی ہو یا سیرت و سوانح کی، دراصل یہ سبھی سلسلے ’’فَاذْکُرُوْنِیْ اَذْکُرْکُمْ‘‘ کی نہایت خوش کن اور ایمان افروز تفسیر و توضیح کا درجہ رکھتے ہیں۔جب اللہ کا مقرب اور کامل بندہ ذکرحقیقی کے مدارج و مراحل کو بخوبی طے کرتے ہوئے مذکور کی بارگاہ تک رسائی حاصل کر لیتا ہے تو ایک مقام آتا ہے جب ذاکر،مذکور ہوجاتاہے۔اور اسے پہلا انعام بارگاہ الٰہی سے اسی مذکوریت کی صورت میں عطا ہوتا ہے چنانچہ حدیثِ قدسی میںہے:\nاذاذکرنی فی نفسہٖ ذکرتہٗ فی نفسی……الخ (متفق علیہ)\n\nترجمہ:-جب بندہ مجھے اپنے دل میں یاد کرتا ہے تو میںبھی اسے بطریق خفی یاد کرتا ہوں اور جب وہ مجھے کسی محفل میںیاد کرتا ہے تو میں اسے اس سے بہتر محفل (یعنی ملائکہ کی محفل) میںیاد کرتا ہوں۔اسی طرح فرمایا:\nاَنَا جَلِیْسٌ مَعَ مَن ذَکَرَنِیْ\n\nترجمہ: -میں اپنے ذاکر کا ہم نشین ہوتا ہوں۔\nپھر فرمایا کہ جو ان کے پاس بیٹھ جائے وہ بھی محروم نہیںرہتا۔ بقول عارف رومی رحمہ اللہ\n\nہر کہ خواہد ہم نشینی با خدا\nاو نشیند در حضور اولیاء\n\nیوں ذاکر کی ہم نشینی مذکور کی مجالست کا فائدہ دیتی ہے اور اللہ والوں کا ذکر کرنا خود سنت الٰہیہ قرار پاتا ہے۔\nحضرات انبیاء کرام، اہل بیت اطہار،صحابہ کرام علیہم الرضوان اور اولیاء عظام کے تزکار و واقعات، قصص و احوال اور معجزات و کرامات تو خود قرآن پاک میں متعدد مقامات پر بیان ہوئے ہیں۔ اور ان مناقب و محاسن کا بیان یقینامبنی بر حکمت ہے۔\n\nحضرت سیّدالطائفہ سیدنا جنید بغدادی رحمہ اللہسے ایک موقع پر دریافت کیا گیا تھا،حکایات سے مریدوں کو کیا فائدہ پہنچتا ہے:تو آپ نے فرمایا:\nالحکایات جندمن جنود اللّٰہ یقوی بھاقلوب المریدین۔\n\n(رسالہ قشیریہ ، ص:۴۰۸۔باب الدلا)\nترجمہ:- مشائخ کی حکایات خدا کے لشکروں میں سے ایک لشکر ہے،جس سے مریدوں کے دل قوی ہوتے ہیں۔\n\nاس پر آپ سے سوال کیا گیا کہ کیا آپ کے اس قول پر کوئی شاہد ہے؟ آپ نے جواب دیا، ہاں،اور وہ اللہ جل مجدہٗ الکریم کا یہ فرمان ہے:\nوَکُلًّا نَّقُصُّ عَلَیْکَ مِنْ اَنْبَآئِ الرُّسُلِ مَا نُثَبِّتُ بِہٖ فُؤَادَکَج (ہود:۱۲۰)\n\nترجمہ:-اور ہر چیز کو ہم بیان کرتے ہیںتجھ سے پیغمبروں کی خبروں سے وہ چیز کہ جس سے ہم ثابت رکھتے ہیںتیرادل۔\nمولانا جامی قدس اللہ سرّہ نے اس فرمان کو یوں منظوم کیا ہے۔\n\nہجوم نفس و ہوا کز سپاہ شیطانند\nچو زور بر دل مرد خدا پرست آرد\n\nبجز جنود حکایات رہنمایاں را\nچہ تاب آنکہ براں رہزناں شکست آرد\n\nمولانا جامی  علیہ الرحمہلکھتے ہیں:\nشیخ الاسلام عبداللہ انصاری ہروی قدس سرہٗ نے اپنے مریدوں کو وصیّت کی کہ، ہر ایک پیر کا کوئی کلام یاد کر لو اگر ایسا نہ کر سکو تو ان کا نام یاد رکھو تاکہ اس سے فائدہ اٹھائو۔\n\n(بہارستان جامی ـ ۶ ؎ )\nارشادنبوی ا ہے: المرء مع من احبَّ۔(بخاری)\n\nقیامت کے دن بندہ اس کے ساتھ ہوگا جسے وہ دوست رکھتا تھا۔\nچنانچہ اللہ والوں کی محبت اور دوستی کا ایک تقاضا ان کے محاسن و مناقب کا بیاں اور تذکرہ کرنا بھی ہے۔\n\nحدیث شریف میں ہے: اُذْکِرُوْمَحَاسَنْ مَوْتَاکُمْ ۔\nاپنے مرحومین کی خوبیاں بیان کیا کرو۔ اور ان کی کوتاہیوں سے صرف نظر کیا کرو۔\n\nپھر ان صالحین کے تذکرے کو گناہوں کا کفارہ بھی قرار دیاگیا ہے۔\nارشاد نبوی ہیـ: ذکرالصالحین کفارۃ۔        (الجامع الصغیر:۲/۱۹)\n\nاللہ کے نیک بندوں کا ذکر گناہوں کا کفّارہ ہے۔\nیہی وجہ ہے کہ قرآن و حدیث میںبھی انبیاء ، صدیقین ، شہداء اور صالحین کا تذکرہ بطور خاص کرتے ہوئے انھیں بہترین ساتھی قرار دیا گیا ہے۔\n\nوَحَسُنَ اُوْلٰٔیکَ رَفِیْقاً۔\nحضرت امام مالک صالفتح کے آخری رکوع کو صحابہ کرام کی منقبت کا بہترین شہکار قرار دیتے ہیں۔\n\nآپ فرمایا کرتے تھے کہ ہمارے بزرگ ہمیں ابوبکر صدیق اور عمر فاروق رضی اللہ عنہما کی سیرت آیات قرآن کی طرح سکھایا کرتے تھے۔\nکیوں نہ ہو خود ختمی مرتبت حضور رسالت مآب ا نے بھی منقبت نگاری کی حوصلہ افزائی فرمائے ہوئے حضرت حسّان بن ثابت رضی اللہ عنہ سے فرمائش کر کے حضرت یارِغارومزار سیدنا ابوبکر صدیق رضی اللہ عنہ کی منقبت سماعت فرمائی اور یوں اس کارخیرکو اپنی سنّت بنا دیا۔\n\nمستدرک حاکم میں ہے!\nترجمہ :-حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے:\n\nبے شک رسول اللہ  انے حضرت حسان رضی اللہ عنہ سے فرمایا ،کیا تم نے ابوبکر کے بارے میںکوئی شعر کہا ہے انہوں نے کہا: جی ہاں۔آپ انے فرمایا: پڑھومیں سنتا ہوں ۔\nحضرت حسان نے کہا:\n\nوَثَانِی اثنین فی الغار المنیف وَقَد\nطَافَ العُدُوّبہٖ اِذ صَاعِدَ الجَبَلَا\n\nوَکَانَ حِبّ رسُوُلِ اللہ قد علموا\nمِنَ الَبرِیَّۃ لم یَعدلُ بِہٖ الرَّجُلا\n\nمفہوم:اور جب دشمن ان کی تلاش میں پہاڑ پر چڑھے جبکہ وہ محاصرہ کئے ہوئے تھے اور ابوبکر غار (ثور) میں دو میں سے ایک تھے اورآپ رسول اللہ ا کے محبوب تھے اور تمام صحابہ جانتے تھے کہ اس خصوصیت میں آپ کا کوئی شریک نہیں ہے۔\nپس رسول اللہ ا مسکرائے یہاں تک کہ آپ کے پچھلے دندان مبارک دکھائی دینے لگے پھر فرمایا اے حسان !تم نے سچ کہا وہ ایسا ہی ہے جیسا تم نے کہا ہے۔(اسے ابن عدی اور ابن عسا کر نے روایت کیا ہے )۔\n\n(مستدرک حاکم :عن حبیب ابن ابی حبیب،67/2 :رقم:4422 )\nگویا اللہ کے پیاروںکی منقبت لکھنے، کہنے اور سننے کا سلسلہ نعت شریف کے ساتھ ہی شروع ہو گیا تھا اور اس سنت کے فروغ کا سہرا بھی شاعر دربار رسالت حضرت حسان بن ثابتؓ کے سرمبارک پر سجا ہے۔ دیگر بزرگ اور اکابر صحابہ کرام کے علاوہ حضرت حسان کے اشعار میں حضرت روح القدس سیدنا جبریل امین علیہ السلام کی منقبت کے اشعار بھی ملتے ہیں۔ ایک موقع پر آپ نے دوران نعت یوں شعر عرض کیا:\n\nوجبریلٌ رسول اللّٰہ فینا\nو رُوحٌ القُدْس لَیسَ لَـہٗ کفائُ\n\nترجمہ:-ہمارے درمیان اللہ کے پیغمبر جبریل موجود ہیں اور روح القدس کا کوئی ہم پلہ نہیں ہے۔\nچنانچہ پیش نظر مجموعۂ مناقب ’’محاسن‘‘ میں اس نادر سنت کے احیاء کا شرف بھی راقم کے حصہ میں آیا ہے۔ اعلیٰ حضرت فاضل بریلوی کے دیوان ’’حدائق بخشش‘‘ میں بھی بعض نعتوں میں مناقب جبریل پر مبنی اشعار ملتے ہیں۔\n\nعرش سے مژدہ بلقیس شفاعت لایا\nطائر سدرہ نشیں مرغ سلیمان عرب\n\nپائے جبریل نے سرکار سے کیا کیا القاب\nخسرو خیل ملک ! خادم سلطان عرب\n\nحضور ا کی والدہ ماجدہ سیدہ آمنہ سلام اللہ علیہا کی منقبت بھی زینت افزائے محاسن ہے۔ امہات المؤمنین، اہل بیت اطہار، صحابہ کبار اور اولیاء و علمائے کرام کے مناقب بھی شامل کتاب ہیں۔\nاسلامی ادبیات میں عربی، فارسی، اردو اور پنجابی زبانوں کے علاوہ دیگر علاقائی زبانوں میں کہے گئے منظوم مناقب کا معتدبہ ذخیرہ موجود ہے۔ خاص طور پر فارسی و اُردو زبانوں کو اس حوالے سے بہرئہ وافر حاصل ہوا ہے۔ عربی و فارسی لغات نویسوں نے اس لفظ کے حوالے سے جو کچھ لکھا ہے اس کا خلاصہ درج ذیل ہے:\n\nلفظ: منقبت ، مناقب اس کی جمع ہے۔ ’’خصال حمیدہ اور فعل کریم‘‘ مناقب بطور اسم بھی استعمال ہوتا ہے۔ اس کا معنی ہے نیک خصال ، خوش خصال صالح وغیرہ۔\nعربی میں اس کا مادہ ن ق ب ہے۔\n\nاصطلاح میں کسی اللہ والے کی خوبیاں محاسن اور نیک اعمال، اس کے مناقب کہلاتے ہیں۔ نقیب اور نقب زنی وغیرہ بھی اسی مادے سے بنے ہیں۔\nاس مناسبت سے کتب حدیث میں ابواب باندھے گئے ہیں۔\n\nمناقب صحابہ، مناقب اہل بیت، مناقب امہات المؤمنین، مناقب المہاجرین و الانصار، یہاں تک کہ مشکوٰۃ المصابیح میں مناقب ہٰذہ الامۃ کے عنوان سے بھی باب باندھا گیا ہے۔\nبزرگان دین کے تذکرے اور سوانح بھی اس عنوان سے ملتے ہیں جیسے الاختیار فی مناقب الاخیار، محض الصواب فی مناقب عمر بن الخطاب وغیرہ۔ انگریزی میں اس کے لیے درج ذیل الفاظ استعمال ہوتے ہیں۔\n\nمنقبت: مناقب\nCommexpablie acts\n\nEthics feats moral.\nOutstanding Traits virtues.\n\nوغیرہ۔\nعربی اور فارسی کی طرح اردو میں بھی منقبت نگاری کا سلسلہ جاری رہا ہے اور یہ سلسلۂ خیر اردو زبان و ادب کے آغاز سے ہی شروع ہو گیا تھا۔ جوں جوں اردو ادب ترقی کرتا گیا اور زبان پھلتی پھولتی رہی توں توں دیگر اصناف ادب کی طرح حمدونعت اور مناقب نگاری میں بھی پختگی اور رسوخ بڑھتا چلا گیا اور اہل شعر و سخن نے رسمی و اصلی دونوں انداز سے بزرگان دین کی شان میں منقبت گوئی کا سلسلہ جاری رکھا۔ رسمی و اصلی یا حقیقی سے مراد ہے کہ بعض اہل قلم نے محض تبرکاً اور رسماً منقبت لکھی اور بعض اہل حال شعراء اور اہل نسبت صوفیہ نے حقیقی اور اصلی رنگ میں پورے رچائو اور اہتمام سے اپنے اکابر کو خراج عقیدت و محبت منظوم شکل میں پیش کیا چنانچہ ماضی قریب میں ہمیں مجموعہ ہائے مناقب ملتے ہیں۔ جن کے لکھنے والے علمی، ادبی، شعری اور شرعی ہر اعتبار سے پختہ منقبت نگار تھے اور انہوں نے اس روایت کو نہ صرف زندہ رکھا بلکہ اسے بطریق احسن آگے بڑھایا اور اس میں قابل تقلید اضافے بھی کیے۔\n\nان بزرگوں میں اساتذہ فن ولی دکنی، سودا، میردرد، غالب، مومن، اقبال وغیرہ کے بعد انیس، جوش، صبااکبرآبادی، اقبال سہل، عبدالعزیز خالد، سروسہارنپوری، حافظ افضل فقیر، بشیر حسین ناظم، بے چین رجپوری، ریاض مجید، حافظ لدھیانوی، حفیظ تائب اور پیر نصیر الدین نصیر گولڑوی کے نام نمایاں ہیں۔ پیش نظر مجموعہ ’’محاسن‘‘ منقبت نگاری کی ادبی اورعرفانی دونوں روایتوں کا مظہر و عکاس ہے اور اس کی بنیاد وہ مناقب ہیں جوراقم نے وقتاً فوقتاً اپنے مشائخ خصوصاً پیرومرشد رحمہ اللہ کی شان میں بزبان فارسی و اردو لکھے اور آپ کی خدمت میں پیش کرنے کا شرف حاصل کیا۔ اس طرح دیگر اکابر کی شان میں لکھے گئے مناقب کو بھی اس میں شامل کرکے مستقل مجموعہ کی شکل دے دی گئی ہے۔\nفارسی، اردو اور پنجابی زبانوں میں پیش کیا گیا۔ یہ ارمغان عقیدت ہے جو سالہا سال کی ریاضت کا نچوڑ اور مبتدیانہ اظہار عقیدت کا ادنیٰ سا مظاہرہ ہے گویا کہ:\n\nمور مسکیں ہوسے داشت کہ در کعبہ رسد\nدست بر پائے کبوتر زد و ناگاہ رسید\n\n(حسن سجزی)\nکا مصداق ہے۔\n\nحضرت محبوب الٰہی خواجہ نظام الدین اولیاء  رحمہ اللہ فرماتے ہیں:\nذکر الشیخ فی الکلام کالملح فی الطعام او کالرّوح فی الاجسام۔\n\nکلام میں پیرومرشد کا تذکرہ ایسے ہے جیسے کھانے میں نمک یا جسم میںروح سو اس ناچیز نے بھی اس محاسن نگاری کو شکرانہ منعم کا ایک ذریعہ اور بہانہ بنا کر اظہار تشکر کی حقیر سی کوشش کی ہے۔\nگر قبول افتد زہے عزّو شرف\n\nمحمد شہزاد مخلص المجددی\nدارالاخلاص لاہور\n\n۲۵ صفر المظفر ۱۴۳۶ھ\nدسمبر۲۰۱۴ء"
  },
  {
    "id": 163,
    "title": "حصہ اُردو",
    "description": "(عند ذکرالصالحین تتنزل الرحمۃ)\nجہاں صالحین کا ذکر ہو وہاں رحمت اُترتی ہے\n\nمناجات بدرگاہِ قاضی الحاجات\nخدایا رحم فرما سیّدِ کونین کا صدقہ\n\nہماری جھولیاں بھر سرورِ دارین کا صدقہ\nعطا ہو سائلوں کو بارگاہ پاک سے کچھ تو\n\nرفیقِ غار یعنی ثانی اثنین کا صدقہ\nعدالت بخش دے فاروق اعظم کے وسیلے سے\n\nسخاوت کر عطا عثمان ذوالنورین کا صدقہ\nعلوم حیدر کرار سے حصہ ملے ہم کو\n\nعلی کے نام سے پہلے ہے جو اس عین کا صدقہ\nبفیض سیّدہ زہرا حیا و شرم دے ہم کو\n\nحمیّت ہو عطا اس قوم کو حسنین کا صدقہ\nمرا سینہ بھی نورِ حکمت و عرفان سے بھر دے\n\nالٰہی! اہل بیت مصطفی سبطین کا صدقہ\nبچا راہِ صفا کی مشکلوں سے اور خطروں سے\n\nالٰہی! غوث اعظم سید ثقلین کا صدقہ\nبفیض نقشبنداں نقشبندیت پہ رکھ قائم\n\nالٰہی! میرے مرشد میرے نورِ عین کا صدقہ\nکروں خدمت میں تیرے دین کی دن رات یامولا!\n\nنوازش ہو شہِ کونین کی نعلین کا صدقہ\nرہے شہزادؔ کو نسبت سدا شیخ مجدد سے\n\nخدایا قلب ذاکر کے سکون و چین کا صد"
  },
  {
    "id": 164,
    "title": "حمدیہ",
    "description": "کیا خوبیٔ ارقام ہے اللہ اللہ\nہے لفظ کہ الہام ہے اللہ اللہ\n\nاِسمِ ذاتی ہے یہ شہزادؔ کہ اسم اعظم\nہے نام کہ انعام ہے اللہ اللہ"
  },
  {
    "id": 165,
    "title": "حمد باری تعالیٰ",
    "description": "خدا کی یاد میں وہ رنگ لائی بے خودی اپنی\nبدن تو فرش پر تھا ، روح فوق از عرش تھی اپنی\n\nاُسی خلاق کے لطف و عطا کا اک کرشمہ ہے\nشعور بندگی ، اخلاق ، علم و آگہی اپنی\n\nاُسی کے فضل سے عرض و سما میں اک توازن ہے\nاُسی کے لطف پیہم سے رواں ہے زندگی اپنی\n\nکبھی شکل پیمبر میں نوازا نور سے اپنے\nکبھی قرآن کی صورت میں بھیجی روشنی اپنی\n\nخدا کی بندگی کا دور دورہ ہوگیا ہر سو\n’’عرب کے چاند نے پھیلائی جس دم روشنی اپنی‘‘\n\nمنور ہو گئے ظلمت کدے تہذیب عالم کے\n’’عرب کے چاند نے پھیلائی جس دم روشنی اپنی‘‘\n\nدیا پہلے تناسب آدم خاکی کے پتلے کو\nپھر امر کُن کہا اور روح اس میں پھونک دی اپنی\n\nکوئی لمحہ بھی ذکر ذات باری سے نہ خالی تھا\nگزاری یادِ حق میں شاہِ دیں نے ہر گھڑی اپنی\n\nضیائے اسمِ ذاتِ پاک سے دل ہو گیا تاباں\nجمالِ نورِ حق سے چھٹ گئی تیرہ شبی اپنی\n\nبفیض اقتدا و اتباع سرورِ عالم\nہوئی مقبول پیش حق تعالیٰ بندگی اپنی\n\nکرم کا ہر گھڑی شہزادؔ پر تم سائباں رکھنا\nخدایا! کھل گئی ہے آج مجھ پر بے بسی اپنی"
  },
  {
    "id": 166,
    "title": "نعتیہ",
    "description": "بڑھے ہیں حد سے زیادہ مرے گناہ حضور\nنہیں ہے نفس سے ممکن مرا نباہ حضور\n\nمجھے عطا ہو توجہ کا ایسا حصن حصین\nکہ خواہشات کو سوجھے نہ کوئی راہ حضور"
  },
  {
    "id": 167,
    "title": "نعت شریف",
    "description": "ہے آن پڑی مشکل سر پر سرکار کرم فرما دیجے\nفریاد کناں ہے چشم تر سرکار کرم فرما دیجے\n\nکشکول گدائی بن کے کھڑے ہیں منگتے سر سے تابقدم\nکافی ہے کرم کی ایک نظر سرکار کرم فرما دیجے\n\nہر سمت ہیں غفلت کے سائے باہم ہیں مقابل ماں جائے\nبھٹکی پھرتی ہے نوعِ بشر سرکار کرم فرما دیجے\n\nاے زہرا وزینب کے بابا! کمیاب ہوئی ہے چشم حیا\nبے راہ روی سی ہے گھر گھر سرکار کرم فرما دیجے\n\nادراک سے عاری قوم ہوئی ، خواہش کی پجاری قوم ہوئی\nاب ہم کو نہیں ہے اپنی خبر سرکار کرم فرما دیجے\n\nہونٹوں پہ ثناء کے ہوں نغمے ہاتھوں میں درودوں کے گجرے\nقسمت میں ہو یوں طیبہ کا سفر سرکار کرم فرما دیجے\n\nہر وقت یہاں ہو مدح و ثنا ہر سمت ہو ذکر صل علیٰ\nہو نعت نگر شہزادؔ کا گھر سرکار کرم فرما دیجے"
  },
  {
    "id": 168,
    "title": "شانِ روح القدس علیہ السلام",
    "description": "زینتِ خلدِ بریں مرغ سلیمانِ عرب\nسب فرشتوں سے حسیں مرغ سلیمانِ عرب\n\nبلبلِ باغِ دنیٰ ، نغمہ گر حمد و ثنا\nطائرِ سدرہ نشیں مرغ سلیمانِ عرب\n\nمرسلِ ربِّ علا ، حاملِ وحی مولا\nیعنی جبریلِ امیں مرغ سلیمانِ عرب\n\nزمزمہ خوانِ علق ، محکی آیات فلق\nطوطی ماہ جبیں مرغ سلیمانِ عرب\n\nپر کشا رہتا ہے لاہوت کی پہنائی میں\nبرجِ سدرہ کا مکیں مرغ سلیمانِ عرب\n\nمستعد رہتا ہے فرمان بجا لانے کو\nعرشِ اعلیٰ کے قریں مرغ سلیمانِ عرب\n\nنور تھا ، نورِ خدا ، نور کی جانب لایا\nصورتِ وحی مبیں مرغ سلیمانِ عرب\n\nبابِ جبریل جو ہے روضۂ اقدس کے قریں\nٹھہرا کرتا تھا یہیں مرغ سلیمانِ عرب\n\nآرزو ہے تیرے دیدار کی دل کو لیکن\nدید کی تاب نہیں مرغ سلیمانِ عرب\n\nتیرے اشعار سے شہزادؔ یہی لگتا ہے\nتو نے دیکھا ہے کہیں مرغ سلیمانِ عرب"
  },
  {
    "id": 169,
    "title": "منقبت",
    "description": "اُمِّ رسول رضی اللہ عنہا\nمطلعٔ والضحیٰ ، اُمِّ خیرالوریٰ\n\nمرجعٔ مصطفی ، اُمِّ خیرالوریٰ\nپاک مثل صبا ، اُمِّ خیرالوریٰ\n\nامن سرتابہ پا ، اُمِّ خیرالوریٰ\nمادرِ مشفق و مہربان نبی\n\nسیدہ ، آمنہ ، اُمِّ خیرالوریٰ\nحاملِ نور ِ خالق ہے اُن کا شکم\n\nروشنی کی بنا ، اُمِّ خیرالوریٰ\nبت پرستی کے ماحول میں رہ کے بھی\n\nتھیں بتوں سے جدا ، اُمِّ خیرالوریٰ\nاُن کی رَگ رَگ میں تاثیر سرکار تھی\n\nمادرِ باصفا اُمِّ خیرالوریٰ\nقربِ محبوب باری کے فیضان سے\n\nہیں قریبِ خدا ، اُمِّ خیرالوریٰ\nہیں خدیجہ کی وہ مادرِ نسبتی\n\nجدّئہ زاہرا ، اُمِّ خیرالوریٰ\nجس کو بیٹے کی نسبت سے عظمت ملی\n\nہے وہی والدہ اُمِّ خیرالوریٰ\nپیکرِ عصمت و عفت و آشتی\n\nطیّبہ ، طاہرہ ، اُمِّ خیرالوریٰ\nچھوڑ کر جگ سے شہزادؔ رخصت ہوئی\n\nخیر کا سلسلہ اُمِّ خیرالور"
  },
  {
    "id": 170,
    "title": "گوشۂ خلفاء راشدین رضی اللہ عنہم",
    "description": "کیا شان نبی کے یاروں کی\nتفسیر ہیں یہ سیپاروں کی\n\nصدّیق و عمر ، عثمان و علی\nکوئی مثل نہیں ان چاروں کی"
  },
  {
    "id": 171,
    "title": "گوشۂ صدّیق اکبرص",
    "description": "چہ دارد اوبرائے یارِ غارے\nخدا داند جزائے یار غارے\n\nمتاعِ کل بہ پیغمبر فدا کرد\nدل و جانم فدائے یار غارے\n\n…………\nچومست بادئہ صدّیق ہستم\n\nرواں برجادئہ صدّیق ہستم\nبرائے غیر در دل نیست جائے\n\nکہ من دِل دادئہ صدّیق ہس"
  },
  {
    "id": 172,
    "title": "منقبت",
    "description": "سیدنا صدیق اکبر ص\nعزم کے کو ہسار اے صدیق\n\nاے صداقت شعار اے صدیق\nآپ پر جاں نثار اے صدیق\n\nآپ دِیں کا وقار اے صدیق\nآپ ہی نے ہمیں سکھایا ہے\n\nعشق کا کاروبار اے صدیق\nکیسے کر پائے گا بھلا کوئی\n\nوصف تیرے شمار اے صدیق\nاے نبی پاک کے مزاج شناس\n\nیارِ غار و مزار اے صدیق\nملکِ صدیقیت کے اے سر تاج\n\nسر تا پا شاہکار اے صدیق\nاے بلا فصل جانشینِ رسول\n\nظلِ پروردگار اے صدیق\nثانی اثنین کا ہے سر پہ تاج\n\nصاحب اعتبار اے صدیق\nباخدا آپ ہی سے سجتی ہے\n\nمحفلِ چار یار اے صدیق\nساتھ لے کر حضور کو آؤ\n\nمیرے گھر ایک بار اے صدیق\nمستفید آپ سے ہو گر شہزادؔ\n\nدور ہو اِنتشار اے صد"
  },
  {
    "id": 173,
    "title": "منقبت",
    "description": "حضرت سیدنا صدیق اکبر ص\nصحابہ میں ذیشان صدیقِ اکبر\n\nصداقت کے سلطان صدیقِ اکبر\nشہِ اہلِ عرفان صدیقِ اکبر\n\nمعارف کی ہیں کان صدیقِ اکبر\nکوئی مرد اُس دم مسلماں نہیں تھا\n\nہوئے جب مسلمان صدیقِ اکبر\nامامت کے قابل خلافت کے لائق\n\nتب و تابِ ایمان صدیقِ اکبر\nکروں ذکر اُن کا تو ملتی ہے راحت\n\nسکونِ دِل و جان صدیقِ اکبر\nنظر میں نبی کے جچا وقتِ ہجرت\n\nوہ خوش بخت انسان صدیقِ اکبر\nکروں در پہ آکر سلام عرض میںبھی\n\nیہ ہے میرا ارمان صدیقِ اکبر\nبھُلا کیسے سکتے ہیں اسلام والے\n\nترے پیہم احسان صدیقِ اکبر\nتری حق گزاری ، تری جاں نثاری\n\nفرشتے ہیں حیران صدیقِ اکبر\nخلیفہ بلا فصل ہیں مصطفیٰ کے\n\nبآیاتِ قرآن صدیقِ اکبر\nلقب ثانی  اثنین شہزادؔ جس کا\n\nوہ ممدوحِ رحمن صدیقِ اک"
  },
  {
    "id": 174,
    "title": "منقبت",
    "description": "حضرت سیدنا صدیق اکبر ص\nبزمِ ایماں سج گئی صدیق سے\n\nدین کو عزّت ملی صدیق سے\nدیکھئے تو قربت غار و مزار\n\nکس قدر ہیں خوش نبی صدیق سے\nباخدا بعد از نبی بے شک ملی\n\nدین کو تابندگی صدیق سے\nچاہتا ہے گر فلاح دو جہاں\n\nسیکھ طرزِ زندگی صدیق سے\nفیضیاب عبدہٗ ہیں آپ ہی\n\nمانگ فیضِ بندگی صدیق سے\nجنگ کرتا ہے خدا کے ساتھ وہ\n\nجو رکھے ہے دشمنی صدیق سے\nحضرت فاروق و عثماں کی طرح\n\nپیار کرتے تھے علی صدیق سے\nنورِ عرفاں کا سمندر اُن کی ذات\n\nمیرے دل میں روشنی صدیق سے\nہر سلیم القلب ہے اُن پر نثار\n\nبغض رکھتا ہے شقی صدیق سے\nغیر ممکن ہے کہ ہوں شہزادؔ اب\n\nاِس جہاں میں آدمی صدیق "
  },
  {
    "id": 175,
    "title": "منقبت",
    "description": "حضرت سیدنا صدیق اکبر ص\nمقام و مرتبہ دیکھا عجب صدیقِ اکبر کا\n\nفرشتوں کے دِلوں میں ہے ادب صدیقِ اکبر کا\nوہ دیکھو ’’ثانی اثنین اذھمافی الغار‘‘ کی صورت\n\nہے خود مدح سرا قرآں میں رب صدیقِ اکبر کا\nنبی کے بعد ہے ان کا تصرف ساری امت میں\n\nعجم صدیقِ اکبر کا عرب صدیقِ اکبر کا\nخدا نے آپ تعظیمِ نبی کا حکم فرمایا\n\nسکھایا مصطفیٰ نے خود ادب صدیقِ اکبر کا\nنہ اُمُّ الخیر جیسی ماں کوئی ہو گی زمانے میں\n\nنہ ثانی کوئی پیدا ہو گا اب صدیقِ اکبر کا\nاُٹھا کر دیکھئے بے شک قریشی ہاشمی شجرہ\n\nنبی کے ساتھ ملتا ہے نسب صدیقِ اکبر کا\nکہاں میں اور کہاں مدح سرائی اللہ والوں کی\n\nکرم ہے با خُدا مجھ پر یہ سب صدیقِ اکبر کا\nدلوں میں قمقمے شہزادؔ جل اٹھتے ہیں الفت کے\n\nزباں پہ نام آ جاتا جب صدیقِ اکبر "
  },
  {
    "id": 176,
    "title": "گوشۂ فاروق اعظم  ص",
    "description": "ہو کرم کی نگاہ یا فاروق\nبھول بیٹھا ہوں راہ یا فاروق\n\nمیں گداگر ہوں آپ کے در کا\nآپ شاہوں کے شاہ یا فاروق"
  },
  {
    "id": 177,
    "title": "v",
    "description": "صدیق و عمر کا کیا کہنا\nکیا بات نبی کے یاروں کی\n\nعثمان و علی سبحان اللہ\nتعریف ہو کیا ان چاروں کی"
  },
  {
    "id": 178,
    "title": "منقبت",
    "description": "حضرت عمر فاروق   ص\nلیے دِل میں ارمانِ فاروقِ اعظم\n\nیہ سوچا لکھوں شانِ فاروقِ اعظم\nسدا لب پہ رکھتا ہے ان کے ترانے\n\nجو ہے مرتبہ دانِ فاروقِ اعظم\nرہے گاوہ محروم، عرفانِ حق سے\n\nنہیں جس کو عرفانِ فاروقِ اعظم\nاِسی میں تھی اِسلام کی سربلندی\n\nضروری تھا ایمانِ فاروقِ اعظم\nنگہبانِ اِسلام تھی ذات ان کی\n\nخدا تھا نگہبانِ فاروقِ اعظم\nتعیش نہیں تھا ذرا اُن کے گھر میں\n\nرہا فَقر سامانِ فاروقِ اعظم\nچلے یوں بساطِ سیاست کے مہرے\n\nفراست ہے قربانِ فاروقِ اعظم\nخدا کی رضا کے طریقے سکھائے\n\nہے امت پہ احسانِ فاروقِ اعظم\nشہادت ملی شہرِ خیرالورٰی میں\n\nہوئی مطمئن جانِ فاروقِ اعظم\nنہیں کروفر بادشاہی میں اُن کی\n\nہے بے کسرٰی ایرانِ فاروقِ اعظم\nہے طغیانی موج دریا کو کافی\n\nفقط ایک فرمانِ فاروقِ اعظم\nجھکاتے ہیں سر قیصرِ رُوم جیسے\n\nسکندر ہے دربانِ فاروقِ اعظم\nابوبکر ، عثمان ، حسنین و حیدر\n\nسبھی تو ہیں یارانِ فاروقِ اعظم\nمیں ہوں نقشبندی بفیض مُجدَّد\n\nہے ہاتھوں میں دامانِ فاروقِ اعظم\nمقدر تو شہزادؔ دیکھو ہمارے\n\nکہ ہیں ہم غلامانِ فاروقِ اع"
  },
  {
    "id": 179,
    "title": "منقبت",
    "description": "حضرت عمر فاروق  ص\nچمن کو ناز ہے جس پر وہی گلاب ہیں آپ\n\nنگاہِ سرورِ عالم کا اِنتخاب ہیں آپ\nجواب جس کا نہیں ہے وہ لاجواب ہیں آپ\n\nعروسِ عظمتِ دِیں کے لیے شباب ہیں آپ\nحضور آپ کی رائے کو کر رہے ہیں قبول\n\nکہ بارگاہِ الٰہی میں مستجاب ہیں آپ\nدلایا آپ نے بھیڑوں کو بھیڑیوں سے خراج\n\nدیارِ عدلِ رسالت کا ایک باب ہیں آپ\nسلام آپ کی بخت آوری کو اے فاروق\n\nمیرے حضور کی صحبت سے فیضیاب ہیں آپ\nمری کتابِ مناقب کی آپ ہیں زینت\n\nکہ حرف آپ ہیں ، لفظ آپ ہیں ، کتاب ہیں آپ\nفروغِ دین متیں آپ کے جلال سے ہے\n\nکہ تیغ سرورِ عالم کی آب و تاب ہیں آپ\nبزرگ تر ہے مقام آپ ہی کا بعد عتیق\n\nعمل میں ، علم میں ، حکمت میں لاجواب ہیں آپ\nنسیمِ لطف و عنایت ہیں مومنوں کے لیے\n\nتو کفر و شر کے لیے مظہر عذاب ہیں آپ\nاحاطہ آپ کی رفعت کا کیا کرے شہزادؔ\n\nیہ ایک ذرّہ کمتر تو آفتاب ہیں ا"
  },
  {
    "id": 180,
    "title": "منقبت",
    "description": "حضرت عمر فاروق   ص\nکنزِ یقین و صدق کا نوری گہر عمر\n\nاعزاز دِین ، صاحب نطق و نظر عمر\nہے پاسبانِ عظمتِ خیرالبشر عمر\n\nگستاخ کے لیے ہے نشانِ خطر عمر\nمحبوبِ حق ، محافظِ ناموسِ مصطفیٰ\n\nرُوحِ جلال، عظمتِ تیغ و تبر عمر\nاِس کی مثال ڈھونڈ کے لاؤں کہاں سے میں\n\nہے انتخابِ چشمِ شہِ بحر و بر عمر\nتورات میں ہیں جس کے مناقب لکھے ہوئے\n\nوہ باکمال پیکرِ علم و ہنر عمر\nحاکم کہ جس کے زیر تصرف تھے بحر و بر\n\nجو بوریہ نشین تھا وہ تاجور عمر\nشہزادؔ سب کے وردِ زباں کل بھی تھا یہ نام\n\nہے آج بھی زمانے کے لب پر عمر ع"
  },
  {
    "id": 181,
    "title": "گوشۂ عثمان ذ والنوّرین  ص",
    "description": "صدّیق صداقت کے پیکر\nفاروق کی عظمت کیا کہنا\n\nعثمان کا کیا ہو وصف بیاں\nحیدر کی شجاعت کیا کہنا"
  },
  {
    "id": 182,
    "title": "منقبت",
    "description": "حضرت عثمان غنی  ص\nجس نے مدحت کی ہے ذُوالنورین کی\n\nاس کو دولت مل گئی دارین کی\nمصطفیٰ کے لاڈلے داماد ہیں\n\nگہری نسبت ان سے ہے حسنین کی\nاس سے ہوتی ہے غنی کی ابتداء\n\nہے خصوصیت یہ حرف غین کی\nوہ رقیہ ہوں کہ عثمان غنی\n\nہیں فزوں تر عظمتیں طرفین کی\nجس سے کرتے ہیں فرشتے بھی حیا\n\nاللہ اللہ شان ذوالنورین کی\nروشنی ہے خانۂ عثمان میں\n\nسرورِ عالم کے نورِ عین کی\nدشمنی رکھتا ہے جو عثمان سے\n\nاس پہ لعنت تا ابد حسنین کی\nکر دیا شہزادؔ خُوش سرکار کو\n\nپائی عزّت اس طرح دارین "
  },
  {
    "id": 183,
    "title": "منقبت",
    "description": "سیدنا عثمان ذُوالنورین  ص\nہو گئی جس کو پہچان عثمان کی\n\nوہ زباں ہے ثنا خوان عثمان کی\nقدر کر اے مسلمان عثمان کی\n\nچھوڑ راہ فتن مان عثمان کی\nزینتِ مسندِ علم و حلم و حیا\n\nہے روش جود و احسان عثمان کی\nوقف تھے مستقل بہر دین نبی\n\nمال ، دھن ، آبرو جان عثمان کی\nدستِ عثمان ہے دستِ خیرالوریٰ\n\nاس سے بڑھ کے ہو کیا شان عثمان کی\nہیں حرم میں شہِ دیں کی دو بیٹیاں\n\nمرحبا! عظمت و آن عثمان کی\nعشق تھا ان کو قرآن سے اس لیے\n\nمدح کرتا ہے قرآن عثمان کی\nان پہ حور و ملائک بھی عاشق ہوئے\n\nخلد ہے مرتبہ دان عثمان کی\nہادی و مھدی و صاحب رشد ہیں\n\nپرُ جواہر سے ہے کان عثمان کی\nاس کو ملتی ہے خوشنودی مصطفی\n\nبات مانے جو انسان عثمان کی\nتذکرہ یہ رفیقِ نبوت کا ہے\n\nمنقبت کب ہے آسان عثمان کی\nقدسیوں کا ہو شہزادؔ مجمع لگا\n\nمدح فرمائیں حسان عثمان "
  },
  {
    "id": 184,
    "title": "منقبت",
    "description": "سیدنا عثمانِ غنی  ص\nمجھ پہ کیسے نہ رحمت ہو رحمن کی\n\nمنقبت لکھ رہا ہوں میں عثمان کی\nجس کے فضل و شرف پر ہے شاہد خدا\n\nجس کے شایاں ہیں آیات قرآن کی\nنوُر والے سے دو نُور جس کو ملے\n\nمثل کوئی نہیں ، ابن عفان کی\nعلم و حلم و حیا ، صبر ، جود و سخا\n\nہیں یہ سب خوبیاں ایک انسان کی\nسیرت و صورت مصطفی کی جھلک\n\nزندگی تھی کہ تفسیر فرقان کی\nپھر سے روح سخاوت کو زندہ کیا\n\nدین پر اپنی ہر چیز قربان کی\nجس نے خالق سے جنت کا سودا کیا\n\nہے عجب شان سخیوں کے سلطان کی\nایسا تاجر جسے قاسم خلد نے\n\nبخش دی ملکیت باغ رضوان کی\nمصطفی سے کیا قول پورا کیا\n\nلاج رکھی ہراک عہد و پیمان کی\nذِکر ان کا ہے شہزؔاد روحِ یقیں\n\nعشق ان کا علامت ہے ایمان "
  },
  {
    "id": 185,
    "title": "گوشہ",
    "description": "اہل بیت اطہاررضی اللہ عنہم\nدونوں عالم میں ہوئے ممتاز تر وہ خوش نصیب\n\nجن کو حاصل ہو گئی نسبت رسول اللہ کی\nآستاں اُن کا نہ ہو کیوں مرجع بے چارگاں\n\nقاضیٔ حاجات ہے عترت رسول اللہ "
  },
  {
    "id": 186,
    "title": "منقبت",
    "description": "حضرت علی المرتضیٰ  ص\nاللہ کے ولیوں کے مددگار علی ہیں\n\nمولائے جہاں خلق کے سردار علی ہیں\nسرتاج ہیں زہرا کے تو حسنین کے بابا\n\nعم زاد نبی ، حیدر کرّار علی ہیں\nوہ شیر خدا وارث فیضان رسالت\n\nاوصافِ کریمانہ میں شہکار علی ہیں\nایمان ہو ، عرفاں ہو شریعت کہ طریقت\n\nہر قافلۂ شوق کے سالار علی ہیں\nحجرے میں نظر آتے ہیں وہ فقر کا پیکر\n\nمیدان میں اللہ کی تلوار علی ہیں\nلرزہ سا ہے اِک لشکر کفّار پہ طاری\n\nباطل سے ہوئے برسر پیکار علی ہیں\nصدّیق و عمر حضرت عثمان کے ہمدم\n\nیاران شہ دین کے دلدار علی ہیں\nرفتار میں گفتار میں انداز میں یکتا\n\nاللہ رے کیا صاحب کردار علی ہیں\nتفسیر سے الحمد کی اُونٹوں کو جو بھر دیں\n\nاللہ کے وہ محرمِ اِسرار علی ہیں\nدانائے زمن ، عقدہ کشا ، شاہ ولایت\n\nہاں حکمت و عرفان کا مینار علی ہیں\nہے روئے علی دیکھنا شہزادؔ عبادت\n\nمولودِ حرم ، پیکرِ انوار علی ہ"
  },
  {
    "id": 187,
    "title": "مدحیہ قطعات",
    "description": "کیا عظمت و اکرام ہے اللہ اللہ\nہے لفظ کہ الہام ہے اللہ اللہ\n\nہرحرف میں ہے گنج معانی پنہاں\nکیا خوب علی نام ہے اللہ اللہ\n\n___________\n٭\n\nصاحب نہج البلاغہ ، فاتحِ خیبر علی\nشہر علم و حکمت و عرفان کا ہیں در علی\n\nدیکھنے کو چاہیے شہزادؔ چشم یارِ غار\nہیں بزرگی میں بلند و بالا و برتر علی"
  },
  {
    "id": 188,
    "title": "ترجماں آیات قرآنی کی ہے اُن کی زباں",
    "description": "شرحِ فرمان نبی ، شیرِ خدا کے فیصلے\nکیوں نہ اے شہزادؔ ہوں فاروق اعظم معترف\n\nہیں مدارِ عدل ، علی المرتضیٰ کے فیصلے\n___________\n\n٭\nصدیق و صداقت کے صدقے\n\nفاروق و عدالت کے صدقے\nعثماں کی سخاوت پر قرباں\n\nحیدر کی شجاعت کے صد"
  },
  {
    "id": 189,
    "title": "منقبت",
    "description": "حضرت ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا\nہے زوجۂ سرکار ابوبکر کی بیٹی\n\nہر وصف میں شہکار ابوبکر کی بیٹی\nلاریب نبی پاک کی ازواج ہیں یکتا\n\nازواج کی سردار ابوبکر کی بیٹی\nاُمت کی وہ ماں سیّد عالم کی چہیتی\n\nہے رونق گھر بار ابوبکر کی بیٹی\nہیں حفصہ و سودہ بھی اسی باغ کی کلیاں\n\nہے زینت گلزار ابوبکر کی بیٹی\nاللہ رے یہ علم ، یہ تقویٰ یہ طہارت\n\nہر رنگ میں ضوبار ابوبکر کی بیٹی\nاللہ نے قرآن میں دی ہے یہ گواہی\n\nہے صاحب کردار ابوبکر کی بیٹی\nاصحابِ نبی پوچھتے ہیں جس سے مسائل\n\nکیسی ہے سمجھدار ابوبکر کی بیٹی\nمحبوبِ خدا ، سید و سلطان عر ب سے\n\nکرتی ہے بہت پیار ابوبکر کی بیٹی\nآئینہ صدیق ہے یہ جود و سخا میں\n\nہوتی نہیں بیزار ابوبکر کی بیٹی\nکرتی ہے عطا شوہر و سرتاج کا صدقہ\n\nکرتی نہیں انکار ابوبکر کی بیٹی\nبیٹا ہوں میں صدیقۂِ کونین سی ماں کا\n\nہے میری نگہدار ابوبکر کی بیٹی\nاسماء نے بھی پائی ہے بڑی شان نرالی\n\nہے پیکر ایثار ابوبکر کی بیٹی\nپہنچاتی رہی غار میں کھانا وہ مسلسل\n\nکتنی ہے وفادار ابوبکر کی بیٹی\nقربان تری ذات پہ شہزادؔ کی ماں ہو\n\nاے پیکر انوار ابوبکر کی بی"
  },
  {
    "id": 190,
    "title": "منقبت",
    "description": "حضرت سیدہ فاطمۃ الزہر ہ رضی اللہ عنہا\nنورِ چشم مصطفی خیرالنساء\n\nزوجۂ شیر خدا خیرالنساء\nزینتِ بزم حیا خیرالنساء\n\nفخر و ناز مرتضیٰ خیرالنساء\nمادر حسنین وہ عظمت مآب\n\nیعنی بی بی فاطمہ خیرالنساء\nبیبیانِ خلد کی سردار ہیں\n\nسیدہ ، زیب النساء خیرالنساء\nرشک اہل تقویٰ و فقر و غنا\n\nپیکر صبر و رضا خیرالنساء\nفیضیابِ بارگاہ ذاتِ حق\n\nمظہر خیر الوریٰ خیرالنساء\nوہ خدا کے لاڈلے کی لاڈلی\n\nبے نقائص ، باوفا خیرالنساء\nعکس خلق رحمت کون و مکاں\n\nبے رداؤں کی ردا خیرالنساء\nمیرے سب امراض کا کامل علاج\n\nآپ کی بس اک دعا خیرالنساء\nداستاں ہے آپ کے ایثار کی\n\nبر زبان کربلا خیرالنساء\nتیرے خاد م چاند سورج سال ماہ\n\nتیری لونڈی ہے صبا خیرالنساء\nہدیہ حسن عقیدت ہو قبول\n\nاے کرم کی انتہا خیرالنساء\nبھیک دے شہزاد ؔکو اخلاص کی\n\nہے یہی بس التجا خیرالنس"
  },
  {
    "id": 191,
    "title": "منقبت",
    "description": "شان اہل بیت اطہاررضوان اللہ علیہم اجمعین\nکس زباں سے ہو بیاں فضل و کمالِ اہلِ بیت\n\nآئینہ حسن نبی کا ہے جمالِ اہلِ بیت\nقاضی حاجات ہر ہر فرد اس کنبے کا ہے\n\nپیکر صدق وصفا ہر خوش خصالِ اہلِ بیت\nکس کے دامن میں نہیں خیرات ان کے فیض کی\n\nہے مسلّم دہر میں جود و نوالِ اہلِ بیت\nسرور دیں کے شمائل سے ملا حصہ انہیں\n\nپیکرِ صدق و صفا ہر خوش خصالِ اہلِ بیت\nبدر کے میدان سے تا ریگ زار کربلا\n\nہر جگہ غالب رہا جاہ و جلالِ اہلِ بیت\nان کو ورثے میں ملے ہیں علم وحلم و صدق وعدل\n\nعکس آیات مبیں ہیں قال و حالِ اہلِ بیت\nان کی خوشنودی میں پنہاں ہے رضا سرکار کی\n\nکب گوارا مصطفی کو ہے ملالِ اہلِ بیت\nمنبر نوک سناں سے اس طرح خطبہ دیا\n\nآیۂ قرآں ہوئی زیب مقالِ اہلِ بیت\nایسا گھر شہزادؔ تاریخ نبوت میں نہیں\n\nڈھونڈ کر لائے بھلا کوئی مثالِ اہلِ ب"
  },
  {
    "id": 192,
    "title": "منقبت",
    "description": "حضرت قاسم و اکبررضی اللہ عنہم\nکیسے بیاں ہوں قاسم و اکبر کی عظمتیں\n\nدونوں ہی گلستان رسالت کے پھول ہیں\nابن حسین یہ ہے تو ابن حسن ہے وہ\n\nدونوں جوان رونق صحن بتول ہیں\nشیر خدا کا خون رگوں میں ہے موج زن\n\nسیکھے ہوئے انھوں نے وفا کے اصول ہیں\nمیدان میں وہ قاسم و اکبر کا رعب و جوش\n\nگویا کہ دونوں شیر خدا و رسول ہیں\nمعلوم تھا حسین کے ہر جاں نثار کو\n\nفتح و ظفر حسین کے پائوں کی دھول ہیں\nجن کے دلوں میں بغض ہے آل رسول کا\n\nشہزادؔ بس وہ لوگ جہاں میں فضول ہ"
  },
  {
    "id": 193,
    "title": "گوشۂ حسنین کریمینرضی اللہ عنہم",
    "description": "حسین گلشن زہرا کا اک معطر پھول\nحسین مظہرِ اوصافِ مرتضائی ہے\n\nحسین وارث سرمایۂ شہ لولاک\nحسین قاسم فیضانِ مصطفائی ہے"
  },
  {
    "id": 194,
    "title": "قطعہ",
    "description": "وفا و صبر کا پیکر ٗ صداقتوں کا سفیر\nحسین سبط نبی ہے ٗ حسین ابن علی\n\nجسے نواز دے شہزادؔ نورِ عین بتول\nوہی ہے غوث ، وہی قطب ہے وہی ہے ولی"
  },
  {
    "id": 195,
    "title": "منقبت",
    "description": "حضرت امام حسن مجتبیٰص\nآج لب پر ہے نامِ امامِ حسن\n\nلکھ رہا ہوں سلامِ امامِ حسن\nمصطفی نے جسیـ ’’ـابنی ھذٰا‘‘ کہا\n\nاللہ اللہ مقامِ امامِ حسن\nراکب دوش سلطان کون ومکاں\n\nدیکھئے احتشامِ امامِ حسن\nپیشوائے امامِ حسین آپ ہیں\n\nکیجئے احترامِ امامِ حسن\nفیض یاب لعاب شہ دوسرا\n\nقول حق ہے کلامِ امامِ حسن\nوہ گل گلشن سید انس و جاں\n\nرشک عنبر مشام امامِ حسن\nتاج دار جہان سخا و عطا\n\nواہ لطف دوامِ امامِ حسن\nہر سوالی کو دامن سے بڑھ کر دیا\n\nدیکھئے فیض عامِ امامِ حسن\nبعد والے سبھی ان کے ہیں مقتدی\n\nمصطفی ہیں امام امام حسن\nاس کے قدموں میںشہزادؔ شاہی رہی\n\nہو گیا جو غلامِ امامِ ح"
  },
  {
    "id": 196,
    "title": "منقبت",
    "description": "حضرت امام حسین ص\nمصداق حرفِ آیۂ تطہیر ہیں حسین\n\nمرآۃ لاالہ کی تنویر ہیں حسین\nآئینہ استعانت صبر و صلوٰۃ کا\n\nآیات بیّنات کی تفسیر ہیں حسین\nمظہر ہیں سرّ آیۂ ذِبحِ عظیم کا\n\nاک لازوال خواب کی تعبیر ہیں حسین\nسیرت میں خلق سرورِ کونین کی شبیہ\n\nصورت میں بھی حضور کی تصویر ہیں حسین\nریحان و رَوحِ گلشن سلطان دو جہاں\n\nخوشبوئے خلد عدن کی تشہیر ہیں حسین\nپردیس میں ہر ایک غریبُ الوطن کا ناز\n\nتشنہ لبی کی دہر میں توقیر ہیں حسین\nسیراب کر دیا چمن دین مصطفی\n\nتا حشر رُوحِ نعرئہ تکبیر ہیں حسین\nحاصل ہے مجھ کو بیعتِ شبیر کا شرف\n\nشہزادؔ میں مرید ہوں اور پیر ہیں حس"
  },
  {
    "id": 197,
    "title": "منقبت",
    "description": "حضرت امام حسین ص\nشجاعتوں کی داستاں حسین ہیں حسین ہیں\n\nحقیقتوں کے رازداں حسین ہیں حسین ہیں\nبھلا سکی نہ آج تک جنہیں زمین کربلا\n\nوہی امیر کارواں حسین ہیں حسین ہیں\nملا ثبات دین کو امام ہی کے خون سے\n\nشہادتوں کا اک جہاں حسین ہیںحسین ہیں\nفرات کے لبوں پہ بھی انھیں کی ہیں حکایتیں\n\nدہن دہن ، زباں زباں ،حسین ہیں حسین ہیں\nیزیدّیت تو ریگزارِ کربلا میں دب گئی\n\nرگِ حیات میں رواں حسین ہیں حسین ہیں\nسوارِ دوش مصطفی ، سکون قلب مرتضیٰ\n\nشعار دیں کے پاسباں حسین ہیں حسین ہیں\nرسوخ عزم فاطمہ کا عکس اُن کی ذات ہے\n\nکلام حق کے ترجماں حسین ہیں حسین ہیں\nحسین تر ہے گلشن رسول کا ہر ایک گل\n\nجمال روئے گلستاں حسین ہیں حسین ہیں\nلٹا دیئے رہ خدا میں شیرِ خوار و نوجواں\n\nنثارِ حق بہ قلب و جاں حسین ہیں ، حسین ہیں\nجہاں میں اب جہاں جہاں ہے ذکر لا الٰہ کا\n\nہو آنکھ تو وہاں وہاں حسین ہیں حسین ہیں\nعلی ، عباس ، حُر ، سبھی اِمام ہی کے رنگ ہیں\n\nکہیں عیاں ، کہیں نہاں حسین ہیں حسین ہیں\nمجھے ہے فخر انتساب فاطمہ کے لال سے\n\nزمیں ہوں میں تو آسماں حسین ہیں حسین ہیں\nخطر ہے شاہزادؔ کیا مجھے کسی یزید سے\n\nکہ میرے سر کا سائباں حسین ہیں حسین ہ"
  },
  {
    "id": 198,
    "title": "سلام بحضور امام عالی مقامص",
    "description": "رسول پاک نے یونہی گلو نہ چوما تھا\nرگِ حسین سے اک دن لہو ٹپکنا تھا\n\nعلی کے لال کو دیکھے گی ایسی حالت میں\nزمین کرب و بلا نے کبھی نہ سوچا تھا\n\nلیا عنایت باری نے بڑھ کے دامن میں\nکچھ اس خشوع سے اصغر کا جسم تڑپا تھا\n\nاسی امام کی طاعت پہ منحصر ہے نجات\nبلا کے دشت میں حُر ہی یہ بات سمجھا تھا\n\nنکل کے سبطِ نبی نے یزیدّیت کے خلاف\nخدا کے دین کا پرچم بلند کرنا تھا\n\nلرز گئے تھے در و بام قصرِ باطل کے\nجلال، اکبر ذیشان کا کچھ ایسا تھا\n\nشہید ہو گئے جس دم وفا شعار تمام\nفرات رنج کی حالت میں سر پٹکتا تھا\n\nفضا نڈھال تھی شہزادؔ غم کی شدت سے\nیزیدیوں کے مقابل حسین تنہا تھا"
  },
  {
    "id": 199,
    "title": "مناقب حسینص",
    "description": "ہر دور کو شعور دیا ہے حسین نے\nانسانیت کو نور دیا ہے حسین نے\n\nپہچاننے لگا ہے زمانہ یزید کو\nغافل کو وہ حضور دیا ہے حسین نے\n\nاب چار سو ہے معرکۂ کربلا بپا\nایمان کو وفور دیا ہے حسین نے\n\nاُس کیفیت کا لطف شہیدوں سے پوچھئے\nجس کیف کو ظہور دیا ہے حسین نے\n\nکرنا کسی بھی طور نہ بیعت یزید کی\nایک درس یہ ضرور دیا ہے حسین نے\n\nہوتا ہے جس میں جابجا باطل سے اختلاف\nوہ جادئہ امور دیا ہے حسین نے\n\nشہزادؔ جب بھی نام لیا ہے حسین کا\nہر دم نیا سرور دیا ہے حسین نے"
  },
  {
    "id": 200,
    "title": "منقبت",
    "description": "بحضور امام عالی مقام امام حسین ص\nصبر و سخا و علم وراثت حسین کی\n\nہے لازوال دولت و ثروت حسین کی\nکس درجہ منفرد ہے عبادت حسین کی\n\nمرگ یذیدیت ہے شہادت حسین کی\nرکھتی ہے ایک مرشد کامل کا مرتبہ\n\nہے پیشوائے دہر عزیمت حسین کی\nتازہ رہے گی حشر تک کرب و بلا کی یاد\n\nہر سال بڑھ رہی ہے ضرورت حسین کی\nہے پوچھنا تو اہل نجابت سے پوچھئے!\n\nکتنی بڑی ہے شان میں نسبت حسین کی\nکچھ کم نہیں ہے خلد سے آغوش فاطمہ\n\nہے پاس ہی حسین کے جنت حسین کی\nخنجر کی نوک اور لہو سے لکھی گئی\n\nقرطاس کربلا پہ حکایت حسین کی\nسرچشمۂ حیات ہے اب دشت نینوا\n\nکچھ دن اسے ملی ہے رفاقت حسین کی\nلو دیں گے یونہی اسوئہ شبیر کے نقوش\n\nکرتی رہے گی خلق اطاعت حسین کی\nآیات بیّنات میں ڈھونڈ اس کا مرتبہ\n\nروح الامیں سے پوچھ فضیلت حسین کی\nفرعون تا یزید ہے اک شر کا سلسلہ\n\nاک خیر مستقل ہے طبیعت حسین کی\nخارج ہے وہ حسین کے نانا کے دین سے\n\nجو مانتا نہیں ہے امامت حسین کی\nشہزادؔ اہل بیت نبوّت سے پوچھئے\n\nمعلوم ہے انہی کو حقیقت حسین "
  },
  {
    "id": 201,
    "title": "منقبت",
    "description": "امام عالی مقامص\nکرتی ہے منکشف کئی اسرار کربلا\n\nقدرت کے فیصلوں کا ہے اظہار کربلا\nدیکھا ہے اس نے منظر مظلومی امام\n\nاب مستقل رہے گی عزادار کربلا\nوابستہ ہوگئی ہے یہ ٓالِ رسول سے\n\nکیوں ہو نہ روئے ارض پر شہکار کربلا\nہونا تھا تجھ کو مشہد سبط شہ رسل\n\nکرتے تھے تیرا ذکر جو سرکار ، کربلا\nتیری فضا میں رچ گئی تاثیر حزن کی\n\nٹوٹا تھا تجھ پہ آسماں اِک بار کربلا\nنوک سناں پہ جو کہ پڑھے تھے حسین نے\n\nکیسے لگے تھے تجھ کو وہ اذکار کربلا\nٹپکا ہے تجھ پہ خونِ رگِ غنچہ ٔ بتول\n\nگویا ہے تو بہشت کا گلزار کربلا\nتجھ کو ہیں سبط ِ نور مجسم سے نسبتیں\n\nکیسے نہ پھر ہو پیکر انوار کر بلا\nجب بھی چھڑا یزیدکی بیعت کا تذکرہ\n\nکرتی رہے گی حشر تک انکار کربلا\nچومے ہیں تو نے حضرت شبیر کے قدم\n\nہے یادگار اب ترا کردار کربلا\nشہزادؔ چاہتی ہے یہ ہر حُر مزاج کو\n\nہے ہر یزید وقت سے بے زار کرب"
  },
  {
    "id": 202,
    "title": "منقبت",
    "description": "امام اعظمص\nکی ہے بلند حق نے شانِ امامِ اعظم\n\nہر اِک ولی ہے رُتبہ دانِ امامِ اعظم\nابرِ کرم ہے اُن کا ذکرِ لطیف و اطہر\n\nجُود و سخا کا مظہر خوانِ امامِ اعظم\nاَحمد۱؎ ، فضیل۲؎ ، مالک۳؎ ، حمّاد۴؎ و ابنِ ادھم۵؎\n\nاِن ہستیوں سے پوچھو شانِ امامِ اعظم\nتاجِ سرِ فقاہت قولِ ابو حنیفہ\n\nکنزِ علوم و حِکمت جانِ امامِ اعظم\nشامل ہیں جِن میں زُفر و ابویوسف و محمد\n\nرکھتی ہے وہ جواہر کانِ اِمامِ اعظم\nکشتِ حنابلہ ہو یا مزرع شوافع\n\nبرسا ہے سب پہ ابرِ بارانِ امامِ اعظم\nہر مجتہد اُنہی سے کرتا تھا اِستفادہ\n\nاہلِ نظر تھے خواجہ تا شانِ امامِ اعظم\nشہزادؔ پیشوا ہوں گر ہیثمی۶؎ و عینی۷؎\n\nپھر منقبت ہو شاید شایانِ امامِ اع"
  },
  {
    "id": 203,
    "title": "گوشۂ",
    "description": "حضرت داتا علی ہجویری رحمتہ اللہ علیہ\nمنقبت\n\nداتا گنج بخش علی ہجویری رحمتہ اللہ علیہ\nاولیائِ وقت دیکھے فیضیابِ گنج بخش\n\nکھٹکھٹاتی ہے ولایت آ کے بابِ گنج بخش\nہر گھڑی رہتا ہے یہ جو کیف سا لاہور میں\n\nگونجتا ہے آج تک اس میں خطابِ گنج بخش\nکہنہ سالی میں یہ عطر افشانیاں ہیں شیخ کی\n\nاللہ اللہ ہو گا کیا عہد شبابِ گنج بخش\nقبر مو من باغ ہے جنت کا از رُوئے حدیث\n\nباب باغِ خلد ہے لاریب بابِ گنج بخش\nپیاس رُوحو ں کی مٹا کرتی ہے اس دربار میں\n\nعلم و عرفاں سے ہے پر جام شرابِ گنج بخش\nخواجۂ اجمیر سے تا تاجدار گولڑہ\n\nکیسے کیسے باخدا ہیں باریابِ گنج بخش\nفیض جاری ہے زمانے میں شہِ ہجویر کا\n\nکشت عالم پر ہے فیض افشاں سحابِ گنج بخش\nرہنمائی آج بھی کرتے ہیں داتا خلق کی\n\nرہبر پیرانِ عالم ہے کتابِ گنج بخش\nزور جتنا بھی لگا لے نجدیت کی تیرگی\n\nروشنی دیتا رہے گا آفتابِ گنج بخش\nہند میں اسلام کا شہزاد ؔہے جب تک وجود\n\nہر گھڑی ہو گا فزوں اجر و ثوابِ گنج ب"
  },
  {
    "id": 204,
    "title": "منقبت",
    "description": "بحضور داتا گنج بخش رحمتہ اللہ علیہ\nمظہر نور خدا ، انوار داتا گنج بخش\n\nکاملوں کے رہنما سرکار داتا گنج بخش\nباعث کشف حجاب دل ہے ان کا التفات\n\nروشنی کا سلسلہ کردار داتا گنج بخش\nیاد آتا ہے خدا صورت کو اُن کی دیکھ کر\n\nگویا ہے دید خدا دیدار داتا گنج بخش\nمقتدی ہیں سیدِ ہجویر کے اہل طریق\n\nکر رہے ہیں اصفیاء تذکار داتا گنج بخش\nمرکز جملہ سلاسل ہے یہی اک بارگاہ\n\nمرجع اہل ولا دربار داتا گنج بخش\nکشف محجوب آپ کی بے مثل تصنیف لطیف\n\nمصحف مرشد نما شہکار داتا گنج بخش\nپیٹ بھرتا ہے تہی دست و تونگر کا یہاں\n\nبے کسوں کا آسرا بازار داتا گنج بخش\nچار سو اس میں کھلے ہیں علم و عرفاں کے گلاب\n\nخوشنما و دلکشا ، گلزار داتا گنج بخش\nقرب ہے شہزادؔ ان کا شیخ ہندی کو نصیب\n\nدہر میں جو تھا علم بردار داتا گنج ب"
  },
  {
    "id": 205,
    "title": "منقبت",
    "description": "حضرت داتا گنج بخش علی ہجویری رحمتہ اللہ علیہ\nاے خوشا! لب پر بیاں ہے سید ہجویر کا\n\nتذکرہ تسکین جاں ہے سید ہجویر کا\nنام لیوا اک جہاں ہے سید ہجویر کا\n\nنقش تازہ و جواں ہے سید ہجویر کا\nبجھ رہی ہے آج بھی قلب و زباں کی تشنگی\n\nچشمۂ شیریں رواں ہے سید ہجویر کا\nمستفیض بارگہ ہیں سالک و مجذوب سب\n\nمصدرِ لُطف آستاں ہے سید ہجویر کا\nدست بستہ قدسیوں کو دیکھتا ہے اس جگہ\n\nمرتبہ جس پر عیاں ہے سید ہجویر کا\nحاضر دربار ہیں چاروں سلاسل کے شیوخ\n\nجس کو دیکھو مدح خواں ہے سید ہجویر کا\nخواجہ اجمیر ہوں یا تاجدار گولڑہ\n\nمعترف ہر نکتہ داں ہے سید ہجویر کا\nکیوں نہ اے شہزادؔپھر لاہور ہو قطب البلاد\n\nآستانہ جو یہاں ہے سید ہجویر "
  },
  {
    "id": 206,
    "title": "منقبت",
    "description": "حضرت داتا گنج بخش علی ہجویری رحمتہ اللہ علیہ\nشہرہ جگ میں گھر گھر ہے مخدوم علی ہجویری کا\n\nآج ترانہ لب پر ہے مخدوم علی ہجویری کا\nقبرہے جنت کا باغیچہ ازروئے فرمانِ نبی\n\nروضہ، خلد برابر ہے مخدوم علی ہجویری کا\nاُن کی یاد سے رحمت بر سے اُن کی بات سے ہو بخشش\n\nرحمت ذکر سراسر ہے مخدوم علی ہجویری کا\nدل کی مرادیں آج بھی طالب اس چوکھٹ سے پاتے ہیں\n\nفیض بھرا ایسا دَر ہے مخدوم علی ہجویری کا\nآج بھی بھوکے اس دَر سے دو وقت کی روٹی کھاتے ہیں\n\nآج بھی جاری لنگر ہے مخدوم علی ہجویری کا\nہم داتا کے سائے میں آباد ہیں کتنی صدیوں سے\n\nسایۂ شفقت ہم پر ہے مخدوم علی ہجویری کا\nاُس کو ولی اللہ نہ سمجھو سنت کا جو تارِک ہو\n\nدرس ہمیں یہ ازبر ہے مخدوم علی ہجویری کا\nخوش بختی شہزادؔ ہماری ، ہم لاہور میں رہتے ہیں\n\nہم کو قرب میسّر ہے مخدوم علی ہجویری کا\nہم ہیں پاکستانی اور شہزادؔ ہمارے پرچم پر\n\nپرچم سایہ گستر ہے مخدوم علی ہجویری "
  },
  {
    "id": 207,
    "title": "منقبت",
    "description": "حضرت داتا گنج بخش رحمتہ اللہ علیہ\nحاضر ہے ترے در پہ گدا سید ہجویر!\n\nہو اس کی طرف چشم عطا سید ہجویر!\nخطرے میں مرا پاک نگر پھر سے گھرا ہے\n\nدرکار ہے پھر تیری دعا سید ہجویر!\nجاری رہے لنگر ترے فیضان کرم کا\n\nاے مظہرِ انوار خدا سید ہجویر!\nہو خیر ترے بابِ عنایات و عطا کی\n\nہوتا رہے منگتوں کا بھلا سید ہجویر!\nدربار تو ولیوں کے جہاں بھرمیں کئی ہیں\n\nہے شان ترے در کی جدا سید ہجویر!\nتو مظہرِ اوصافِ شہ کون و مکاں ہے\n\nاقطاب ترے مدح سرا سید ہجویر!\nحاضر ہیں ترے در پہ فرشتوں کی قطاریں\n\nعاشق ترے مردان خدا سید ہجویر!\nکشافِ حجابات ہر اک حرف ہے تیرا\n\nاے راہبر و راہنما سید ہجویر!\nبھرتے ہیں کئی پیٹ ترے خوانِ کرم سے\n\nاے مرجعِ مخلوقِ خدا سید ہجویر!\nہے تاج ترے سر پہ سیادت کا فروزاں\n\nاے وارث لولاک لما سید ہجویر!\nدر کار ہے خدّام کو بھی دل کی صفائی\n\nمطلوب ہے اب صدق و صفا سید ہجویر!\nجاری رہے لنگر ترا تا روز قیامت\n\nشہزادؔ کے ہے دل کی دُعا سید ہجوی"
  },
  {
    "id": 208,
    "title": "گوشۂ غوثیہص",
    "description": "غلام غوث اعظم ہوں ، گدائے نقشبنداں ہوں\nتعلق ہے بحمداللہ مرا چاروں سلاسل سے\n\nمیں چشتی قادری شہزادؔ سیفی سہروردی ہوں\nمجھے کیا خوف ہو سکتا ہے پھر مدمقابل سے"
  },
  {
    "id": 209,
    "title": "رباعی",
    "description": "اے عاشق مستانۂ عبدالقادر\nمے نوش ز پیمانۂ عبدالقادر\n\nاحوال تو فرزانگی آموز جہاں باد\nاے دل شدی دیوانۂ عبدالقادر"
  },
  {
    "id": 210,
    "title": "منقبت",
    "description": "سیدنا غوث اعظم  ص\nزمین کیا آسماںبھر میں ہے چرچا غوثِ اعظم کا\n\nلگائیں کان جس جانب ہے شہرہ غوثِ اعظم کا\nکمالات ولایت میں شہِ بغداد لاثانی\n\nبلندی پر رہا پرچم ہمیشہ غوثِ اعظم کا\nکرامات و تصرف میں عجب قدرت ملی ان کو\n\nہر اک انداز ہے بے شک نرالا غوثِ اعظم کا\nطریقت میں اگر اپنی کبھی پرواز رک جائے\n\nوظیفہ ہم کیا کرتے ہیں بس یاغوثِ اعظم کا\nہوئے ظاہر مگر پھر چھپ گئے پہلے سبھی سورج\n\nرہے گا تا ابد سورج چمکتا غوثِ اعظم کا\nقدم اُس پیر پیراں کا ولی گردن پہ رکھتے ہیں\n\nہے بوسہ گاہ اہل عشق تلوا غوثِ اعظم کا\nفرشتے جن و انساں سب عقیدت مند ہیں ان کے\n\nخدا ہی جانتا ہے کیا ہے رتبہ غوثِ اعظم کا\nاگرچہ سلسلہ شہزادؔ میرا نقشبندی ہے\n\nدل و جاں سے ہوں لیکن نام لیوا غوثِ اعظم "
  },
  {
    "id": 211,
    "title": "منقبت",
    "description": "حضرت شیخ عبدالقادر جیلانی رحمتہ اللہ علیہ\nکرم کا پیکر ہیں غوثِ اعظم\n\nغریب پرور ہیں غوثِ اعظم\nہمارے رہبر ہیں غوثِ اعظم\n\nمہِ منور ہیں غوثِ اعظم\nہوئے ہیں یا جتنے غوث ہوں گے\n\nسبھی کے افسر ہیں غوثِ اعظم\nقدم ہے گردن پہ ہر ولی کی\n\nجہاں کے سرور ہیں غوثِ اعظم\nوہ بازِ أشہب شہ ولایت\n\nخدا کا مظہر ہیں غوثِ اعظم\nکمال ایمان و معرفت کی\n\nبلندیوں پر ہیں غوثِ اعظم\nنبی کا شہزادؔ عکس ہیں وہ\n\nشبیہِ حیدر ہیں غوثِ اع"
  },
  {
    "id": 212,
    "title": "گوشۂ اصفیاء رحمتہ اللہ علیہ",
    "description": "حُبّ درویشاں کلیدِ جنت است\nدشمنِ ایشاں سزائے لعنت است\n\n(حافظ شیرازی)\nمنقبت\n\nحضرت بابا فرید الدین مسعود گنج شکر رحمتہ اللہ علیہ\nہدایت کا روشن ستارہ فرید\n\nطریقت ہے دریا تو دھارا فرید\nعقیدت نظر ہے نظارہ فرید\n\nولایت ہے کشتی کنارا فرید\nتصرّف کی دنیا کا وہ تاجدار\n\nبلندی کا ہے استعارہ فرید\nہمیں ڈوب جانے کا خطرہ نہیں\n\nہے ہم بیکسوں کا سہارا فرید\nسبق خوان لوح قضا اس کی ذات\n\nہے انگشت حق کا اشارہ فرید\nمقامات اس کے ہوں کیسے بیاں\n\nہے جس کاملہ کا دلارا فرید\nہوا زہد و تقویٰ سے آراستہ\n\nبہر رنگ ماں نے سنوارا فرید\nوہ وارث رسولوں کے اسرار کا\n\nخداوند عالم کا پیارا فرید\nخضر اس کے ہم مجلس و راز دار\n\nمعارف کا اونچا منارا فرید\nوہیں پر ہے شہزادؔ جنت کا باغ\n\nجہاں ضوفشاں ہے ہمارا فر"
  },
  {
    "id": 213,
    "title": "منقبت",
    "description": "حضرت خواجہ بہاء الدین شاہِ نقشبندرحمتہ اللہ علیہ\nاولیاء میں منفرد ہے شان شاہِ نقشبند\n\nاصفیاء کے دل میں ہے ارمان شاہِ نقشبند\nکاملوں نے خوشہ چینی آپ کے خرمن سے کی\n\nواصلوں کے لب پہ ہے فرمان شاہِ نقشبند\nاللہ اللہ رفعت پرواز فخر خواجگاں\n\nطائران قدس ہیں قربان شاہِ نقشبند\nنقشبندیت کا مرکز ہے بخارا کی زمیں\n\nقاسم فیض ولایت کان شاہِ نقشبند\nجانشین خواجگاں ہیں خطہ سرہند میں\n\nشیخ احمد مظہر فیضان شاہِ نقشبند\nعلم و حکمت ، نور با طن ، عشق و مستی ، جذب و شوق\n\nراہ حق میں ہے یہی سامان شاہِ نقشبند\nہم کو بخشاہے نہایت در ہدایت کا شعور\n\nہم غلاموں پر ہے یہ احسان شاہِ نقشبند\nعارفوں میں ہم اسے شہزادؔ کرتے ہیں شمار\n\nجس کو حاصل ہو گیا عرفان شاہِ نقشب"
  },
  {
    "id": 214,
    "title": "منقبت",
    "description": "حضرت بہاء الدین زکریا ملتانی رحمتہ اللہ علیہ\nسرگروہ اولیاء حضرت بہاء الدین ہیں\n\nپیشوائے اصفیا حضرت بہاء الدین ہیں\nزیور اوصاف حق سے ہے مزیّن ہر ادا\n\nعکسِ حسن کبریا حضرت بہاء الدین ہیں\nمہر چرخ سہرورد و نائب شیخ الشیوخ\n\nرونق بزم ھدٰی حضرت بہاء الدین ہیں\nحامل زہد و ریاضت ، پیکر علم و عمل\n\nصاحب صدق و صفا حضرت بہاء الدین ہیں\nسرور کونین کی سیرت کا اک عکس جمیل\n\nخوش خصال و خوش ادا حضرت بہاء الدین ہیں\nہاتھ پھیلائے کھڑے ہیں بادشاہان جہاں\n\nمائل جود و سخا حضرت بہاء الدین ہیں\nعلم و عرفان و عمل کا ایک بحر بے کراں\n\nقاسم عشق خدا حضرت بہاء الدین ہیں\nواقف شرع و طریقت جامع عشق و خرد\n\nجانشین انبیاء حضرت بہاء الدین ہیں\nثبت ہیں القاب جس کے تختی تقدیر پر\n\nوہ امام الازکیاء حضرت بہاء الدین ہیں\nکیوں نہ اے شہزادؔ ان کی قبر ہو جنت کا باغ\n\nعاشق خیرالورٰی حضرت بہاء الدین ہ"
  },
  {
    "id": 215,
    "title": "منقبت",
    "description": "خاتم الحفاظ حضرت\nامام جلال الدین سیوطی رحمتہ اللہ علیہ\n\nسراپا عشق و ایقاں ہیں جلال الدین سیوطی\nدلیل راہ ایماں ہیں جلال الدین سیوطی\n\nعطائے ذات رحماں ہیں جلال الدین سیوطی\nنبی کا ہم پہ احساںہیں جلال الدین سیوطی\n\nمسیح اہل عرفاں ہیں جلال الدین سیوطی\nکلیم طور قرآں ہیں جلال الدین سیوطی\n\nحدیث مصطفی کے نور نے چمکا دیا اُن کو\nشعاع مہر فاراں ہیں جلال الدین سیوطی\n\nشرف حاصل رہا اُن کو شہ دیں کی حضور ی کا\nگل باغ کریماں ہیں جلال الدین سیوطی\n\nکریں گے علم والے بھی شفاعت اہل عصیاں کی\nشفیع اہل عصیاں ہیں جلال الدین سیوطی\n\nہیں اُن کے مقتدی شعرانی و غزی وشامی سے\nامام اہل دوراں ہیں جلال الدین سیوطی\n\nمری اسناد میں شہزادؔ اُن کا نام نامی ہے\nکہ میرے پیر پیراں ہیں جلال الدین سیوطی"
  },
  {
    "id": 216,
    "title": "گوشۂ مجدّدیہ  رحمتہ اللہ علیہ",
    "description": "مجھے حاصل رہی ہے مستقل شفقت بزرگوں کی\nخدا نے کمسنی میں کی عطا قربت بزرگوں کی\n\nغلام شیخ سرہندی ہوں میں شہزادؔ سیفی ہوں\nبحمداللہ حاصل ہے مجھے نسبت بزرگوں کی"
  },
  {
    "id": 217,
    "title": "منقبت",
    "description": "امام ربّانی مجدد الف ثانی رحمتہ اللہ علیہ\nزمانے بھر میں ہے چرچا مجدد الف ثانی کا\n\nہر عاشق والا و شیدا مجدد الف ثانی کا\nہوائیں فیض و رحمت کی اسی گلشن میں چلتی ہیں\n\nریاض خلد ہے روضہ مجدد الف ثانی کا\nروانہ غوث اعظم نے کیا جبّہ محبت سے\n\nمقام اس میں ہے پو شیدہ مجدد الف ثانی کا\nیہی دربار ہے چاروں سلاسل کا حسیں سنگم\n\nبھرا ہے فیض سے دریامجدد الف ثانی کا\nکمالاتِ نبوت کا مزہ جس نے نہیں چکھا\n\nوہ کیا جانے بھلا رتبہ مجدد الف ثانی کا\nبٹی تھی خاص غار ثور کی خلوت میں جو نعمت\n\nہے اس فیضان میں حصہ مجدّد الف ثانی کا\nشب الحاد و بدعت چھٹ گئی یکسر زمانے سے\n\nنکل کر مہر جب چمکا مجدد الف ثانی کا\nملی مردہ دلوں کو زندگی ذکر الٰہی سے\n\nیہ ہے واللہ کرم سارا مجدد الف ثانی کا\nخدا کے فضل سے شہزادؔ ہم بھی نقشبندی ہیں\n\nہمارے سر پہ ہے سایہ مجدد الف ثانی "
  },
  {
    "id": 218,
    "title": "منقبت",
    "description": "حضرت مجدد الف ثانی رحمتہ اللہ علیہ\nجگمگاتے ہیں انوار سرہند میں\n\nہے مجدد کا دربار سرہند میں\nجیسے تبدیل ہوتی ہے شب ، صبح میں\n\nیوں بدلتے ہیں افکار سرہند میں\nدیدہ و دل کو کاسہ بنائے ہوئے\n\nآ رہے ہیں طلب گار سرہند میں\nاللہ اللہ مسیحائے مردہ دِلاں\n\nعارفوں کا ہے سالار سرہند میں\nدِین اسلام کو جس نے چمکا دیا\n\nنورکا ہے وہ مینار سرہند میں\nاہل سنت کوجس نے سنبھالا دِیا\n\nسنیت کا علم دار سرہند میں\nشاہ سرہند کی شان تو دیکھیے\n\nکعبہ آیا کئی بار سرہند میں\nجس کا ایک ایک مکتوب مرشد نما\n\nہے وہ دانائے اسرار سرہند میں\nنقشبندی فیوضات کا ہے اثر\n\nچین پاتے ہیں بیمار سرہند میں\nالف ثانی کا وہ رہبر و رہنما\n\nعارفوں کا ہے سردار سرہند میں\nقلب و جاں میں ہے شہزادؔ جس کی مہک\n\nہے وہ سرسبز گلزار سرہند م"
  },
  {
    "id": 219,
    "title": "منقبت",
    "description": "حضر ت خواجہ معصوم رحمتہ اللہ علیہ\nنائب حضرت مجدد فخر اہل معرفت\n\nخواجہ معصوم سرہندی وہ عالی مرتبت\nچست آئی جن کی قامت پر ولایت کی قبا\n\nخود تمنائی تھی جن کی خلعتِ قیّومیت\nبادشاہوں پربھی چلتا تھا تصرف آپ کا\n\nحق نے بخشی آپ کو روحانیت کی سلطنت\nرہنمائی آپ سے لی شاہ عالم گیر نے\n\nدین و دنیا میںملی یوں اُس کو قدر و منزلت\nآپ کے فیضان کا مظہر فتاویٰ ہندیہ\n\nآپ کے الطاف کی عکاس فقہ حنفیّت\nغافلوں کو آپ نے تعلیم ذکر و فکر دی\n\nعارفوں نے آپ سے پایا شعورِ معرفت\nہم بھی ہیں شہزادؔ معصومی بفضل ذاتِ حق\n\nاس لیے وردِ زباں ہے آج اُن کی منق"
  },
  {
    "id": 220,
    "title": "منقبت",
    "description": "حضرت خواجہ محمد معصوم رحمتہ اللہ علیہ\nعروۃ الوثقیٰ لقب ہے خواجۂ معصوم کا\n\nتذکرہ وجہ طرب ہے خواجۂ معصوم کا\nگلشن فاروق اعظم کے تروتازہ گلاب\n\nباخدا اعلیٰ نسب ہے خواجۂ معصوم کا\nجانشیں حضرت مجدد کے ہیں قیوم جہاں\n\nاس لیے دل میں ادب ہے خواجہ معصوم کا\nمستفید و مستفیض اہل عجم کو بھی کیا\n\nمعترف سارا عرب ہے خواجۂ معصوم کا\nتاجدارانِ جہاں نے کی ہے ان کی چاکری\n\nمرتبہ واللہ عجب ہے خواجۂ معصوم کا\nبھر دیا سینوں میں فیضانِ مجدّد آپ نے\n\nمنفرد عالم میں ڈھب ہے ، خواجہ معصوم کا\nپیکرِعلم و عمل وہ بحر اسرار و رموز\n\nثانی کوئی شیخ کب ہے خواجہ معصوم کا\nہے فروزاں ہند میں جو آج تک دیں کا چراغ\n\nیہ کرم شہزادؔ سب ہے خواجۂ معصوم "
  },
  {
    "id": 221,
    "title": "منقبت",
    "description": "حضرت مرزا مظہر جان جاں رحمتہ اللہ علیہ\nمزّین ز صدق و صفا جانِ جاناں\n\nنزاکت میں سب سے جدا جانِ جاناں\nمحدث ، مفسر مریدین جن کے\n\nزمانے کے وہ مقتدا جانِ جاناں\nمعارف کا دریا وہ قیوم عالم\n\nمشائخ کے ہیں رہنما جانِ جاناں\nشریعت کی کرتے رہے پاسبانی\n\nطریقت کے ہیں پیشوا جانِ جاناں\nاجازت تھی چاروں سلاسل میں اُن کو\n\nحقیقت میں تھے باخدا جانِ جاناں\nمئے نقشبنداں کا ساغر پلا کر\n\nسکھاتے تھے صبر و رضا جانِ جاناں\nزمانے کے گمراہ لوگوں کو ہر دم\n\nدکھاتے تھے راہ ھدٰی جانِ جاناں\nتذکر ، تفکر ، تشکر کا پیکر\n\nتوکل تھے سرتابہ پا جانِ جاناں\nسبق ظلمتوں کو دیا روشنی کا\n\nہدایت کا اک سلسلہ جانِ جاناں\nیہ حضرت مجدّد کا فیضان ہی تھا\n\nرہے بن کے حق کی صدا جانِ جاناں\nتعلق ہے خالق کے ساتھ ان کا گہر ا\n\nمحب شہ دوسرا جانِ جاناں\nبہ دل گرچہ شہزادؔ اخلاص دارم\n\nو لیکن کجا من کجا جانِ جان"
  },
  {
    "id": 222,
    "title": "منقبت",
    "description": "اعلیٰ حضرت امام احمد رضا خان تاجدارِ بریلی رحمتہ اللہ علیہ\nہے آئینۂ رشد فضل خدا سے\n\nجو صادر ہوا حرف کلک رضا سے\nوہ قسام فیضان عشق رسالت\n\nخدا کے کرم سے ، نبی کی عطا سے\nمحدث ، مفسر ، فقیہ و مجدد\n\nوہ تھا بہرہ ور سب علوم ھدٰی سے\nوہ اک عارف حق وہ اک شیخ کامل\n\nتھی وابستگی جس کو غوث الورٰی سے\nتھا اعدائے دیں کے لیے تیغ قاطع\n\nرعایت نہ رکھتا تھا اہل جفا سے\nرہا عمر بھر وہ شریعت کے تابع\n\nتھے پرُ جان و دِل اُس کے صدق و صفا سے\nغرض اُس نے رکھی نہ اہلِ دُوَل سے\n\nاسے عشق تھا تو فقط مصطفی سے\nعقائد میں اسلاف کا عکس تھا وہ\n\nفقاہت عیاں اس کی ہر اک ادا سے\nگُندھا تھا خمیر اس کا عشق نبی میں\n\nتھا معمور دل اس کا ذوق وفا سے\nوہ بحر معارف تھا حکمت کا پیکر\n\nاسے ربط تھا خاص باب ہدٰی سے\nلکھوں تاج دار بریلی کی مدحت\n\nملے بہرہ وافر جو فکر رسا سے\nاحاطہ علوم رضا کا کروں میں\n\nیہ کیوں کر ہو شہزادؔ مجھ نارسا "
  },
  {
    "id": 223,
    "title": "گوشۂ سیفیہرحمتہ اللہ علیہ",
    "description": "سرورِ اہلِ صفا ، یکتائی تو دَر اولیاء\nرہبرِ دوراں توئی اے تاجدارِ اتقیاء\n\nنازِہندی ، فخر ہجویری تو قیّوم زماں\nشدورودت ، صد سعادت مردمِ پنجاب را"
  },
  {
    "id": 224,
    "title": "منقبت",
    "description": "مجدد عصر حاضر\nاخنذادہ سیف الرحمن صاحب پیرارچی مبارک\n\nنہیں ہے کوئی ثانی باخدا قیوم دوراں کا\nہر اک انداز ہے واللہ جدا قیوم دوراں کا\n\nخدا کے ذکر سے آباد کر سکتا ہے سینوں کو\nجو سالک ہے اجازت یافتہ قیوم دوراں کا\n\nجناب شیخ ہاشم کے خلیفہ اور نائب ہیں\nہے بالا ہر جہت سے مرتبہ قیوم دوراں کا\n\nوجود ان کا ہے نورانی ، کمال ان کا ہے لاثانی\nانوکھا ہے جہاں میں سلسلہ قیوم دوراں کا\n\nجِلا دیتے ہیں وہ مردہ دلوں کو اک اشارے سے\nہے جاری فیض کا دریا سدا قیوم دوراں کا\n\nانہی کے در سے بے چینوں کو اطمینان ملتا ہے\nہے واقف وجد سے ہر ہر گدا قیوم دوراں کا\n\nچمن زار ولایت میں کبھی بلبل نوا پیرا\nکبھی نغمہ سناتی ہے صبا قیوم دوراں کا\n\nمٹا دیتی ہے ان کی اک نظر سب داغ عصیاں کے\nہمارا حج ہے یارو دیکھنا قیوم دوراں کا\n\nعطا کرتے ہیں وہ شہزادؔ ہر سائل کو فیض اپنا\nبڑا مشہور ہے جود و سخا قیوم دوراں کا"
  },
  {
    "id": 225,
    "title": "منقبت",
    "description": "حضرت صوفی کندل صاحب مبارک رحمتہ اللہ علیہ\nضعف یقیں کو عزم مصمم بنا دیا\n\nقطرے کو تیرے فیض نے قلزم بنا دیا\nتیری عطائے خاص نے اے پیکر جمال\n\nمجھ سا حقیر شخص معظم بنا دیا\nجس کی تمام ذات تھی زخموں پہ مشتمل\n\nتو نے اسے بھی ڈھال کر مرہم بنا دیا\nاللہ رے وہ عارضِ برگِ گلِ اِرم\n\nقطرے کو جس کے لمس نے شبنم بنا دیا\nچھائی تھی گلستانِ تصوف پہ اک خزاں\n\nتو نے اسے بہار کا موسم بنا دیا\nفصل خزاں کا راج تھا قلب و نگاہ پر\n\nتو نے اسے بہار کا موسم بنا دیا\nرہتا تھا کچھ حیات کی پیچیدگی کا خوف\n\nلیکن تیرے خیال نے بے غم بنا دیا\nاب تو نصیب سیدی ! عید وصال ہو\n\nدوری نے مجھ کو مثل محرّم بنا دیا\nبگڑا تھا قلب و رُوح کا ہر اک معاملہ\n\nتیری نوازشات نے یکدم بنا دیا\nدل سے مرے نکال کر مرشد نے نفرتیں\n\nمجھ کو محبتوں کا معلم بنا دیا\nگر تو نہیں تو صوفیٔ بے مثل کون ہے\n\nجس کی نظر نے بوند کو رم جھم بنا دیا\nلینے تو بھیک آئے تھے شہزادؔ ہم یہاں\n\nلیکن سخی کے فیض نے قاسم بنا د"
  },
  {
    "id": 226,
    "title": "منقبت",
    "description": "احوالِ بزم عشق\nعجب مستی کا تھا عالم جہاں کل رات کو میں تھا\n\nتھا ذکرِ ذاتِ ھو ہر دم جہاںکل رات کو میں تھا\nدلوں سے وسوسے مٹتے رہے سب نفس و شیطاں کے\n\nنظر آیا عجب عالم جہاں کل رات کو میں تھا\nخدائے وحدہٗ کی یاد میں تھا کچھ سکوں ایسا\n\nنہ آیا پاس کوئی غم جہاں کل رات کو میں تھا\nہر اِک سینے میں فیض پیر ارچی کا خزینہ تھا\n\nلطائف سب تھے جام جم جہاں کل رات کو میں تھا\nزمیں تا آسماں انوار کی خیرات جاری تھی\n\nتھا رنگ و نور کا موسم جہاں کل رات کو میں تھا\nفضامعمور تھی ساری کمالاتِ ولایت سے\n\nنہیں تھا فکر بیش و کم جہاں کل رات کو میں تھا\nجسے دیکھا وہی مست مئے قیّومِ دوراں تھا\n\nتھی ساری بزم ہی برہم جہاں کل رات کو میں تھا\nدکھائی دی مجھے فصل بہار سیفیہ ہر سو\n\nتھی جذب و جوش کی رم جھم جہاں کل رات کو میں تھا\nمری جانب بھی تھی شہزادؔ چشم مرشد کامل\n\nمرا سر تھا ادب سے خم جہاں کل رات کو میں ت"
  },
  {
    "id": 227,
    "title": "منقبت(مترجم)",
    "description": "حضرت صوفی کندل خان مبارک رحمتہ اللہ علیہ\nاگر چاہے طریقت بن گدائے صوفی کندل\n\nتو آکے دیکھ اے طالب صفائے صوفی کندل\nسکوں میرے دل و جاں کا لقائے صوفی کندل\n\nخوشا !میرے بھی سر پر ہے ردائے صوفی کندل\nکرے زندہ دل مردہ کو جو اک نعرۂ ھُو سے\n\nصدائے قم باذن اللہ صدائے صوفی کندل\nکہاں تھا وہ کہاں ہوں میں ، یہ خود سے پوچھتا ہوں میں\n\nصدا آئی کہ ہے یہ سب دعائے صوفی کندل\nعداوت اولیاء کے ساتھ خالق سے عداوت ہے\n\nورا ہر شک سے ہے منکر وفائے صوفی کندل\nخدا وہ دن بھی لے آئے کہ پابوسی کروں ان کی\n\nمیں دیکھوں جلد روئے دلربائے صوفی کندل\nاگر پوچھو مقام ان کا امام الاولیاء کہہ دوں\n\nکریں اہل ولایت اقتدائے صوفی کندل\nشفیق و مہرباں میرے ، کریم و پاسباں میرے\n\nغنی ہوں فقر میں یہ ہے سخائے صوفی کندل\nمیں ہوں شہزادؔ ناکارہ گنہگار اور بے چارہ\n\nمیں شاید جگ میں آیا ہوں برائے صوفی کندل\nقلم عاجز زباں قاصر بیاں شہزادؔ ناممکن\n\nمیرے فکر و تخیل سب فدائے صوفی کن"
  },
  {
    "id": 228,
    "title": "منقبت",
    "description": "خلیفۂ اعلیٰ حضرت ، حضرت\nمفتی غلام جان ہزاروی رحمۃ اللہ تعالیٰ\n\nاہلِ سُنن کی جان ہیںمفتی غلام جان\nسب رضویوں کی شان ہیں مفتی غلام جان\n\nیکجا ہیں ان کی ذات میں اخلاص وعلم وعشق\nاہلِ صفا کا مان ہیں مفتی غلام جان\n\nغوث و رضا کے عاشقِ صادق ، دلیل خیر\nحق گو ہیں حق نشان ہیں مفتی غلام جان\n\nعکسِ کمالِ شیخِ طریقت ہے ان کی ذات\nفیضِ رضا کی کان ہیں مفتی غلام جان\n\nتقویٰ شعار ، صاحبِ فتویٰ ، فقیہِ دیں\nاہلِ نظر کی آن ہیں مفتی غلام جان\n\nفضل وکمال جودو نوال ان کا بے مثال\nعظمت کا آسمان ہیں مفتی غلام جان\n\nدیکھو تو ہیں حضور کے سادہ سے اُمتی\nسمجھو تو اِک جہان ہیں مفتی غلام جان\n\nرفض و خروج و نصب پہ اک تیغ برق بار\nسُنّی کا سائبان ہیں مفتی غلام جان\n\nزیرِ مزار بھی ہیں دعا گوئے اہلِ حق\nکس درجہ مہربان ہیں مفتی غلام جان\n\nآئینۂ ’’حدائقِ بخشش ‘‘ہے وہ لحد\nجس میں کہ میہمان ہیں مفتی غلام جان\n\nہے وہ فضا ’’بہار شریعت‘‘سے مشکبار\nجس میں براجمان ہیں مفتی غلام جان\n\nاحمد رضا جو سعدی شیرازِعشق ہیں\nمانندِ بوستان ہیں مفتی غلام جان\n\nہم بھی نیازمندِ بریلی شریف ہیں\nاور اپنے ترجمان ہیں مفتی غلام جان\n\nاقبال ان کا شکلِ مظفر میں ہے بلند\nسعدین کا قران ہیں مفتی غلام جان\n\nشہزادؔ مقتدی ہیں مریدانِ با صفا\nاور میرِ کاروان ہیں مفتی غلام جان\n\n(بپاسِ خاطرِ عاطرحضرت علامہ الحاج قاضی مظفر اقبال رضو"
  },
  {
    "id": 229,
    "title": "منقبت",
    "description": "حضرت خطیبِ ملت\nمولانا محمد شفیع اوکاڑوی رحمتہ اللہ علیہ\n\nاک نعمتِ خدا ہیں حضرت خطیبِ مِلّت\nسرکار کی عطا ہیں حضرت خطیبِ مِلّت\n\nمدّاح مصطفی ہیں حضرت خطیبِ مِلّت\nممدوح اصفیا ہیں حضرت خطیبِ مِلّت\n\nتاثیر سے دلوں کو تسخیر کرنے والے\nفطرت کازمزمہ ہیں حضرت خطیبِ مِلّت\n\nالحانِ دائودی کا چشمہ رواں ہے گویا\nکس درجہ خوش نوا ہیں حضرت خطیبِ مِلّت\n\nاغیار نے بھی کی ہے تسلیم یہ حقیقت\nمِلّت کے پیشوا ہیں حضرت خطیبِ مِلّت\n\nدیتے ہیں داد جس کی افلاک پر ملائک\nاک نغمۂ رسا ہیں حضرت خطیبِ مِلّت\n\nدیکھا نہ جس کا ثانی پھر اہل شرق پور نے\nاس پیر کی دعا ہیں حضرت خطیبِ مِلّت\n\nقسمت کا ان کی اب تک کوکب چمک رہا ہے\nمحفل میں رونما ہیں حضرت خطیبِ مِلّت\n\nصد شکر آج تک ہے حضرت کا فیض جاری\nہم سے کہاں جدا ہیں حضرت خطیبِ مِلّت\n\nحصے میں ان کے آئی ’’لا یحزنوں‘‘ کی مسند\nمقبولِ اولیا ہیں حضرت خطیبِ مِلّت\n\nجو صبح و شام برسی روحوں کی کھیتیوں پر\nعرفاں کی وہ گھٹا ہیں حضرت خطیبِ مِلّت\n\nسیرت کو ان کی پڑھ کر شہزادؔ میں نے سمجھا\nاک گنجِ بے بہا ہیں حضرت خطیبِ مِلّت"
  },
  {
    "id": 230,
    "title": "منقبت",
    "description": "حضرت حکیم محمد موسیٰ امرتسری چشتی نظامی رحمتہ اللہ علیہ\nجسے دیکھو ہے مدح خواں حکیمِ اہلسنّت کا\n\nلقب ہے آپ کے شایاں حکیمِ اہلسنّت کا\nشعورِ ُسنّیت بخشا تہی ذہنوں کو حکمت سے\n\nہر اک سنی پہ ہے احساں حکیمِ اہلسنّت کا\nرہ علم و ہنر ہے آج ان کی فکر سے روشن\n\nہے تازہ تر ہر اک فرماں حکیمِ اہلسنّت کا\nسلجھتی ہے ہر اک گتھی بفیضان کرم اب بھی\n\nہے جاری قبر سے فیضاں حکیمِ اہلسنّت کا\nنظام مصطفی ہو جائے نافذ اپنی دھرتی پر\n\nرہا تاعمر یہ ارماں حکیمِ اہلسنّت کا\nشہ کونین کی ناموس کا دیتے رہے پہرا\n\nیہی تھا دیں یہی ایماں حکیمِ اہلسنّت کا\nدکھایا کیا کرشمہ اک معالج کیحذاقت نے\n\nعدو شہزادؔ ہے حیراں حکیمِ اہلسنّت "
  },
  {
    "id": 231,
    "title": "منقبت",
    "description": "حضرت حفیظ تائب رحمتہ اللہ علیہ\nرضا و محسن کا تو ہے نائب حفیظ تائب\n\nہے مستند تیرا قول صائب حفیظ تائب\nترے دلائل کے ہیں مصادر کتاب و سیرت\n\nتیرا مخالف رہے گا خائب حفیظ تائب\nمیں جب بھی کرتا ہوں استغاثہ تری زباں میں\n\nتو ٹلتے جاتے ہیں سب مصائب حفیظ تائب\nوہ کیسا منظر تھا اے ستونِ ابولبابہ\n\nتیرے قریں جب ہوا تھا تائب حفیظ تائب\nزمانے بھر کے ثنا نگاروں کو ، شاعروں کو\n\nدکھائے تو نے کئی عجائب حفیظ تائب\nسجھائی راہیں نئی تری پیشوائیوں نے\n\nہوئے بہم نعت کے رغائب حفیظ تائب\nشعور آداب نعت گوئی ترا حوالہ\n\nترے اسالیب ہیں غرائب حفیظ تائب\nتیری ولا کے نقوش اب بھی جھلک رہے ہیں\n\nنظر سے تو ہے اگرچہ غائب حفیظ تائب\nنہیں ہے واقف حدیث توبہ کی خاصیت سے\n\nجو ڈھونڈتا ہے ترے معائب حفیظ تائب\nکمالِ فن کا بقولِ شہزادؔ آئینہ ہیں\n\nترے محاسن ہوں یا نجائب حفیظ تا"
  },
  {
    "id": 232,
    "title": "منقبت",
    "description": "جناب فخرالقراء\nحضرت قاری غلام رسول رحمتہ اللہ علیہ\n\nمحبِ خاص کلامِ خدا غلام رسول\nامام تھا فن تجوید کا غلام رسول\n\nکمال درجہ قرأت میں دسترس تھی اسے\nمعلمین کا استاذ تھا غلام رسول\n\nبچھا کے داتا کی نگری میں مسند تدریس\nکلامِ پاک سکھاتا رہا غلام رسول\n\nسجی جہاں بھی کبھی بزم قاریان کرام\nرہا ہے صدر نشیں ہر جگہ غلام رسول\n\nسوال جب بھی ہوا کون ہے بڑا قاری\nہر اک زباں نے جواباً کہا غلام رسول\n\nموذنین زمانہ میں بھی وہ تھا یکتا\nتو نعت میں بھی رہا خوش ادا غلام رسول\n\nغلامِ سرور عالم تھا اس لیے شہزادؔ\nرہا جہان میں وقف ثنا غلام رسول"
  },
  {
    "id": 233,
    "title": "منقبت",
    "description": "اولیاء لاہوررحمتہ اللہ علیہم\nاولیاء کے ہیں انوار لاہور میں\n\nمیرے داتا کا دربار لاہور میں\nفیض عالم کی چوکھٹ کا صدقہ ہے یہ\n\nبخت ہوتے ہیں بیدار لاہور میں\nشیخ طاہر ، یہاں پر ہیں جلوہ نما\n\nمہر زنجان ضو بار لاہور میں\nپیر مکی ، میاں میر ، شاہِ رضا\n\nکیسے کیسے ہیں شہکار لاہور میں\nشہر لاہور ولیوں کی ہے رہ گزر\n\nمعرفت کا ہے بازار لاہور میں\nسر زمیں ہے یہ اغواث و اقطاب کی\n\nہیں ولایت کے آثار لاہور میں\nراستہ ہے یہ بغداد و اجمیر کا\n\nآتے جاتے ہیں ابرار لاہور میں\nقطب فرما گئے شیخ سرہند اسے\n\nہے محبت کی مہکار لاہور میں\nچشت و سرہند و دہلی سے آتے رہے\n\nذات حق کے طلبگار لاہور میں\nکون جاتا ہے ان کے مزارات پر\n\nدفن ہیں کتنے زر دار لاہور میں\nاولیاء کے مزارات کی شکل میں\n\nخلد کے ہیں چمن زار لاہور میں\nہم بھی شہزادؔ داتا کے سائے میں ہیں\n\nہے ہمارا بھی گھر بار لاہور م"
  },
  {
    "id": 234,
    "title": "شجرئہ سلسلۂ عالیہ",
    "description": "نقشبندیہ،مجددیہ،سیفیہ،صوفیہ\nاے خدااے خالق ارض و سما\n\nاپنے پیاروں کا مجھے رستہ دکھا\nاے غنی اے مغنی و رب ودود\n\nبھیج سرکار دو عالم پر درود\nاے خدا بہر محمد مصطفی\n\nمعرفت کر دے ہمیں اپنی عطا\nحضرت صدیق اکبر کے طفیل\n\nصاف کر دے مرے دل کی ساری میل\nواسطہ دیتا ہوں میں سلمان کا\n\nتو محافظ بن مرے ایمان کا\nحضرت قاسم کا صدقہ اے قدیر\n\nاپنی الفت کر عطا مجھ کو کثیر\nجعفر صادق ہیں ولیوں کے امام\n\nان کے صدقے تو بنا دے بگڑے کام\nرہبر اہل ولایت بایزید\n\nان کے درجے تو بڑھا مولا مزید\nبوالحسن ، خرقانی ذیشان ہیں\n\nان کے صدقے ان پہ ہم قربان ہیں\nبو علی‘ طوسی و فارمدی ہیں جو\n\nساتھ ان کے ہی مرا انجام ہو\nخواجہ یوسف مقتدائے اولیاء\n\nان کے صدقے تو مری بگڑی بنا\nعبد خالق غجد دانی بے مثال\n\nمثل ان کی کر عطا ہم کو کمال\nبہر حضرت خواجہ عارف ریو گر\n\nہم کو اہل ذکر میں شامل تو کر\nخواجۂ محمود انچر با کمال\n\nکر خدایا ان کی طرح میرا خیال\nحضرت خواجہ عزیزاں دلنشیں\n\nیا الٰہی دے مجھے ان سی جبیں\nبابا سماسی ہیں پیروں کے بھی پیر\n\nان کا صدقہ کر مجھے روشن ضمیر\nعالی رتبہ ہیں بہت میر کلال\n\nمشکلیں ان کے تصدّق میری ٹال\nکر دیا منسوب شاہِ نقشبند\n\nیا الٰہی ہوں ترا احسان مند\nیا الٰہی از پئے خواجہ عطار\n\nدل کے ویرانے کو کر دے پُر بہار\nحضرت یعقوب چرخی باصفا\n\nصدر و ِمیر حلقہ اہل رضا\nواسطہ ہے خواجہ احرار کا\n\nمیرے دل پر کر نزول انوار کا\nصدقۂ زاہد حصاری بے ریا\n\nتو ہمیں اپنا بنا لے کبریا\nخواجہ درویش دُرِّ لاجواب\n\nان کے ہمرہ رکھ ہمیں روزِ حساب\nخواجہ امکنگی ، ولی کے واسطے\n\nاہل حق والے سکھا دے ضابطے\nبہر حضرت باقی باللہ اے کریم\n\nکر سدا ہم سب پہ تولطیف عمیم\nواسطہ حضرت مجدد پاک کا\n\nکر مجھے پیر ، شہِ لولاک کا\nعروۃ الوثقی کا صدقہ کر کرم\n\nدو جہاں میں عاصیوں کا رکھ بھرم\nخواجہ اسماعیل امام العارفین\n\nاولیاء میں ایک تابندہ نگیں\nجس کا کہ معصوم ثانی ہے خطاب\n\nاس کے صدقے ٹال دے سارے عذاب\nعارفِ مولا ، محمّد کا غلام\n\nحشر میں بھی ہو ہمارا وہ امام\nصدقۂ حاجی صفی اللہ دے\n\nجس میں ہو تاثیر ایسی آہ دے\nبہر حضرت شہ ضیاء الحق شہید\n\nاے خدا اپنی محبت دے شدید\nشہ ضیا حاجی میاں جی کے طفیل\n\nسنّتوں کا نور جگ میں جائے پھیل\nشمس حق ہیں اے خدا تیرے ولی\n\nتو کبھی ہم کو دکھا ان کی گلی\nیاالٰہی صدقۂ شاہ رسول\n\nمیری یہ ناچیز کاوش کر قبول\nحضرت ہاشم امام الاصفیاء\n\nان کے صدقے نفس کے شر سے بچا\nپیرا رچی سیف رحماں خوش خصال\n\nمیرے مرشد فی زمانہ بے مثال\nسیفیہ جس نے چلایا سلسلہ\n\nاور دنیا میں بڑھایا سلسلہ\nنقشبندی سلسلے کی شان وہ\n\nنقشبندی سلسلے کا مان وہ\nسیف رحماں پیکر صدق و صفا\n\nسیف رحماں رہبروں کے رہنما\nدنیا و عقبیٰ میں اے ربّ خلیق\n\nصوفیٔ کندل کو کر میرا رفیق\nنسبت ان ولیوں سے اے شہزاد ؔ ہے\n\nقریۂ جاں اس لیے آباد "
  },
  {
    "id": 235,
    "title": "متفرقات",
    "description": "ما ہر چہ خواندہ ایم فراموش کردہ ایم\nالّا حدیث دوست کہ تکرار می کنم\n\n(حافظ شیرازی)\nشانِ قرآن\n\nحکمتیں ہیں نور ہے اسرار ہیں قرآن میں\nذاتِ ربّ عرش کے انوار ہیں قرآن میں\n\nرہنما و محسنِ انسانیت ہے یہ کتاب\nکامیابی کے سبھی اطوار ہیں قرآن میں\n\nزندگی میں بندگی کے رنگ بھر دیتا ہے یہ\nارفع و اعلیٰ سبھی اقدار ہیں قرآن میں\n\nناسخ و منسوخ ہیں کچھ محکم ومتشابہات\nگھاٹیاں کچھ راستے خم دار ہیں قرآن میں\n\nہے پیامِ زندگی یہ مردہ قوموں کے لئے\nروح پرور ،تازہ تر افکار ہیں قرآن میں\n\nدیکھتے ہیں صفحہ در صفحہ انھیں اہل ِ نظر\nجلوہ فرما ہر جگہ سرکار ہیں قرآن میں\n\nمصدر و مہبط ہیں وہ وحیِ خدا کا اس لئے\nصاحب قرآن کے تزکار ہیں قرآن میں\n\nزمزمہ تسبیح کا ،نغمہ کہیں تہلیل کا\nجانفزا و دلنشیں اذکار ہیں قرآن میں\n\nقل ھواللہ أحد ہے اس کی وحدت کا بیاں\nکبریائی کے کئی آثار ہیں قرآن میں\n\nسورۂ رحمان کی آیات میں جلوہ نما\nاس کی قدرت کے حسیں شہکار ہیں قرآن میں\n\nاکبر و اصغر ہو کوئی یا ہو کوئی خشک و تر\nگلشن و صحرا و نور و نار ہیں قرآن میں\n\nماضی و حال اور مستقبل کی ہے اس میں خبر\nجلوہ گر شہزادؔ سب ادوار ہیں قرآن میں"
  },
  {
    "id": 236,
    "title": "شانِ رمضان",
    "description": "اللہ کا مہمان ہے تو اے مہ رمضان\nتسکین دل و جان ہے تو اے مہ رمضان\n\nافطار و سحر چہرئہ مومن کو نکھاریں\nہیں صحن مساجد میں تراویح کی بہاریں\n\nاک موجۂ عرفان ہے تو اے مہ رمضان\nرحمت کہیں بخشش ترے عشروں میں چھپی ہے\n\nہر شب ہی تیری چشمۂ کوثر میں دھلی ہے\nہاں تحفۂ رحمان ہے تو اے مہ رمضان\n\nہوتا ہے گماں دل پہ مجھے غار حرا کا\nجب تذکرہ چھڑ جاتا ہے آیات ھدٰی کا\n\nآغوش بہ قرآن ہے تو اے مہ رمضان\nہر دن ہے معظم ترا ہر شب ہے گرامی\n\nہوتی ہے شب قدر فرشتوں کی سلامی\nبخشش کا شبستان ہے تو ا ے مہ رمضان\n\nانوار و فیوضات کی بارش ہے مسلسل\nشہزادؔ ہوئی جاتی ہے ہر سمت جو جل تھل\n\nسرکار کا فیضان ہے تو اے مہ رمض"
  },
  {
    "id": 237,
    "title": "قدر کی شب",
    "description": "فضل رب العلا ہے قدر کی شب\nشفقت مصطفی ہے قدر کی شب\n\nیہ کھلا ’’انک عفو‘‘ سے\nخیر کا سلسلہ ہے قدر کی شب\n\nبخششیں بٹ رہی ہیں بے قیمت\nلطف کی انتہا ہے قدر کی شب\n\nقدر قرآں سے پائی ہے اس نے\nکیونکہ نازل ہوا ہے قدر کی شب\n\nقدر والوں کو قدر ہے اس کی\nنعمت بے بہا ہے قدر کی شب\n\nخاکیو! آئو لو خدا کا سلام\nنوریوں کی صدا ہے قدر کی شب\n\nآج روح الامیں بھی فرش پہ ہیں\nکس قدر پر ضیا ہے قدر کی شب\n\nبخشش و رحمت و عنایت کا\nایک میلہ لگا ہے قدر کی شب\n\nلیلۃ القدر کا مقام ہے کیا؟\nیہ بھی مجھ پر کھلا ہے قدر کی شب\n\nہے فزوں تر ہزار راتوں سے\nخود خدا نے کہا ہے قدر کی شب\n\nہے یہ اقرء کے نور سے معمور\nیادگارِ حرا ہے قدر کی شب\n\nفجر تک ہے سلامتی اس میں\nرحمتوں کی ردا ہے قدر کی شب\n\nقدر لازم ہے پاک دھرتی کی\nیہ عطیّہ ملا ہے قدر کی شب\n\nقدر قرآں کی فرض ہے شہزادؔ\nکہ یہ نازل ہوا ہے قدر کی شب"
  },
  {
    "id": 238,
    "title": "سلام رضا",
    "description": "عکسِ حسنِ عقیدت سلامِ رضا\nارمغانِ فضیلت سلامِ رضا\n\nفیض بزم ہدایت سلامِ رضا\nاوجِ ذوقِ مودّت سلامِ رضا\n\nنورِ عشقِ رسالت سلامِ رضا\nمدحِ حسنِ نبوت سلامِ رضا\n\nترجمانِ حقیقت سلامِ رضا\nمظہرِ علم و حکمت سلامِ رضا\n\nکیا مرصّع سراپائے سرکار ہے\nآئینہ دار سیرت سلامِ رضا\n\nجیسے حرفوں میں روح رضا ڈھل گئی\nشاہدِ صدقِ الفت سلامِ رضا\n\nاس کے پڑھنے میںہے تزکیہ نفس کا\nقلب و جاں کی طہارت سلامِ رضا\n\nباعث لطف رب ہے ثنائے نبی\nوجہِ تحصیل رحمت سلامِ رضا\n\nاس کا ہر شعر مقبول سرکار ہے\nحامل شان و عظمت سلامِ رضا\n\nاس کے حرفوں میں پنہاں فیوضات ہیں\nہے رضا کی کرامت سلامِ رضا\n\nاستعارہ ہے یہ رفعت ذکر کا\nدہر میں تا قیامت سلامِ رضا\n\nسوچیے یہ علامت ہے کس چیز کی؟\nآج تک ہے سلامت سلامِ رضا\n\nاس کو کیسے نہ اردو کا بردہ کہیں\nہے خود اس کی شہادت سلامِ رضا\n\nشک نہیں اہل اردو ادب کے لیے\nہے اِک انمول نعمت سلامِ رضا\n\nساتھ شہزادؔ قدسی بھی ہوں ہم زباں\nجب پڑھوں وقت رخصت سلامِ رضا"
  },
  {
    "id": 239,
    "title": "’’کنزِایمانِ رضا‘‘",
    "description": "گل تراجم کے چمن کا کنزِ ایمانِ رضا\nآئینہ دل کی لگن کا کنزِ ایمانِ رضا\n\nوقف تھا بہر ثنائے مصطفی جو ہر گھڑی\nفیض ہے ایسے دہن کا کنزِ ایمانِ رضا\n\nڈھل گیا اردو زباں میں عکس قرآن حکیم\nمعجزہ ہے علم و فن کا کنزِ ایمانِ رضا\n\nماحی رفض و خروج و ردّ امکان نظیر\nکھو جتا ہے کھوٹ من کا کنزِ ایمانِ رضا\n\nضامن حفظ عقائد حامی دین متیں\nراستہ خلد عدن کا کنزِ ایمانِ رضا\n\nغیر ممکن ہے کہ کوئی اور ہو اس کا مثیل\nہے نشاں اہل سنن کا کنزِ ایمانِ رضا\n\nفیضیاب اس سے ہوئے ہیں اپنے بیگانے سبھی\nرہنما ہر مرد و زن کا کنزِ ایمانِ رضا\n\nخالق یکتا و واحد کی محبت کا نقیب\nفیض سلطان زمن کا کنزِ ایمانِ رضا\n\nدیکھئے شہزاد ؔ خوش بختی ہماری دیکھئے\nآج ہے عنواں سخن کا کنزِ ایمانِ رضا"
  },
  {
    "id": 240,
    "title": "حصہ فارسی",
    "description": "الٰہی لذّتِ حمد و ثنایت دہ زبانم را\nزمشک نعتِ پیغمبر معطّرکن دہانم را\n\n(مخلص مجدّدی)\nمناجات بدرگاہ قاضی الحاجات\n\nشب و روز من در خرابات ہستم\nگرفتار لغو و خرافات ہستم\n\nنداریم سرمایۂ ذوقِ قلبی\nتہی از مقام و کمالات ہستم\n\nپریشان گشتم ز احوالِ باطن!\nخدایا بعید از عبادات ہستم\n\nگنہگار ، مسکین و عاجز فقیرم\nنہ من صاحب خرق عادات ہستم\n\nنخواہیم نام و نمود و نمائش\nنہ مائل بہ کشف و کرامات ہستم\n\nنہ شب زندہ دارم ، نہ صائم نہارم\nصد افسوس دور از مناجات ہستم\n\nبجز نسبت شاہ چیزی ندارم\nغلام غلامانِ سادات ہستم\n\nبہ بزم رنگارنگ حیران و تنہا\nچو صحرا خواد خیالات ہستم\n\nملاقات خواہم ز حاضر جوابے\nکہ شہزادؔ پر از سوالات ہستم"
  },
  {
    "id": 241,
    "title": "مناجات",
    "description": "درِ عنایت کُشا الٰہی\nکہ درد خواہد دوا الٰہی\n\nبدرگہِ تو وصال یا بم\nقبول کن ایں دعا الٰہی\n\nحقیر ہستم ، فقیر ہستم\nزعجز دادم صدا الٰہی\n\nنگاہ داری مرا ز نفسم\nبکن زخواہش رہا الٰہی\n\nعداوتے دہ بہ دشمنانت\nبہ دوستانت وفا الٰہی\n\nبہ قلب ذکرت کنیم دائم\nبروح مدح و ثنا الٰہی\n\nشمار مارا در اہل عرفاں\nبہ بخش خوی رضا الٰہی\n\nچنیں میسر شود خشیّت\nکنم گریز از ریا الٰہی\n\nدرود بر ذات پاک حضرت\nکہ نامِ او مصطفی الٰہی\n\nثناگر تو گل و گلستاں\nپیمبر تو صبا الٰہی\n\nچو شمع باشم برای عالم\nبکن تجلی نما الٰہی\n\nکسے کہ نسبت ندارد از تو\nمرا از و کن جدا الٰہی\n\nنمی ز اشک بلال خواہم\nبساز ابوذر نما الٰہی\n\nبہ حمد رومیؔ بہ نعت جامیؔ\nہزار دفتر فدا الٰہی\n\nبدار شہزادؔ را نگاہے\nبفیض خیرالوریٰ الٰہی"
  },
  {
    "id": 242,
    "title": "منظومہ مخلصیہ",
    "description": "من العبد الی المعبود\nنہ ایں خواہم نہ آں خواہم ، خدا خواہم خدا خواہم\n\nنخواہم عرش و کرسی را ، لقا خواہم لقا خواہم\nندانم رنگ و صورت را نبینم کشف عالم را\n\nبجویم وصل ذات حق ، نہ من صوت و صدا خواہم\nکسی افتاد میگوید اگر عشق الٰہی را\n\nبلا را دوست میدارم ، بلا خواہم بلا خواہم\nکسی دنیا ، کسی عقبیٰ ، کسی کشف و کرامت را\n\nمن از پروردگارِ خود ، رِضا خواہم رِضا خواہم\nخبردار و نگہدار خلائق ، ہست ربّ من\n\nنمی گوئم کہ من خواہم ، چرا خواہم چرا خواہم\nبہ دل ذکر الٰہی را ، بہ خلقت خیرخواہی را\n\nزدست خویش ، من جود و سخا خواہم سخا خواہم\nگنہگارم گنہگارم ، نہ اخلاص و عمل دارم\n\nفقط شہزادؔ از مرشد ، دعا خواہم دعا خوا"
  },
  {
    "id": 243,
    "title": "نعت شریف",
    "description": "میانِ رسولاں عجب شان داری\nکہ روح الامیں وار دربان داری!\n\nگدائے درت تاجدارانِ عالم\nکہ رشک افلاک ایوان داری\n\nچنین حسن از خالق خود گرفتی\nکہ در عاشقاں ذات رحمن داری\n\nتجلائے نورِ تو صدیق و حیدر\nعقیقین فاروق و عثمان داری\n\nجنابِ زبیر و بلال و ابوذر\nاسامہ و طلحہ و سلمان داری\n\nاے سردارِ افواج جن و ملائک\nبیک تن کل اوصافِ انسان داری\n\nتو ہستی بلا ریب قرآنِ ناطق\nبہر قول تفسیرِ قرآن داری\n\nمنور جہانِ کمالات از تو\nچنین شاہی ملک عرفان داری\n\nکرم گستر و خیرخواہ رقیباں\nعجب پُر محبت دل و جان داری\n\nبر احوالِ شہزادؔ چشمِ عنایت\nکہ تو شانِ الطاف و احسان داری"
  },
  {
    "id": 244,
    "title": "منقبت",
    "description": "داتا گنج بخش علی ہجویری h\nخزاں باشد چرا در لالہ زارم\n\nبدل حُبّ شہ ہجویر دارم\nز چشم گنج بخش امید وارم\n\nگلستانے بود ایں خار زارم\nز ابر التفاتے فیض عالم\n\nگل تازہ و فصل نو بہارم\nبفیضِ نسبتِ مخدوم غزنی\n\nبہر گام و مہمے کام گارم\nغلامِ از غلامانِ علی ام\n\nگدائے بارگاہِ تاجدارم\nچراغ خانقاہ پیر ختلی\n\nمنور کن شب تاریک و تارم\nحجابات مرا ہم بر کشائی\n\nمرید و مبتدی خاکسارم\nبتلقینِ شہ بغداد و غزنی\n\nمحب اہل بیت و چار یارم\nمراد شبلی و حصری و ختلی\n\nمتاع خویش با تومی سپارم\nمرا شہزادؔ شد کشف حجابے\n\nگنہگارم ، بر عصیاں شرمسا"
  },
  {
    "id": 245,
    "title": "منقبت",
    "description": "داتا گنج بخش علی ہجویری h\nزجامِ حبّ او سر شار و مستم\n\nمُرید سیّدِ ہجویر ہستم\nبفیض جلوۂ واحد شناسے\n\nبتان حرص و ہستی را شکستم\nگریزاں از درگردن فرازاں\n\nبہ در گاہش سر افگندہ و پشم\nبہ فیضان نگاہ پیر کامل\n\nصنم گر نیستم نے زر برستم\nنمی خواہم دگر شہزادؔ چیزے\n\nہمیشہ باد دامانش بدس"
  },
  {
    "id": 246,
    "title": "منقبت",
    "description": "امام ربانی مُجدّد الف ثانی h\nدہد کار خضری کتابِ مجدد\n\nز صد بحر اولیٰ حبابِ مجدد\nمنور زنورش ہمہ الف ثانی\n\nفروغ عمل ز اکتسابِ مجدد\nشب ہند را کرد صبح فروزاں\n\nچو شد جلوہ گر آفتابِ مجدد\nمنم از غلامان مہر خراساں\n\nنباشم چرا باریابِ مجدد\nبہ فیض نگاہ شفاعت پناہی\n\nبہ محشر شوم در حسابِ مجدد\nعلاقہ بہ سلطان سرہند دارم\n\nنخواہم چرا خیرِ بابِ مجدد\nوراء الوارء الوری ذات واجب\n\nچہ خوب است قول صوابِ مجدد\nعیاں کرد اسرار آفاق و انفس\n\nعجب ہست کشف حجابِ مجدد\nطریقی کہ شہزادؔ بے شرع باشد\n\nبماند تہی ز انتسابِ مج"
  },
  {
    "id": 247,
    "title": "منقبت",
    "description": "امام احمد رضابریلویh\nذوق رومی ٗ سوز جامی با خدا آ مو ختم\n\nعشقِ احمد از امام احمد رضا آموختم\nہمچو بلبل در خیالِ جانِ عالم نغمہ زن\n\nدر حدیقہ ھای بخشش ایں ادا آموختم\nمحبّان پیمبر جان و دل کردن فدا\n\nباعدوش بغض ہم زیں رہنما آموختم\nشاہراہ عشق دیدم از بریلی تا حجاز\n\nطور رفتن چیست؟ سوی دلربا آموختم\nآنکہ شرع و عشق را در نعت خود آمیختہ\n\nنعت گوئی ہم ازاں حق آشنا آموختم\nچوں کسے پر سد کہ از کے یافتی سوز و گداز\n\nایں ہنر گویم ، زعبد مصطفی آموختم\nآں محدّث بودہم شہزادؔ مفتی و فقیہ\n\nمن بہ ذکر اُو صفای قلب را آموخ"
  },
  {
    "id": 248,
    "title": "منظومہ اقبالیہ",
    "description": "ای اقبال! ہستی بہ افکار زندہ\nوجودت بانداز اشعار زندہ\n\nچہ پُر مغز و تازہ خیالات داری\nعجب سوز و ساز و کمالات داری\n\nاشارت بسوی حقائق نمودی\nسہل تر ز فکرت دقائق نمودی\n\nنہاں در کلام تو اسرارِ رُومی\nعیاں از بیان تو اذکارِ رُومی\n\nچو آئینہ شعر و ابیات دِیدم\nتفاسیر و توضیح آیات دِیدم\n\nچہ خوش بود قالِ تو در حال بودے\nنمود و خشیّت در اعمال بودے\n\nبمقصود پیش از مہ و سال رَفتن\nچہ خوب است از راہِ اقبال رَفتن\n\nنہاں را عیاں تر چو شہزادؔ خواہی\nچو اقبال جوئی ز رحمت پناہی"
  },
  {
    "id": 249,
    "title": "منقبت",
    "description": "علامہ محمد اقبالh\nای حکیمِ اُمت ! ای دانائی راز\n\nای دلت گنجینۂ سوز و گداز\nای گلِ گلزارِ عشقِ مُصطفٰی\n\nای چراغِ مجلس ناز و نیاز\nای کہ کحل چشمِ تو خاکِ نجف\n\nای کہ در انفاس تو بوی حجاز\nقبلۂ افکار تو اُمّ الکتاب\n\nپیشوایت عشقِ احمد در نماز\nای بلند اقبال ہمچو نام خویش\n\nپست پیشِ ہمتت کوہِ فراز\nچوں شدی ا ز ’’پیرِ رُومی‘‘ فیضیاب\n\nچشمِ سرّت التفاتش کرد باز\nای زبان خاور! ای شِیریں سخن\n\nقلب من با شعرِ تو دارد نیاز\nچوں شدم شہزادؔ با اقبال، من\n\nپیش من کوتاہ شد راہِ در"
  },
  {
    "id": 250,
    "title": "مہرِخراسان",
    "description": "مجموعۂ مناقب\nدرشان حضرت اخندزادہ\n\nسیف الرحمن پیر اَرچی مبارک h\nنقشبندیہ عجب قافلہ سالاران اند\n\nکہ برند از رہِ پنہاں بہ حرم قافلہ را\n(مولانا جامی)\n\nسلام\nاے شہ ملک ولایت السلام\n\nاے مہ چرخ طریقت السلام\nمرکز نور ہدایت السلام\n\nعاشق شمع رسالت السلام\nرہنمائے راہ حق و معرفت\n\nصاحب شان وجاہت السلام\nانت من اصحاب احوال القلوب\n\nواقف راز حقیقت السلام\nای شبیہِ تاجدار نقشبند\n\nای نگہبان شریعت السلام\nپیکر الفت ز سرتاپا شفیق\n\nباعث رشک مروت السلام\nفی زمانہ بے نظیر و بے مثال\n\nای مبارک! پاک طینت السلام\nذات پاک تست فخر اولیاء\n\nپیکر حق و صداقت السلام\nبارضاء و باعطا و باخدا\n\nپاسبان اہلسنّت السلام\nای رئیس حلقۂ اہل سلوک\n\nجان و جانانِ اطاعت السلام\nبے ردا شہزاد ہست ای خوش خصال\n\nکن عطا مارا ردایت السلام\nیک نظر کن سوئے شہزادؔ حقیر\n\nای مبارک از محبت السل"
  },
  {
    "id": 251,
    "title": "منقبت",
    "description": "منقبت درشان قیوم زماں حضرت اخندزادہ\nسیف الرحمن پیرا رچی h\n\nبہ پیر ارچی سلام گوئم\nبذرگ و عالی مقام گویم\n\nای سیدی ، مرشدی ، حبیبی\nترا زماں را امام گویم\n\nتو بایزید و جنید ثانی\nکہ بغض از تو حرام گویم\n\nبرائے ماکن دعا خدارا\nیک عرض با احترام گویم\n\nمحبت تو عبادت من\nبصد ادب من سلام گویم\n\nمجدّد وقت ، ای مبارک!\nثنائے تو صبح و شام گویم\n\nاے سیف رحماں ای مرشد من\nقبول کن ایں کلام گویم\n\nبرائے شہزادؔ ، ہست نعمت\nکہ مدحت تو مدام گویم!"
  },
  {
    "id": 252,
    "title": "منقبت",
    "description": "در شان قیوم زماں حضرت اخندزادہ\nسیف الرحمن پیرا رچی h\n\nسیف رحماں سید و سردار من\nسید و سردار من دلدار من\n\nمن نہ خواہم گنج ھا و تخت ھا\nہست دید روی تو درکار من\n\nمن نمی دانم زبان فارسی\nای مبارک ! کن قبول ایں کارمن\n\nشان تو بالاتر از گفتار ھا\nمن کجا آقا! کجا گفتار من\n\nمثل دشت خشک شد ایں قلب ما\nقلبِماکن گلستاں سرکار من\n\nدر طریقت آفتابی ، بی زوال\nتا ابد محتاج تو انوار من!\n\nکمتریں شہزادؔ ہست ای باکمال\nکن قبول از لطف ایں اشعار من"
  },
  {
    "id": 253,
    "title": "منقبت",
    "description": "درشان قیوم زماں حضرت اخندزادہ\nسیف الرحمن پیرا رچی h\n\nجز خدمت تو آقا! دگر کار نخواہیم\nبر خار تو خوش لالہ و گلزار نخواہیم\n\nما سادہ و ناچیز و گنہگار و سیہ کار\nخواہیم خدا ، جبہ و دستار نخواہیم\n\nبرپای تو قربان کنم قلب و جگر را\nداریم بہ دل عشق تو اظہار نخواہیم\n\nخواہیم وصال تو در ایں دنیا و عقبیٰ\nجز ہستیٔ تو ہیچ ، ای دلدار نخواہیم\n\nپوشیدہ ازین دہر شوم کاش چو عنقا\nمن شہرت خود برسرِ بازار نخواہیم\n\nدر بحر محیط تو رسد قطرئہ جانم\nمن فلسفہ و رفعت افکار نخواہیم\n\nتائب شدم از دعوٰیٔ سجادہ نشینی\nمن طالب حق جنت ابرار نخواہیم\n\nشہزادؔ غلام ابن غلام ابن غلامت\nبس غیر ازیں ھیچ ، ای سردار نخواہیم"
  },
  {
    "id": 254,
    "title": "منقبت",
    "description": "درشان قیوم زماں حضرت اخندزادہ\nسیف الرحمن پیرا رچی h\n\nای مہر خراسان! فدا بر تو کنم جان\nای مرشد ذیشان ! فدا بر تو کنم جان\n\nاز نسبت تو شد خس و خاشاک معزز\nای سیّد و سلطان! فدا بر تو کنم جان\n\nای مرشد ما ! غوث جہاں! عارف کامل\nای قاسم فیضان! فدا بر تو کنم جان\n\nتو ابر کرم! مظہر انوار الٰہی!\nکن برسرم احسان فدا بر تو کنم جان\n\nجز دیدئہ تر ہیچ نداریم کریما\nمن بے سروسامان ! فدا بر تو کنم جان\n\nدر نامۂ اعمال عمل نیک نبینم\nمن نادم و نادان ! فدا بر تو کنم جان\n\nارشاد تو تفسیر فرا مین پیمبر\nتعلیم تو قرآن فدا بر تو کنم جان\n\nای باعث تشہیر کمالات نبوت\nای مرد خدادان ! فدا برتو کنم جان\n\nتلقین تو اکسیر دگر گونی افکار\nای شاہد ایمان ! فدا بر تو کنم جان\n\nگمراہ ز الطاف تو شد رہبر و ہادی\nای رحمت رحمان ! فدا بر تو کنم جان\n\nبر حالت شہزادؔ بکن چشم تصرف\nہر لحظہ و ہر آن ! فدا بر تو کنم جان"
  },
  {
    "id": 255,
    "title": "منقبت",
    "description": "درشان قیوم زماں حضرت اخندزادہ\nسیف الرحمن پیرا رچی h\n\nدل ، جسم ، جگر ، جان ما قربان مبارک\nقیوم زماں غوث جہاں شان مبارک\n\nبے مثل درایں عصر کمالات سراپا\nاقطاب جہاں دست بہ دامان مبارک\n\nزیبا و قشنگ است قد و قامت حضرت\nپُر بادہ دلم گشت ز چشمانِ مبارک\n\nآرام مرا نیست بجز دید و زیارت\nدر قلب مکیں ہست بس ارمان مبارک\n\nاو سیدنا ، مرشدنا ، شیخ مشائخ\nاقطاب زمان خیل غلامان مبارک\n\nہر غنچہ و گل خنداں و رنگین و معطر\nزیبا و دل افروز گلستان مبارک\n\nکن شکر خدا ، حمد صمد ، ذکر الٰہی\nشہزادؔ شدی خادم دربان مبارک\n\nاز فضل خدا ، رحمت حق لطف الٰہی\nشہزادؔ شدہ شاعرِ ایوانِ مبارک"
  },
  {
    "id": 256,
    "title": "منقبت",
    "description": "درشان قیوم زماں حضرت اخندزادہ\nسیف الرحمن پیرا رچی h\n\nرونق بزم طریقت از تو است\nمحفل ما پرمسرت از تو است\n\nروشنیٔ چشم ما دیدار تو\nسینۂ ما پر حرارت از تو است\n\nقلب ، روح و سر ، خفی اخفیٰ ہمہ\nمائل ذکر و اطاعت از تو است\n\nہر غلام تو ولی اللہ شہا!\nدر جہاں باقی ولایت از تو است\n\nبر تو نازاں گشت شاہِ نقشبند\nزِندہ سرہندی روایت از تو است\n\nدرسھای تو طریق مصطفی\nآبروی استقامت از تو است\n\nدید تو شہزادؔ را عید سعید\nبا خدا مارا محبت از تو است"
  },
  {
    "id": 257,
    "title": "منقبت",
    "description": "حضرت مبارک صاحب h\nاللہ اللہ کمال شانِ تو\n\nانجمن انجمن بیانِ تو\nاز خراسان تابہ پاکستان\n\nیافتم جا بجا نشانِ تو\nشرح اوصاف تو شہا ، چہ کنیم\n\nوقف دین رسول جانِ تو\nرہروانِ صراط مستقیم\n\nعکس ذات تو پیروانِ تو\nاولیاء قطب و غوث لاریب اند\n\nراز دانان و واقفانِ تو\nمثل شمع فروزاں تو ہستی\n\nمثل پروانہ عاشقانِ تو\nفیض و عرفان، از تو وابستہ\n\nمرکز رشد آستانِ تو\nنعمت بے بہا وجودِ تو ست\n\nای خوشا یافتم زمانِ تو\nسنگ از صحبت تو گوہر شد\n\nپُر ز دُرہا تمام کانِ تو\nگشت پنجاب از تو پر انوار\n\nبے عدد اینجا خادمانِ تو\nگرد کعبہ کند طواف جہاں\n\nکعبہ چکر گر مکانِ تو\nذاکریں مثل عندلیبانِ اند\n\nزمزمہ خواں بہ گلستانِ تو\nرحم فرما کریما! بر حالم\n\nآمدم زیر سائبانِ تو\nسیف رحماں بگیر دست ما\n\nشد پریشان مدح خوانِ تو\nروز و شب می کند دعا شہزادؔ\n\nذاتِ حق باد پاسبانِ تو\nقصیدہ\n\nسیفیہ، رحمانیہ، در شانِ مجددالعصر، پیر طریقت حضرت\nاخندزادہ سیف الرحمن پیرارچیh\n\nیا الٰہی پاک تو سبحان تو\nخالق ارض و سما ذیشان تو\n\nمالک کونین ربّ بحر و بر\nصاحب و مختارِ کارِخیر و شر\n\nبعداز حمد خدا نعت رسول\nبہترین بعد از خدا ذات رسول\n\nسیدّالابرار شاہ دوسرا\nصاحب لولاک ، امام الانبیاء\n\nحضرت صدیق از صد ہا سلام\nکاروان عاشقاں را او امام\n\nبعد از حمد و درود و منقبت\nذکر خیر پیر عالی مرتبت\n\nسیف رحماںپیرا رچی نام اوست\nپر زنور معرفت ہر جام اوست\n\nمثل ہجویری و ہندی کار او\nمثل سرہندی ہمہ کر دار او\n\nآن کہ ناز دودمان نقشبند\nگفتگویش چون گلاب و برگِ و قند\n\nصحبت او باعثِ تسکین جان\nخادم دربار اوہر میرو خان\n\nدید روئش بہر من عید کلاں\nحسن او بالا تر از شعر و بیان\n\nمحفل او محفل ذکر خدا\nمجلس او بزم ذکر مصطفی\n\nپاک طینت نیک سیرت بے ریا\nمرشد من بارضا و باخدا\n\nہر ارادت مند را او سائباں\nدست او کوتاہ نیست از غائباں\n\nاللہ اللہ قلب را زندہ کند\nسیف رحماں ، سینہ تابندہ کند\n\nسیف رحماں، رہنمائے سالکاں\nسیف رحماں ، صدر بزم عارفاں\n\nای شہا ! شمشیر حق روشن ضمیر\nکن قبول از لطف ایں نذر حقیر\n\nنسبت تو ای شہا ! اعزاز من\nمدحت تو وجہ فخر و ناز من\n\nیا الٰہی رحم کن بر ذات او\nتاابد پائندہ باد ایں ھا و ہو\n\nفکر ما از یاد تو آباد شد\nچشم ما روشن دل ماشاد و شد\n\nمیشود شہزادؔ نغمہ خوان تو\nنغمہ خوان تو ، قصیدہ خوان تو\n\nبلبل گزار تو شہزادؔ شد\nشاعر دربار تو شہزادؔ شد"
  },
  {
    "id": 258,
    "title": "منقبت",
    "description": "حضرت مبارک صاحب h\nبزمِ اہلِ عشق رقصاں از نگاہ مست تو\n\nدشت قلبم شد گلستاں از نگاہِ مست تو\nلطف بر پنجاب کر دی ازرہ اہل قلوب\n\nتیرہ شب شد صبح تاباں از نگاہِ مست تو\nبے ثمر ہر نخل بود و خالی از بو گل تمام\n\nیک چمن شد ہر بیاباں از نگاہِ مست تو\nمحفل جذب و جنون و ذوق و شوق و ھاوہو\n\nپیرمن! ای سیف رحماں! از نگاہِ مست تو\nای کریما! طالب یک چشم لا ہوتی منم\n\nکار مشکل باشد آساں از نگاہِ مست تو\nای مجدد! جانشین شیخ سرہندی توئی\n\nنقشبندیت فروزاں از نگاہِ مست تو\nباغِ سُنّت میشود از آمد تو پر بہار\n\nزندہ دل قیوم دوراں از نگاہِ مست تو\nتشنہ لب شہزادؔ ہست اے ساقی ٔ جام و صال\n\nدارد ایں امیدِ احساں از نگاہِ مست "
  },
  {
    "id": 259,
    "title": "منقبت",
    "description": "درشان قیوم زماں حضرت اخندزادہ سیف الرحمن پیرا رچی h\nمزین ز صدق و صفا سیف رحماں\n\nمنور ز سر تابہ پا سیف رحماں\nبگویم چہ اوصاف قیوم عالم\n\nکہ اظہار شان خدا سیف رحماں\nبگفتار و کردار بے مثل و یکتا\n\nمقامات دارد جدا سیف رحماں\nرواں کاروان ولایت ز فیضش\n\nولی مقتدی ، مقتدا سیف رحماں\nتو سر خیل افواج اہل حقیقت\n\nتوئی رہبر و رہنما سیف رحماں\nز نور تو قلب و نظر شد منور\n\nتوئی زندہ رُود ھدٰی سیف رحماں\nکجامن غلام و کجا پیرارچی\n\nکجا من حقیر و کجا سیف رحماں\nتو بہر مریداں چنین سائبانی\n\nمددگار و مشکل کشا سیف رحماں\nفقیرانہ در بارگاہ تو آمد\n\nمگردان شہزادؔ را سیف رحم"
  },
  {
    "id": 260,
    "title": "منقبت",
    "description": "درشان حضرت سیدی اخندزادہ\nسیف الرحمن پیر ارچی h\n\nحیات دل اگر خواہی مرید شیخِ دوراں شو\nبیا ! ای طالب صادق غلام سیف رحماں شو\n\nتراکافی ست از صد ہا چلہ یک صحبت ایشاں\nچو خواہی قربت مولا ، قریب نقشبنداں شو\n\nبرای تجربہ در قریۂ فیضش گدائی کن\nبہ بر از باب الطا فش تجلی ہا و سلطاں شو\n\nاگر واصل شدن خواہی بہ اصل خویش ای سالک\nبصدقِ باطنی حلقہ بگوش پیر پیراں شو\n\nچرا وقف مئے حرص و ہوای نفس می باشی\nگزار ایں رسمہا و شامل تقریب مستاں شو\n\nرساند روح را از فیض ہو بر اَوجِ لاہوتی\nبیا و دستگیر دامن محبوب سبحاں شو\n\nدعا شہزادؔ کن بہر شفای آں شہِ ذیشاں\nفلاح کل اگر خواہی بہ پای شَیخ قرباں شو\n\n(حسب ارشاد حضرت مرشدی مبارک قدس سرہ"
  },
  {
    "id": 261,
    "title": "منقبت",
    "description": "شان حضرت سیدی اخندزادہ\nسیف الرحمن پیر ارچی h\n\nکریما! کریما! نگاہِ کرم کن\nخدارا خدارا نگاہِ کرم کن\n\nمریضانہ آمد ، بدر گاہت عالم\nمسیحا! مسیحا! نگاہِ کرم کن\n\nنداریم نسیان از ماسوا من\nمریضم طبیبا! نگاہِ کرم کن\n\nگرفتار شد در ہجوم مصائب\nغلام تو آقا! نگاہِ کرم کن\n\nبنام تو منسوبم الحمدللہ\nبر احوال مار ا نگاہِ کرم کن\n\nمگر داں نگا ہے ازیں داد خواہے\nبمن کار سازا نگا ہِ کرم کن\n\nبراحوال شہزادؔ ہم ملتفت شو\nز لطف و عطایا نگاہِ کرم کن"
  },
  {
    "id": 262,
    "title": "منقبت",
    "description": "حضرت اخندذادہ سیف الرحمن مبارک\nشیخ کامل ، پیر ارچی ، قبلۂ عالم اغث\n\nرحم کن برحال زارم ازپئے ہاشم اغث\nجز درِ لطف و عطائے تو کجا گیرم پناہ\n\nمرجع قلب و نظر جز تو کجا دارم اغث\nشانِ شایانِ کمالِ خویش ای مشکل کشا!\n\nبابِ فیض خود کشا ای نازش حاتم اغث\nیک نگاہِ تو کریما! درد جانم را علاج\n\nشد  دگرگوں حالِ من ای واقفِ حالم اغث\nبرسرِ پیکار ہستم من خلاف نفس خویش\n\nازرہ خسران گشتم تائب و نادم اغث\nبر دِل شہزادؔ باشد یک نگاہ التفات\n\nکشورِ اہل لطائف را توئی حاکم ا"
  },
  {
    "id": 263,
    "title": "منقبت",
    "description": "حضرت قطب دوراں\nمرشدی صوفی کندل خان h\n\nکمال دارد کمال صوفی\nنخواہد آمد مثال صوفی\n\nمحیط عالم جلال صوفی\nشبیہ یوسف جمال صوفی\n\nجلائے فکر و شعور از وے\nضیائے باطن خیال صوفی\n\nفروغ داد اونظام حق را\nدروغ ترسد ز قال صوفی\n\nموافق اہل صدق روحش\nخلاف باطل ، جدال صوفی\n\nوفا و فقر و غنا ، توکل\nہمیں ست مال و منا ل صوفی\n\nجواب خواہد ز اہل ہمّت\nکہ بار دارد سوال صوفی\n\nبہ وجد می برد سالکاں را\nلقائے حسن و جمال صوفی\n\nبیا ببیں گر نگاہ داری\nچہ ہست اوج کمال صوفی\n\nبیار شہزاد نغمۂ نو\nبخوان نظمی بہ حال صوفی\n\nکثیر شہزادؔ ہست باقی\nقلیل گفتم ز حال صوفی"
  },
  {
    "id": 264,
    "title": "منقبت",
    "description": "پیر طریقت صوفی کندل خان h\nاگر خواہی طریقت ، شو گدائے صوفی کندل\n\nبیا طالب ، ببین صدق و صفاائے صوفی کندل\nسکون قلب و روح مالقائے صوفی کندل\n\nخوشا ھستیم من زیر ردائے صوفی کندل\nکجا بودم کجا ہستم زخود پرسان میکنم\n\nصدا آمد کہ ہستی از د عائے صوفی کندل\nعدوّ اولیاء را حق عدوّ ، ذات خود گوید\n\nمکن ای معترض شک بروفائے صوفی کندل\nخدا آن روزہم آرد کہ پابوسی کنم او را\n\nببینم ذود روے دلرباے صوفی کندل\nاگر پرسی مقام او امام الاولیاء گویم\n\nکنند اہل ولایت اقتدائے صوفی کندل\nزیک نعرہ ھو زندہ بسازد قلب مردہ را\n\nصداے قم باذن اللہ ، صدائے صوفی کندل\nشفیق و مہربان من کریم و پاسبان من\n\nغنی ام در فقیری ، ازسخائے صوفی کندل\nمنم شہزاد ناکارہ گنہگاریم بے چارہ\n\nبہ دنیا آمدم شاید برائے صوفی کندل\nقلم عاجز زبان قاصر بیاں شہزادؔ نا ممکن\n\nشعور و شعر و فکر ما فداے صوفی کن"
  },
  {
    "id": 265,
    "title": "منقبت",
    "description": "اعلیٰ حضرت قطب زماں صوفی باصفا\nحضرت صوفی کندل خان h\n\nمحبوب ہمہ ، مرشد ما صوفی کندل\nہست عاشق محبوب خدا صوفی کندل\n\nسر تا بقدم صدق و صفا صوفی کندل\nدر عشق نبی ہست فنا صوفی کندل\n\nآں قطب جہاں ،صوفی و یکتائے زمانہ\nہم مرتبۂ اہل رضا صوفی کندل\n\nبے حال و پریشان شد ایں قلب زہجراں\nدل طالب دیدار شما صوفی کندل\n\nای سیدی! ای مرشدی! ای پیر طریقت\nمن خادم خدام شما صوفی کندل\n\nشد قلب سیہ نور علیٰ نور زفیضش\nوے جانِ کرم، روحِ سخا صوفی کندل\n\nاللہ کند مرتبہ ات بالا و والا\nبا عجز و نیاز است دعا صوفی کندل\n\nشہزادؔ زہے مرشد ما قطب زمانی\nآں مظہر حق گنج وفا صوفی کندل"
  },
  {
    "id": 266,
    "title": "قطعہ تاریخ وفات",
    "description": "حضرت مرشدنا صوفی کندل خان صاحب مبارکh\nصوفیٔ بے مثل بود و واقف اسرار بود\n\nپیکر صدق و توکل ، صاحب کردار بود\nظلمت جاں از فیوضش گشت صبح تابناک\n\nپیرمن شہزادؔ واللہ ، مظہر انوار بود\n۱۴۱۵ھ\n\n(متوفی ٰ ۷ شعبان ۱۴۱۵ھ جنوری 1995"
  },
  {
    "id": 267,
    "title": "منقبت",
    "description": "علّامہ عبد الحکیمشرف قادری h\n’’بیاد ِروئے شرف‘‘\n\nدلا بیا کہ حکایت کنم زروئے شرف\nشرف دہیم بیاں رابگفتگوئے شرف\n\nفروغ داد بگیتی علوم و حکمت را\nبلند تر ز فلک رفت آبروئے شرف\n\nدلش ز نور ولائے رسول پر بودے\nچرا بہشت نباشد بہ جستجوئے شرف\n\nچو بود خادم قرآن و دین و شرع متیں\nخمیدہ فرق شہاں ہست روبروئے شرف\n\nشرف گرفت زمولا باسم عبد حکیم\nبفیض علم ، شرف شد رواں بسوئے شرف\n\nتہی نگشت گدائے زباب دانش او\nنہ تشنہ رفت کسے از کنار جوئے شرف\n\nچنیں مربی و مشفق دلا کجا یابی\nبیا بیا کہ روانہ شوم بکوئے شرف\n\nچو گشت فائز سجادئہ شرف ممتاز\nکہ در وجود سعید است مو بہ موئے شرف\n\nبفیض اسوئہ سلطانِ انبیاء شہزادؔ\nعزیز ا ہل نظر گشت خلق و خوئے شرف"
  },
  {
    "id": 268,
    "title": "منقبت",
    "description": "حضرت پیر سید نصیرالدین نصیرگولڑویh\nبیادِ نصیر\n\nز بزم اہل سخن رفت آ بروئے سخن\nکجا کلیم کہ می کرد گفتگوئے سخن\n\nاگر تو گوش بداری بیابہ بزم نصیر\nازو ملائکہ دارند آرزوئے سخن\n\nببیں ہنوزہم آغوش حیرتے دارد\nہماں ست ’’رنگ نظام‘‘ و ہماں ست خوئے سخن\n\nبفیض مدح نبی و ولائے آل نبی\nبکنج گور رواں ہست آبجوئے سخن\n\nبرنگ بیدل و جامی و خسرو و حافظ\nبفیض نسبتے او تابناک روئے سخن\n\nچو گفت نعرہ تکبیر در جہانِ انا\nشدند ہمچو بتاں ساکنان کوئے سخن\n\nسکوت کرد چو آں بلبل ہزار نوا\nتہی ز شوق ازاں ہست ہاوہوئے سخن\n\nنمائی جلوہ زیباکہ منتظر باشند\nبرائے دید شما بادہ و سبوئے سخن\n\nسرود زمزمۂ شعر در خرابہ ما\nمعطر از دم او باد مشکبوئے سخن\n\nرسید تا لب من سوزش دلے شہزاد ؔ\nبیا کہ قصد کنم جانب نکوئے سخن"
  },
  {
    "id": 269,
    "title": "نذرِ نصیر",
    "description": "دیدم یکے دل دادئہ عبدالقادر\nثابت قدمے جادئہ عبدالقادر\n\nمداح کمال شہ جیلاں شہزادؔؔ\nدر گولڑہ شہزادۂ عبدالقادر"
  },
  {
    "id": 270,
    "title": "منقبت",
    "description": "پیرزادہ اقبال احمد فاروقیh\nخوشا چہ حسن و بیان کلام فاروقی\n\nشنو! کلام بلاغت نظام فاروقی\nتمتع کرد زہر گوشۂ جہان رضا\n\nزہے روان و دل شاد کام فاروقی\nچو ہم سخن نہ شدی روبمجلس اقبال\n\nکشادہ ہست در فیض عام فاروقی\nدلت ہوائے لقائے گزشتگاں دارد\n\nبیار طائر جاں را بہ دام فاروقی\nخبر زحال دل اہل حال ہم دارد\n\nکنند اہل نظر احترام فاروقی\nبایں بزرگی و پیری ہم است زندہ دلے\n\nچہ دلکش است بلوغ المرام فاروقی\nبفیض صحبت و دیدار عارفاں شہزادؔ\n\nچہ تابناک شدہ صبح و شام فارو"
  },
  {
    "id": 271,
    "title": "حصہ پنجابی",
    "description": "حمد باری تعالیٰ\nپچھلے دکھ بھلا دے مولا\n\nازمائشاں دی پٹھی دے وچ\nکچی ڈھیم پکا دے مولا\n\nاک گردن سو وار کٹاواں\nایسا فن سکھا دے مولا\n\nگھمن گھیری وچ آ پھسیاں\nمینوں پار لنگا دے مولا\n\nبندہ نئیں جے اُف وی کرجاں\nمیرا انگ انگ ڈھا دے مولا\n\nتیری سونہہ ایں سہہ جاواں گا\nاپنا آپ وکھا دے مولا\n\nلوکی ایس وچ شکلاں ویکھن\nدل شیشہ لشکادے مولا\n\nکرب و بلا جئے زہر پیالے\nمیرے منہ نوں لا دے مولا\n\nاپنی ایس تخلیق دے اتے\nاپنا رنگ چڑھا دے مولا\n\nجتھوں اے شہزادؔ سی ٹریا\nاوتھے ای پہنچا دے مولا"
  },
  {
    "id": 272,
    "title": "نعت شریف",
    "description": "کیتی اے جنہاں عاشقاں مدحت حضور دی\nاوہناں تے خاص ہندی اے شفقت حضور دی\n\nدھپاں چ تپ دی ریت تے پیندا اے لیٹناں\nایویں نئیں جے لب دی قربت حضور دی\n\nسوہنے نبی دے عشق دا چکھ لے توں ذائقہ\nمنہ تے سجا کے ویکھ لے سنت حضور دی\n\nچمکن ناں کیویں تاریاں وانگوں اوہ اکھیاں\nویکھی اے جنہاں خواب وچ صورت حضور دی\n\nآوندی اے آپ چل کے منزل اوہناں دے کول\nہووے جنہاں دے سامنے سیرت حضور دی\n\nدعویٰ نبی دے عشق دا ایویں ناں کر بئیں\nملدی اے من نوں مار کے نسبت حضور دی\n\nرہنی کدوں ایں یاد غُلاماں نوں کوئی شے\nہوئی جدوں نصیب زیارت حضور دی\n\nمحشر نوں ربّ دے سامنے ویکھیں تو منکرا!\nنبیاں وی منگنی ایں شفاعت حضور دی\n\nتیرا اے کی وگاڑناں شہزادؔ مشکلاں\nتیرے تے نال نال اے رحمت حضور دی"
  },
  {
    "id": 273,
    "title": "منقبت",
    "description": "حضرت علی المرتضیٰ شیر خدا t\nاچا مرتبہ نبی دے ویر دا اے\n\nکہیا نبی نے علم دا باب اوہنوں\nاوہنے کھولے نے علم دے بند بوہے\n\nکہیا نبی نے ابوتراب اوہنوں\nعلی آپ مشیر شیخین دا سی\n\nسارے پتا سن ادب آداب اوہنوں\nکیتے مڈھلے فیصلے آپ اوہنے\n\nانج ملے گا پورا ثواب اوہنوں\nجنہے علی دا مرتبہ منیاں نئیں\n\nپیش پے جانا ایں عذاب اوہنوں\nجیہڑے سینے چ حب صدیق دی اے\n\nنئیں جے علی دے بغض دی تاب اوہنوں\nجیہڑا دلوں صحابہ دی شان منے\n\nکردا وقت نئیں کدی خراب اوہنوں\nنبی پاک نے دین ایمان والا\n\nسارا آپ پڑھایا نصاب اوہنوں\nسوہنے رب نے علم خزانیاں چوں\n\nدتا خاص حصہ بے حساب اوہنوں\nایہہ شہزادؔ حدیث حضور دی اے\n\nکہیے علم دے شہر دا باب اوہن"
  },
  {
    "id": 274,
    "title": "سلام بحضور امام عالی مقامt",
    "description": "حسین ابن علی دی ہر اک ادا نوں سلام\nصدا قتاں نوں ، دلیری نوں تے وفا نوں سلام\n\nعلی دے لاڈلے لیٹے نیں تیرے ویہڑے وچ\nاے کربلائے معلی تری فضا نوں سلام\n\nسلام حضرتِ زینب دی پاک چادر نوں\nعقیدتاں نیں کہیا بنتِ مرُتضیٰ نوں سلام\n\nخدا دے فضل نے لایا حسین نوں سینے\nکہیا فلک نیں شہیداں دے بادشا نوں سلام\n\nرسول پاک تے، حیدر تے ، فاطمہ تے درود\nنبی تے آل نبی دے ہر اک گدا نوں سلام\n\nیزیدیاں تے ہے اج وی ترے علم دا جلال\nعباس ابن علی! تیری خاک پا نوں سلام\n\nحسین نال جو جڑیا اوہ تر گیا شہزادؔ\nگدا نوں آپ جو لبھدی اے اوس عطا نوں سلام"
  },
  {
    "id": 275,
    "title": "منقبت",
    "description": "حضرت غوث اعظمt\nنرالی تری ہر ادا غوث اعظم\n\nولی تیرے مدح سرا غوث اعظم\nنقاب اپنے رخ توں ہٹا غوث اعظم\n\nتے سینے دے وچ ٹھنڈ پا غوث اعظم\nترے سر تے سایہ حسین و حسن دا\n\nمحمد دا توں لاڈلا غوث اعظم\nقطب غوث سارے بڑی شان والے\n\nتیری شان سب توں جدا غوث اعظم\nنبوت دے سلطان خیرالورٰی نیں\n\nولایت دا توں بادشا غوث اعظم\nتسلی ملے میرے بے چین دل نوں\n\nذرا اپنی صورت وکھا غوث اعظم\nتیرے فیض دا وی مزہ چکھ لواں میں\n\nکدی اپنے در تے بلا غوث اعظم\nجویں رنگ سلطان باہو تے چڑھیا\n\nاوہو رنگ دل تے چڑھا غوث اعظم\nپریشان ہوواں نہ محشر دے دن میں\n\nرویں کول روز جزا غوث اعظم\nقدم انج ولیاں دی گردن دے اتے\n\nدھرے کون تیرے سوا غوث اعظم\nخدا موت دیوے مدینے چ مینوں\n\nکرو میرے حق وچ دعا غوث اعظم\nکرو ہن تے شہزادؔ ول وی اشارہ\n\nاے ہووے غماں توں رہا غوث اع"
  },
  {
    "id": 276,
    "title": "منقبت",
    "description": "حضرت اخندزادہ سیف الرحمن مبارک h\nمحبوب سبحانی سوہنا\n\nپیر مرا افغانی سوہنا\nپیر میرے دا چہرہ ویکھو\n\nسنت والا سہرا ویکھو\nجیویں چن اسمانی سوہنا\n\nپیر مرا افغانی سوہنا\nولی بناون جیہڑے چوراں\n\nخادم اس دے قطب دوراں\nاوہ قیوم زمانی سوہنا\n\nپیر مرا افغانی سوہنا\nداتا صاحب علی ہجویری\n\nیا ہوون خواجہ اجمیری\nاینہاں دا اے ہانی سوہنا\n\nپیر مرا افغانی سوہنا\nسو ہنی صورت ، سو ہنی سیرت\n\nچلدی پھردی نوری صورت\nتقوے وچ لاثانی سوہنا\n\nپیر مرا افغانی سوہنا\nنال توجہ قلب چلاوے\n\nمردہ دل وچ روحاں پاوے\nونڈے نور ایمانی سوہنا\n\nپیر مرا افغانی سوہنا\nمردہ دل نوں زندہ کردا\n\nہر سالک دی جھولی بھردا\nاوہ قطب ربانی سوہنا\n\nپیر مرا افغانی سوہنا\nپیر مرا شہزادؔ مجاہد\n\nخادم اوہدے عابد ، زاہد\nکردا حق بیانی سوہنا\n\nپیر مرا افغانی سوہ"
  },
  {
    "id": 277,
    "title": "روحی سجن بیلی",
    "description": "پہلی یاری رب نے لائی نال محمد پیارے\nباقی سجن بیلی جگ تے صدقہ اوس دا سارے\n\nتاں جے دل دا جانی کوئی دکھ سکھ بیٹھ ونڈائے\nایسے گلے پاک نبی وی چارے یار بنائے\n\nبدل دید تیری دا پیرا انج کنیاں بر ساوے\nسکے رُکھ امیداں والے ہو جاون نت ساوے\n\nانج تے بیلی ملن ہزاراں کوئی کوئی دل داجانی\nسچا اوہ جو یار دی خاطر دیوے ہر قربانی"
  },
  { "id": 278, "title": "", "description": "" },
  {
    "id": 279,
    "title": "حمدباری تعالیٰ",
    "description": "جرم ہیں بے حساب یا توّاب\nکھول بخشش کا باب یا توّاب\n\nپیاس بجھ جائے کشت باطن کی\nبھیج ایسا سحاب یا توّاب\n\nبخش تسکین قلب کو میرے\nدور ہو اضطراب یا توّاب\n\nسن صدا ’’ربنا ظلمنا‘‘ کی\nبخش بے احتساب یا توّاب\n\nآنکھ نم ہے جبیں عرق آلود\nقلب ہے آب آب یا توّاب\n\nتیرے لطف و کرم کے دریا سے\nمیں رہوں فیضیاب یا توّاب\n\nمیرے عیبوں پہ ڈال دے پردہ\nٹال سارے عذاب یا توّاب\n\nتیری رحمت بنا بھی دیتی ہے\nمعصیت کو صواب یا توّاب\n\nجس کو تو خود سنوارنا چاہے\nوہ ہو کیسے خراب یا توّاب\n\nمجھ کو خوگر بنا اطاعت کا\nبخش علم الکتاب یا توّاب\n\nتو ہے ارحم ترا رسول رحیم\nہوگا کس پر عتاب یا توّاب\n\nدل سے نکلی ہے سوز و درد کے ساتھ\nہو دعا مستجاب یا توّاب\n\nظلمت جاں کو نور کر اے نور!\nہو حقیقت یہ خواب یا توّاب\n\nقرب شہزادؔ کو نواز اپنا!\nاب اٹھا دے حجاب یا توّاب"
  },
  {
    "id": 280,
    "title": "حمدباری تعالیٰ",
    "description": "تیری جانب جو دھیان باقی ہے\nاس لیے تو جہان باقی ہے\n\nتیری یادوں کے فیض سے مولا\nقلب پہ امتنان باقی ہے\n\nاور ہر چیز کے لیے ہے فنا\nایک تیری ہی شان باقی ہے\n\nجو ترے رنگ سے ہوئے رنگین\nان کا نام و نشان باقی ہے\n\nدم بھروں میں تری اطاعت کا\nجب تلک تن میں جان باقی ہے\n\nکروٹیں لیں کئی زمانے نے\nپر ترا سائبان باقی ہے\n\nبخش دے گا گناہگار کو تو\nیہ یقیں ، یہ گمان باقی ہے\n\nمٹ گئے نام بادشاہوں کے\nذکر تیرا ہر آن باقی ہے\n\nجانے شہزادؔ کس ادا کے طفیل\nیہ زمین آسمان باقی ہے"
  },
  {
    "id": 281,
    "title": "حمدباری تعالیٰ",
    "description": "تیرے جلوے ہیں ہر جگہ ہر سو\nآنکھ ہو تو فقط ہے تو ہی تو\n\nکس کلی میں نہیں ہے رنگ ترا\nکس چمن میں نہیں تری خوشبو\n\nآئنہ خلد کا بنے یہ جہاں\nتیرے بندوں میں گر ہو تیری خو\n\nتیری رحمت سے فیضیاب ہے وہ\nجس کا دل کہہ رہا ہو اللہ ھُو\n\nجذب ایسا مجھے عطا فرما!\nبھول جائیں مجھے یہ کاخ و کو\n\nنَحْنُ مِنْ مُسْلِمِیْنَ اَسْلَمْنَا\nاِنَّـکَ قُلْتَنَا فَلاَ تَہِنُوْا\n\nمن میں شہزادؔ کے ہے تیری لگن\nخوگر حمد تن کا ہے ہر مُو"
  },
  {
    "id": 282,
    "title": "حمدباری تعالیٰ",
    "description": "تو اصل حسن و جمال یا رب!\nتو خالق ہر کمال یا رب!\n\nہر ایک تشبیہہ سے منزّہ\nنہیں ہے تیری مثال یا رب!\n\nترا تصرف ہے خشک و تر پر\nترے ہیں دشت و جبال یا رب!\n\nبڑائی شایانِ شاں ہے جس کے\nتو ہے وہی ذوالجلال یارب!\n\nتجھے ہی زیبا ہے بس تکبر\nہے فخر تیرا ہی مال یارب!\n\nمجھے عطا ہو یقیں کی دولت\nچلا تواضع کی چال یارب!\n\nکھڑا ہے کاسہ بدست سائل\nجواب چاہے ، سوال یا رب!\n\nگدا کو بخشے جو بے نیازی\nعجب ہے تیرا خیال یارب!\n\nکہیں قدم لڑکھڑا نہ جائے\nسنبھال مجھ کو سنبھال یارب!\n\nاٹھی ہے سینے میں اک چبھن سی\nورائے حزن و ملال یارب!\n\nمیں مستحق ہوں مجھے عطا ہو\nزکوٰۃ عشق بلال یا رب!\n\nہوا ہے تیغ ہوس کا حملہ\nعطا ہو رحمت کی ڈھال یارب!\n\nکرے جو شہزادؔ کوئی دعویٰ\nکہاں یہ اس کی مجال یارب!"
  },
  {
    "id": 283,
    "title": "حمدباری تعالیٰ",
    "description": "جرم میرے ہزار یا غفار\nرحم تیرا شعار یا غفار\n\nکر نہ پائے گا کوئی پیمانہ\nتیرے احساں شمار یا غفار\n\nمیں ہوں اک عبد بے نوا تیرا\nتو ہے پروردگار یا غفار!\n\nتیری رحمت سے ہے فرشتوں میں\nآدمی کا وقار یا غفار!\n\nمطلع جاں سے اب اتار ہی دے\nخواہشوں کا غبار یا غفار!\n\nعاجزی عبد کا لبادہ ہے\nکبر تیرا ازار یا غفار!\n\nنفس کو بادئہ تغافل کا\nچڑھ نہ جائے خمار یا غفار!\n\nمیں ہوں بیم و رجا کی کشتی میں\nپار مجھ کو اتار یا غفار!\n\nتیرے جود و سخا پہ پلتے ہیں\nمفلس و تاجدار یا غفار!\n\nکاش ہو طور اک تجلیّ سے\nقلب تیرہ و تار یا غفار!\n\nباغ عرفان میں رہے شہزادؔ\nمثل باد بہار یا غفار!"
  },
  {
    "id": 284,
    "title": "حمدباری تعالیٰ",
    "description": "یاالٰہی مجھے میرے شر سے بچا\nمجھ کو ابلیس کے ہر اثر سے بچا\n\nاپنی رحمت کے سائے میں محفوظ رکھ\nفتنہ زن سے ، تعظیم زر سے بچا\n\nمجھ کو اپنی اطاعت کی توفیق دے\nدین و دنیا میں خوف و خطر سے بچا\n\nجس پہ چل کر خسارہ اٹھانا پڑے\nمجھ کو ایسی ہر اک رہگزر سے بچا\n\nدے توازن طبیعت کو ہر حال میں\nمجھ کو تاثیر ہر خشک و تر سے بچا\n\nبخش اپنی حضوری کا مولا شرف\nمجھ کو غفلت پہ مبنی خبر سے بچا\n\nجس میں پنہاں ہو تاثیر بغض و حسد\nمیری ہستی کو ایسی نظر سے بچا\n\nجس میں تیرے نبی ا  کی محبت نہ ہو\nہر مسلمان کو اس ڈگر سے بچا\n\nہم کو حفظ مراتب کی توفیق دے\nعیب جویانِ خیرالبشر سے بچا\n\nپھر سے نمرودیت ہے مرے سامنے\nمجھ کو فرعونِ حاضر کے شر سے بچا\n\nمجھ کو ذوق قناعت کی خیرات دے\nاپنے سائل کو غیروں کے در سے بچا\n\nکر دے سجدہ جو تیرے سوا اور کو\nمیرے تن کو سدا ایسے سر سے بچا\n\nجس میں تحسیں نہ ہو ، جسٍ میں تسکیں نہ ہو\nاس سفر سے بچا ، اس حضر سے بچا\n\nیا الٰہی مری روح کو پاک رکھ!\nمیرے باطن کو ہر شوروشر سے بچا\n\nبخش عصمت کا شہزادؔ کو سائباں\nہر گھڑی حب اموال و زر سے بچا"
  },
  {
    "id": 285,
    "title": "حمدباری تعالیٰ",
    "description": "میں نے کہا تو کون ہے؟ اس نے کہا ربّ جہاں\nمیں نے کہا کیا نام ہے؟ اس نے کہا شاہِ جہاں\n\nمیں نے کہا رحمت تری؟ اس نے کہا ہے بیکراں\nمیں نے کہا قدرت تری؟ اس نے کہا ہر دم عیاں\n\nمیں نے کہا کیا کام ہے؟ اس نے کہا جود و کرم\nمیں نے کہا کیا شان ہے؟ اس نے کہا فوق از گماں\n\nمیں نے کہا کیا لائوں میں؟ اس نے کہا بس عاجزی\nمیں نے کہا میں کیا کروں؟ اس نے کہا میرا بیاں\n\nمیں نے کہا تیرا پتہ؟ اس نے کہا قلب حزیں\nمیں نے کہا رخت سفر؟ اس نے کہا عزم جواں\n\nمیں نے کہا میں کیا بنوں؟ اس نے کہا بندہ مرا\nمیں نے کہا خدمت ہے کیا؟ اس نے کہا آہ و فغاں\n\nمیں نے کہا سائل ہوں میں؟ اس نے کہا کچھ مانگ لے\nمیں نے کہا تیری رضا؟ اس نے کہا دیدی ہے ہاں\n\nمیں نے کہا ذات نبی؟ اس نے کہا مقصود کل\nمیں نے کہا کعبہ ہے کیا؟ اس نے کہا میرا نشاں\n\nمیں نے کہا شہزادؔ کا؟ اس نے کہا سب ٹھیک ہے\nمیں نے کہا محشر کے دن؟ اس نے کہا دوں گا اماں"
  },
  {
    "id": 286,
    "title": "حمدباری تعالیٰ",
    "description": "سب سے افضل سب سے اعلیٰ تیرا نام\nسب سے بہتر سب سے بالا تیرا نام\n\nاول ، آخر ، ظاہر ، باطن تیری شان\nہر اونچے کی سوچ سے اونچا تیرا نام\n\nملتی ہے تسکیں اسی سے روحوں کو\nکتنا میٹھا ، کتنا پیارا تیرا نام\n\nشاہد ہے ہر ذرہ تیری قدرت پر\nلکھا ہے ہر چیز پہ مولا تیرا نام\n\nمیری ہر اک رگ میں کرنیں رقصاں ہیں\nجب سے صحن روح میں چمکا تیرا نام\n\nجب بھی شاخ نخلِ تمناّ خشک ہوئی\nآس کا بادل بن کر برسا تیرا نام\n\nجس کے دل کی آنکھ خدایا روشن ہے\nاس نے ہر سو روشن دیکھا تیرا نام\n\nاس دن سے اک کیف سا اس پر طاری ہے\nجس دن سے شہزادؔ نے جانا تیرا نام"
  },
  {
    "id": 287,
    "title": "حمدباری تعالیٰ",
    "description": "وہی مصور وہی ہے باری رضیت باللہ رضیت باللہ\nاسی کی حمد و ثنا ہے ساری رضیت باللہ رضیت باللہ\n\nوہی ہے خالق وہی ہے مالک وہ سب کا رب ہے وہ سب کا رازق\nاسی کا سکہ جہاں میں جاری رضیت باللہ رضیت باللہ\n\nوہی ہے معبود عالمیں کا وہی نگہباں ہے اس زمیں کا\nاسی کو لائق ہے تاجداری رضیت باللہ رضیت باللہ\n\nوہی تو مطلوب انبیاء ہے وہی تو مقصود اصفیا ہے\nاسی کی خاطر ہے اشکباری رضیت باللہ رضیت باللہ\n\nہیں اس کے قبضے میں سب خزانے اسی کے دریوزہ گر زمانے\nوہی تو کرتا ہے چارہ کاری رضیت باللہ رضیت باللہ\n\nخدائے جن و بشر وہی ہے حقیقتاً مقتدر وہی ہے\nاسی کے نوری اسی کے ناری رضیت باللہ رضیت باللہ\n\nرحیم ہے وہ کریم ہے وہ عظیم تر سے عظیم ہے وہ\nوہی مٹائے گا بے قراری رضیت باللہ رضیت باللہ\n\nچمن میں بلبل کا چہچہانا ، سحر کو غنچوں کا کھلکھلانا\nاسی نے دی گل کو طرح داری رضیت باللہ رضیت باللہ\n\nاسی سے شہزادؔ ہے محبت اسی کی کرتے ہیں ہم عبادت\nاسی کا دل پر ہے خوف طاری رضیت باللہ رضیت باللہ"
  },
  {
    "id": 288,
    "title": "حمدباری تعالیٰ",
    "description": "یوں تو کرتے ہیں فرشتے بھی عبادت تیری\nآئی انسان کے حصے میں نیابت تیری\n\nتیرا آغاز بھی اب تک نہ کوئی جان سکا\nکون جانے کہ کہاں تک ہے نہایت تیری\n\nانبیاء ہی نے کرایا ہے تعارف تیرا\nانبیاء ہی نے بیاں کی ہے روایت تیری\n\nہو سکا ارض و سما سے نہ تحمل جس کا\nآخر انساں نے سنبھالی ہے امانت تیری\n\nمست رکھتا ہے سمندر کو تصور تیرا\nکوہ کو وجد میں لاتی ہے حکایت تیری\n\nچاند ، تارے ہیں ترے حسن کا مظہر مولا!\nلالہ و گل سے نمایاں ہے نفاست تیری\n\nتیری تسبیح کے خوگر ہیں پرندے سارے\nپتے پتے سے عیاں ہوتی ہے عظمت تیری\n\nقلب کی آنکھ کھلی ہو تو پتہ چلتا ہے\nتیرا عرفان ہے کیا ، کیا ہے حقیقت تیری\n\nاپنی تسخیر کی کوشش میں لگا ہے کب سے\nچاہتا ہے ترا شہزادؔ حمایت تیری"
  },
  {
    "id": 289,
    "title": "حمدباری تعالیٰ",
    "description": "میں اپنے دل میں تیرے ذکر کی محفل سجاتا ہوں\nمرے مالک! میں تیری یاد میں تسکین پاتا ہوں\n\nمراقب ہو کے تیرے قرب کی لذت اٹھاتا ہوں\nمیں رنگ و نور کے چشموں میں اس صورت نہاتا ہوں\n\nکبھی میں اَنْفسُ و آفاق میں چکر لگاتا ہوں\nکبھی عرش معلی سے بھی آگے گھوم آتا ہوں\n\nحواس خمسۂ باطن میں تیرا شوق بڑھتا ہے\nتری تسبیح کے نغمات جب میں گنگناتا ہوں\n\nتخیل رابطہ کرتا ہے جب اصل لطائف سے\nبڑی مشکل سے اپنے آپ میں اس دم سماتا ہوں\n\nترے فیضان سے ہیں قلب ، روح و سر ، خفی روشن\nترے لطف و کرم کی روشنی سے جگمگاتا ہوں\n\nبہ فیضِ اسم احمد کوئی دم ایسا بھی ہوتا ہے\nمیں اپنی روح کو سرکار کے روضے پہ پاتا ہوں\n\nدرود پاک جب پڑھتا ہوں میں کامل حضوری سے\nکبھی بطحا میں ہوتا ہوں کبھی طیبہ کو جاتا ہوں\n\nخیال آتا ہے اے شہزادؔ جب اعمال نامے کا\nندامت سے خدا کے سامنے سر کو جھکاتا ہوں"
  },
  {
    "id": 290,
    "title": "حمدباری تعالیٰ",
    "description": "یاالٰہی بے کسوں کا آسرا تو ہی تو ہے\nسربلندی کی حدوں کا منتہا تو ہی تو ہے\n\nتیرے حسن خلق کا مظہر ہیں یہ شمس و قمر\nجس کی ہر تخلیق ٹھہری دلربا تو ہی تو ہے\n\nمیرے دل کے وسوسے بھی تجھ سے پوشیدہ نہیں\nمجھ سے بڑھ کر ہے جسے میرا پتا تو ہی تو ہے\n\nتیری جانب ہے توجہ جسم و جان و روح کی\nمیرے مولا! مرجع حرف دعا تو ہی تو ہے\n\nتیرے اوصاف و محاسن کا بیاں ممکن نہیں\nمیری ہر حمد و ثنا سے ماورا تو ہی تو ہے\n\nبن گیا شہزادؔ تیرے لطف سے عبدالنبی\nجس کے بندے ہیں نبی وہ ذوالعُلا تو ہی تو ہے"
  },
  {
    "id": 291,
    "title": "حمدباری تعالیٰ",
    "description": "ہے عالم کا روزی رساں میرا اللہ\nہے خلاّق و ربِّ جہاں میرا اللہ\n\nورائے حدِ ہر گماں میرا اللہ\nعیاں میرا اللہ نہاں میرا اللہ\n\nکہاں ہے وہ لیکن ، کہاں وہ نہیں ہے\nیہاں میرا اللہ وہاں میرا اللہ\n\nتصرّف ہے دارین میں اس کا جاری\nہے مقصود ہر انس و جاں میرا اللہ\n\nکھلا کر دلوں میں معارف کے غنچے\nسجاتا ہے گلزار جاں میرا اللہ\n\nمیں کیا اس کی شہزادؔ توصیف لکھوں\nکہاں میں ضعیف اور کہاں میرا اللہ"
  },
  {
    "id": 292,
    "title": "حمدباری تعالیٰ",
    "description": "ابتدا تو ہے انتہا ہے تو\nاے کہ خلاّق دوسرا ہے تو\n\nسجدہ کرتے ہیں انبیاء تجھ کو\nاے کہ معبود مصطفی ہے تو\n\nمصدر لطف ، بارگاہ تیری\nمرجع آہ نارسا ہے تو\n\nراحت قلب و جاں ہے ذکر ترا\nمنبع رحمت و عطا ہے تو\n\nاے غنی! مغنی ، اجود الاجواد\nاپنے ہر وصف میں جدا ہے تو\n\nبخش میرے گناہ اے غفار!\nغافر الذنب والخطا ہے تو\n\nتیرا ہر چیز پر تصرف ہے\nکیوں کہ ہر چیز کا خدا ہے تو\n\nکیوں نہ شہزادؔ تیری حمد لکھے\nخالق حسن والضحیٰ ہے تو"
  },
  {
    "id": 293,
    "title": "حمدباری تعالیٰ",
    "description": "راحت افزا عجب ہے ذکر ترا\nمغفرت کا سبب ہے ذکر ترا\n\nزینتِ نطق ، تیرا اسم عظیم\nوجہِ تحریک لب ہے ذکر ترا\n\nوقت کے ہاتھ میں تری تسبیح\nگردش روز و شب ہے ذکر ترا\n\nبندگی ، حلم ، آگہی ، ایثار\nدیکھا جائے تو سب ہے ذکر ترا\n\nبے بسی کی سیاہ راتوں میں\nروشنی کا سبب ہے ذکر ترا\n\nجس کا احصا کرے زبانِ بشر\nاتنا محدود کب ہے ذکر ترا\n\nتیرے ارشاد سے ہوا معلوم\nذکر شاہ عرب ہے ذکر ترا\n\nجس کو نسبت ہے تیرے پیاروں سے\nاس زمیں کا ادب ہے ذکر ترا\n\nفکرِ شہزادؔ کے لیے لاریب\nباعثِ تاب و تب ہے ذکر ترا"
  },
  {
    "id": 294,
    "title": "حمدباری تعالیٰ",
    "description": "اے رحیم و کریم اے ستار\nتو نے بخشا ہے آدمی کو وقار\n\nفضل درکار ہے گناہوں کو\nاے حلیم و وکیل اے غفار\n\nبات بنتی ہے تیری رحمت سے\nاے شہید و حمید اے مختار\n\nبھر دے مولا ثناء کے پھولوں سے\nمیرے فکر و شعور کا گلزار\n\nآسمان و زمیں یہ شمس و قمر\nتیری صنعت گری کا ہیں اظہار\n\nسج کے آئے رخ رسالت پر\nتیری توحید کے حسیں انوار\n\nتیری تسبیح مجھ سے ہو نہ سکی\nہے مرے لب پہ عجز کا اقرار\n\nجو ہوا مجھ سے میں نے کر دیکھا\nمیرے حالات کو اب آپ سنوار\n\nنفس کے شر سے مجھ کو رکھ محفوظ\nبھوت خواہش کا میرے سر سے اتار\n\nحمد شہزادؔ سے ہو کیا تیری\nتو ہے بے عیب اور میں بے کار"
  },
  {
    "id": 295,
    "title": "مناجات",
    "description": "فضائے فکر پر چھایا ہوا غبار اتار\nریاض جاں میں مرے رب نئی بہار اتار\n\nاجال کعبۂ دل کے خلافِ کہنہ کو\nدیار سرورِ عالم میں ایک بار اتار\n\nنجات بخش مجھے غیر کے تعلق سے\nبہت ضعیف ہوں سر سے مرے یہ بار اتار\n\nجو تیرے حکم کو نافذ کرے زمانے میں\nفلک سے فرش پر اب تو وہ شہسوار اتار\n\nنکال میرے رگ و پے سے خواہشات کا میل\nانانیت کا مری آنکھ سے خمار اتار\n\nستیزہ کار ہے ہر موج میری کشتی سے\nحیات و موت کے مالک اسے بھی پار اتار\n\nنئے خیال کی شہزادؔ کو بشارت دے\nدل حزیں پہ کوئی حرف خوشگوار اتار"
  },
  {
    "id": 296,
    "title": "نعت شریف",
    "description": "سرور دیں کی گدائی واہ وا\nشہر طیبہ تک رسائی واہ وا\n\nاللہ اللہ خوش نصیبی کا عروج\nرات دن مدحت سرائی واہ وا\n\nسرور کونین کے اعزاز میں\nدست بستہ ہے خدائی واہ وا\n\nروشنی میں ڈھل گئی ہیں ظلمتیں\nاے ظہور مصطفائی! واہ وا\n\nاہل محشر دیکھ کر حیران ہیں\nہم غلاموں کی رہائی واہ وا\n\nلب پہ آنا تھا درود پاک کا\nہو گئی دل کی صفائی واہ وا\n\nپیر کامل کی خدایا خیر ہو\nمے ہمیں ایسی پلائی واہ وا\n\nترجمہ شہزادؔ اشکوں نے کیا\nنعت آنکھوں نے سنائی واہ وا"
  },
  {
    "id": 297,
    "title": "نعت شریف",
    "description": "نعت سرکار کہاں اور کہاں میں بیکار\nشعر گوئی ہے مری ان کے کرم کا اظہار\n\nزیب دیتی ہے جہاں بانی انہیں قوموں کو\nآپ جیسا ہو جن اقوام کا میر و سردار\n\nجب سے دیکھا ہے وہ خورشیدِ نبوّت میں نے\nتب سے رہتا ہے مرا بخت ہمیشہ بیدار\n\nکاش آ جائے میسر وہ شفا بخش فضا\nجس میں پاتے ہیں سکوں سارے جہاں کے بیمار\n\nآپ کے لطف و عطا ، جود و سخا نے توڑی\nنفرت و جبر جفا ، جور و ستم کی دیوار\n\nاور جچتا ہی نہیں کوئی قسم سے اس کو\nکوئی کر لیتا ہے جب آپ کے رخ کا دیدار\n\nچاند ہے آپ کا خادم تو ہے خورشید غلام\nآپ کے حکم پہ چلتے ہیں جبال و اشجار\n\nاب تو موصول حضوری کا ہو پیغام مجھے\nاب تو مل جائے مجھے کوئی بشارت سرکار\n\nاپنے شہزادؔ کے حالات پہ بھی ایک نظر\nفرش تا عرش کیا آپ کو حق نے مختار"
  },
  {
    "id": 298,
    "title": "نعت شریف",
    "description": "یوں تازگی روح کا سامان کریں گے\nہر سانس کو آقا کا ثنا خوان کریں گے\n\nجوڑیں گے مدینے کی ہوائوں سے تعلق\nافکار کے جنگل کو گلستان کریں گے\n\nکروا کے اسے گنبد خضریٰ کا نظارہ\nہم نفس منافق کو مسلمان کریں گے\n\nکیا کیا نہ عطا ہوگا فقیروں کو وہاں سے\nدربار میں جب مدحت سلطان کریں گے\n\nلٹکیں گی یونہی سر پہ ہمارے یہ صلیبیں\nجب تک نہ قبول آپ کا فرمان کریں گے\n\nپھوٹیں گی ہر اک شعر سے تاثیر کی کرنیں\nہم نعت کو جب تابع قرآن کریں گے\n\nمحشر میں پڑھے جائیں گے سرکار کی نعتیں\nیوں مرحلہ خلد کو آسان کریں گے\n\nہر ذہن کو ہم دیں گے مدینے کا تصوّر\nہر قلب کو ہم صاحب عرفان کریں گے\n\nجس ذات سے شہزادؔ ہے ہر چیز سلامت\nاس ذات پہ ہر چیز کو قربان کریں گے"
  },
  {
    "id": 299,
    "title": "نعت شریف",
    "description": "دیار باطن کے طاقچوں میں دیے ثناء کے جلائے رکھنا\nادب سے پلکوں پہ آنسوئوں کے حسین موتی سجائے رکھنا\n\nاگر نہ ان کے ادب کا دامن ہمارے دست نیاز میں ہو\nعبث ہے صوم و صلوٰۃ کے پھر پہاڑ سر پر اٹھائے رکھنا\n\nاگر نہ کشت یقیں پہ برسیں سحاب لطف نبی کی بوندیں\nتو بے اثر ہے ریاضتوں کی چتا میں خود کو بٹھائے رکھنا\n\nحروف نعت نبی کی قوت کا ایک ادنیٰ مظاہرہ ہے\nہمارا نوک قلم چبھو کر ضمیر شب کو جگائے رکھنا\n\nلگائو یادِ نبی کے پودے دل و نظر کی کیاریوں میں\nجو چاہتے ہو عقیدتوں کا چمن ہمیشہ کھلائے رکھنا\n\nعلاج امراض روح و جاں کا ہے ذکر صل علیٰ میں پنہاں\nجو چاہتے ہو سکوں کی دولت اسی میں دل کو لگائے رکھنا\n\nیہی ہے ایمان کا تقاضا ، اسی میں ذات خدا ہے راضی\nجبیں عجز و نیاز شہزادؔ ان کے در پر جھکائے رکھنا"
  },
  {
    "id": 300,
    "title": "نعت شریف",
    "description": "جو تیری یاد میں گزرے وہی لمحہ مؤثر ہے\nکہ اس لمحے کی خوشبو سے مشام جاں معطر ہے\n\nپرونا فکر کی تسبیح میں موتی درودوں کے\nیہی ہے حاصل ہستی یہی میرا مقدر ہے\n\nجناب سرورِ کونین کی چوکھٹ پہ وہ دیکھو!\nگزارش لے کے پلکوں پر کھڑا کوئی سخنور ہے\n\nکوئی سلطان پھر کیسے جچے اس کی نگاہوں میں\nدرِ سرکار کا سائل تو خود رشک سکندر ہے\n\nنظر سرکار کی سیرت کے ہر پہلو پہ ہو جس کی\nوہی مرشد وہی رہبر وہی حاکم مؤقر ہے\n\nپہنچتی ہے کمک ہر دم مجھے شہر مدینہ سے\nمرے آگے اسی خاطر مری ہستی مسخر ہے\n\nشہ کونین کے لطف و کرم پر ہے مدار اس کا\nحقیقت آشنا جس نور سے میرا تصور ہے\n\nخدا کے فضل سے تحریک ہے میرے لطائف میں\nنگاہِ مرشد کامل سے میرا دل منور ہے\n\nعجب فیضان ہے شہزادؔ نعت سرورِ دیں کا\nپریشانی کے اندر بھی مجھے تسکیں میسر ہے"
  },
  {
    "id": 301,
    "title": "نعت شریف",
    "description": "یہ ہے ایماں کہ ہیں بعد خدا خیرالبشر افضل\nخدا جانے مقام مصطفی ہے کس قدر افضل\n\nلگے سرکار کے قدموں سے جو ذرّے جواہر ہیں\nانہیں کے فیض نسبت سے ہوئے سنگ و شجر افضل\n\nفضیلت ہے معانی آشنا ان کی ادائوں سے\nہر اک پہلو ہے ان کی زندگی کا سربسر افضل\n\nہدایت بخش سب انداز ہیں شاہ مدینہ کے\nہے ان کا ہر عمل افضل ، سفر افضل ، حضر افضل\n\nنقوش پا انہیں کے خضر کا رستہ دکھاتے ہیں\nانہیں کا راستہ سیدھا ، انہیں کی رہگزر افضل\n\nخدا کا ذکر ہو جس میں ، نبی کی نعت ہو جس میں\nنہ کیوں وہ شام ہو پیاری ، نہ کیوں ہو وہ سحر افضل\n\nپرکھ لو بات یہ بے شک شریعت کی کسوٹی پر\nہے بیت اللہ سے میرے نبی کا مستقر افضل\n\nمرا آغاز اور انجام ہے شہزادؔ نعت ان کی\nہوا ہے کام اک مجھ سے یہی مقدور بھر افضل"
  },
  {
    "id": 302,
    "title": "نعت شریف",
    "description": "دل سے حمد خدا نکلتی ہے\nساتھ ان کی ثناء نکلتی ہے\n\nجا پہنچتی ہے گوش رحمت میں\nقلب سے جو صدا نکلتی ہے\n\nاوڑھ کر بردئہ درود و سلام\nمیرے منہ سے دعا نکلتی ہے\n\nصبح سحری کے وقت طیبہ سے\nلے کے خوشبو صبا نکلتی ہے\n\nجنتی ہیں وہ جن کے ہونٹوں سے\nمدحت مصطفی نکلتی ہے\n\nغم مٹانے کو سبز گنبد سے\nاک تجلی جدا نکلتی ہے\n\nموت شہزادؔ ان کے زائر سے\nاپنا دامن بچا نکلتی ہے"
  },
  {
    "id": 303,
    "title": "نعت شریف",
    "description": "سہارا دے دیا بروقت ان کی غمگساری نے\nمجھے تو مار ڈالا تھا مری عصیاں شعاری نے\n\nضرورت ہے مجھے سرکار پھر تسکین و راحت کی\nبنایا قریہ جاں میں ٹھکانہ بے قراری نے\n\nکبھی ممکن نہیں تھا نخوت و ظلم و تشدد سے\nکیا جو کام سلطان حرم کی انکساری نے\n\nمجھے اعزاز دے وہ کاش اپنی میزبانی کا\nشرف بخشا ابوایوب کو جس کی سواری نے\n\nصحابہ ہوں رسول اللہ کے یا اولیاء اللہ\nنوازے ہیں انہیں یہ مرتبے خدمت گزاری نے\n\nخدا کے نور کی کرنیں اسی کے صحن میں چمکیں\nاگرچہ راستہ روکا بہت بوجہل ناری نے\n\nاثر ہے سارے عالم میں ہوائے شہر طیبہ کا\nچمن کو رنگ بخشے ہیں اسی بادِ بہاری نے\n\nہجوم رنج ہو شہزادؔ یا مجمع مصائب کا\nمجھے تنہا نہیں چھوڑا کبھی محبوب باری نے"
  },
  {
    "id": 304,
    "title": "نعت شریف",
    "description": "مدحِ نبی کرے جو فرشتہ سرشت ہو\nکہتا ہے نعت جس کا عقیدہ درست ہو\n\nفضلِ خدا و لطفِ نبی سے ہے کیا بعید\nبزمِ رسول پاک ہو ، ہم ہوں بہشت ہو\n\nدرپیش ہے حضور کی مدحت کا مرحلہ\nکیسے سمندِ فکر کی رفتار سست ہو\n\nنسبت ہو جس کو سرور عالم کی فوج سے\nاس کو کسی محاذ پہ کیسے شکست ہو\n\nدل میں خدا کی یاد ہو ، لب پہ نبی کا نام\nمیری ہر اک نشست بس ایسی نشست ہو\n\nکامل ہے ان کے عشق میں شہزادؔ اس قدر\nجتنا تو اتباع شریعت میں چست ہو"
  },
  {
    "id": 305,
    "title": "نعت شریف",
    "description": "عشق احمد خدا سے ملتا ہے\nرب نبی کی رضا سے ملتا ہے\n\nعلم و حکمت ، کمال فکر و شعور\nسب در مصطفی سے ملتا ہے\n\nباخدا جب کبھی سوال کریں\nان کے دست عطا سے ملتا ہے\n\nمانگنے کا اگر سلیقہ ہو\nفیض ان کے گدا سے ملتا ہے\n\nزائرو ! یوں حضور سے ملنا\nجیسے بندہ خدا سے ملتا ہے\n\nکتنے خوش بخت ہیں وہ لوگ جنہیں\nلطف ان کی ثنا سے ملتا ہے\n\nراہ عرفاں کے ہر مسافر کو\nفیض اس رہنما سے ملتا ہے\n\nہم سے شہزادؔ سب فقیروں کو\nشاہِ جود و سخا سے ملتا ہے"
  },
  {
    "id": 306,
    "title": "نعت شریف",
    "description": "موج رحمت حضور کا گریہ\nنور والا ہے نور کا گریہ\n\nبن گیا رہنمائے اہل کمال\nتاجدار شعور کا گریہ\n\nکھول دے گا جناں کے دروازے\nشاہِ یوم النشور کا گریہ\n\nشانِ خیرالوریٰ کا مظہر ہے\nارنی گوئے طور کا گریہ\n\nعاشقان نبی کو حاصل ہے\nکس نشاط و سرور کا گریہ\n\nبہر دید حضور ہے شہزادؔ\nجن و انسان و حور کا گریہ"
  },
  {
    "id": 307,
    "title": "نعت شریف",
    "description": "نبی کی غلامی مرے کام آئی\nمدینے سے چٹھی مرے نام آئی\n\nدرخشاں ہمیشہ سے ہے مہرفاراں\nنہیں اس کے اوپر کبھی شام آئی\n\nنئی نعت مکتوب طیبہ کی صورت\nحضوری کا بن کر ہے پیغام آئی\n\nیہ اعجاز ہے ذکر صل علیٰ کا\nمصیبت بھی اکثر مرے کام آئی\n\nتعال اللہ! خورشید توحید نکلا\nخوشا! صبح ترحیل اصنام آئی\n\nہر اک نعت شہزادؔ تسکیں بداماں\nدلاسہ بنے وقت آلام آئی"
  },
  {
    "id": 308,
    "title": "نعت شریف",
    "description": "دیار باطن کی ہر گلی میں رہیں ثناء کے چراغ روشن\nشعور نعت نبی کی کرنوں سے ہو مرا بھی دماغ روشن\n\nانہیں کی نسبت سے جنگلوں پر صدا بہاریں ہیں گلستاں کی\nانہیں کی برکت سے ہو گئے ہیں دلوں کے ٹوٹے ایاغ روشن\n\nملی ہیں کتنی حسیں ادائیں خدا سے محبوب دو جہاں کو\nکہ جن ادائوں کی یاد سے ہیں دلوں میں الفت کے داغ روشن\n\nوسیلہ عالم میں آیتوں کے فروغ کا کس کی ذات ٹھہری\nکیے خدا نے لبوں پہ کس کے حروفِ ا لاّالبلاغ روشن\n\nنجات کس کے کرم سے پائی دل قلندر نے ماسوا سے\nکیے ہیں کس نے شب ہوا میں اطاعتوں کے چراغ روشن\n\nتجھے بھی شہزادؔ مل ہی جائے گا نور آقا کی بارگہ سے\nکہ ہے عقابوں کی ہم نشینی کے فیض سے قلب زاغ روشن"
  },
  {
    "id": 309,
    "title": "نعت شریف",
    "description": "وہ بشر جس کے تصور سے قوی ایمان ہو\nکون ہے ان کے سوا جو بولتا قرآن ہو\n\nشام ہستی میں جلیں حسن عقیدت کے چراغ\nروشنی صبح جاں میں نعت کا فیضان ہو\n\nپھر عطا ہو جائیں قلب و جاں کو وہ سرشاریاں\nپھر مرے آقا حضوری کا کوئی سامان ہو\n\nیہ زمیں کیا آسمانوں میں بھی ہوں جس کے وزیر\nغیرممکن ہے کہ اب ایسا کوئی سلطان ہو\n\nزیب تن ان کے نہ ہو کیوں کر امامت کی قبا\nجن کا ہر ارشاد پاک اللہ کا فرمان ہو\n\nمظہر ذات و صفات حق تعالیٰ ہیں حضور\nکیوں نہ ان کے حسن سے ظاہر خدا کی شان ہو\n\nذکر اوصاف نبی شہزادؔ اکثر کیجیے\nشاید اس طرح سے کچھ شکرانہ احسان ہو"
  },
  {
    "id": 310,
    "title": "نعت شریف",
    "description": "ہے اپنی جگہ خوب عبادات کی لذت\nلیکن ہے جدا تیری ملاقات کی لذت\n\nملتا ہے عجب لطف ترے شہر کی حد میں\nمسحور کیے دیتی ہے حالات کی لذت\n\nجس رات کہ حاصل تھا ترے رخ کا نظارہ\nبھولی نہیں اب تک مجھے اس رات کی لذت\n\nروشن تری تقلید سے اعمال کا چہرہ\nتسکین فشاں تیرے خیالات کی لذت\n\nہے اوج پہ اس شخص کی قسمت کا ستارہ\nحاصل ہو جسے خدمت سادات کی لذت\n\nہو جاتا ہے اک کیف مری روح پہ طاری\nیاد آتی ہے جب تیرے مقالات کی لذت\n\nٹوٹا ترے ارشاد سے تفریق کا جادو\nبخشی تری سیرت نے مساوات کی لذت\n\nفتویٰ یہ ملا حضرت مالک کے عمل سے\nقرباں تیری دہلیز پہ عرفات کی لذت\n\nپاتا ہی نہیں نعت سے شہزادؔ فراغت\nچکھ لیتا کبھی ورنہ مناجات کی لذت"
  },
  {
    "id": 311,
    "title": "نعت شریف",
    "description": "تکتا ہے سوئے گنبد خضریٰ بچشم نم\nزائر جو چھوڑتا ہے مدینہ بچشم نم\n\nہوتی ہیں اس کی ذات پہ رحمت کی بارشیں\nدیکھے جو ایک بار وہ روضہ بچشم نم\n\nمقبول بارگاہ کو ہوتا ہے بس نصیب\nیادشہِ ہدی میں تڑپنا بچشم نم\n\nاہل نظر کو ارض مدینہ ہے کیوں عزیز\nجا کر وہاں یہ بات سمجھنا بچشم نم\n\nپوچھو تم اس سے روضۂ سرکار کا مقام\nدیکھا ہے جس نے خلد کا نقشہ بچشم نم\n\nپہنچے دیار قدس میں جتنے تھے خوش نصیب\nپیچھے رہا حضور میں تنہا بچشم نم\n\nارض حرم میں کاش میں باطن کی آنکھ سے\nدیکھوں تجلیات کی دنیا بچشم نم\n\nآقا! مجھے دکھائیے راہِ مدافعت\nدیتا ہوں اپنی ذات کا پہرہ بچشم نم\n\nٹھہروں گا اس دیار میں شہزادؔ کس طرح\nمیں نے ہزار بار یہ سوچا بچشم نم"
  },
  {
    "id": 312,
    "title": "نعت شریف",
    "description": "مطلع صبح عرب پر ہے سجا مہر منیر\nدینے آیا ہے اندھیروں کو ضیا مہر منیر\n\nابتدائے آفرنیش کا محرک اس کا نور\nہے کمالاتِ بشر کی انتہا مہر منیر\n\nضوفشاں ہے کائنات حسن میں اس کا جمال\nزینت کون و مکاں ، نور خدا مہر منیر\n\nآج تک جس سے منور ہے ضمیر کائنات\nروشنی کا وہ مکمل سلسلہ مہر منیر\n\nقاسم فیضان باری ، پیکر لطف و کرم\nرحمت حق ، منبع صدق و صفا مہر منیر\n\nبحر اسرار و معارف ، صاحب خلق عظیم\nکنز عرفاں ، مخزن جود و سخا مہر منیر\n\nروح عیسیٰ ، جان موسیٰ ، قرۃ العین خلیل\nفخر آدم ، مقتدائے انبیاء مہر منیر\n\nتیری کرنوں سے مزین جس کا طول و عرض ہو\nدے مجھے خیرات میں ایسی قبا مہر منیر\n\nتیری سیرت سے ملا ہے میری ہستی کو جواز\nکیسے ہوگا مجھ سے تیرا حق ادا مہر منیر\n\nروز محشر دوں گا میں شہزادؔ یوں ان کو صدا\nالمدد! اے شافع روز جزا مہر منیر"
  },
  {
    "id": 313,
    "title": "نعت شریف",
    "description": "ملے گی قلب کو تسکین زیر گنبد خضریٰ\nبہ فیض طہٰ و یٰسین زیر گنبد خضریٰ\n\nجہاں رنگ و بو محتاج ہے جس کے تصرّف کا\nہے ایسا صاحب تکوین زیر گنبد خضریٰ\n\nٹھکانہ آئو پہلے سے بنا لیں ہم وہاں اپنا\nسمٹ جائے گا آخر دین زیر گنبد خضریٰ\n\nکھڑا ہو کر کروں نذر نبی تحفہ تحیّت کا\nپڑھوں پھر بیٹھ کر یٰسین زیر گنبد خضریٰ\n\nمرے قلب و نظر میں نور کے فانوس ہوں روشن\nہو میری روح کی تزئین زیر گنبد خضریٰ\n\nعجب کیا ہے مدینے کی فضا مجھ کو میسر ہو\nلکھوں اس نعت کی تضمین زیرگنبد خضریٰ\n\nمقام اس سبز گنبد کا کوئی افلاک سے پوچھے\nخدا کے لاڈلے ہیں تین زیر گنبد خضریٰ\n\nاگر توفیق مل جائے مواجہ میں حضوری کی\nبجائوں ہچکیوں کی بین زیر گنبد خضریٰ\n\nمجھے خیرات دیں سرکار اسرار و معارف کی\nکریں ارشاد اور تلقین زیر گنبد خضریٰ\n\nسمندر رحمتوں کے جوش میں آ جایا کرتے ہیں\nصدا دے جب کوئی مسکین زیر گنبد خضریٰ\n\nدرود پاک ہو شہزادؔ ہو روضے کی جالی ہو\nدعا ہے سب کہو آمین زیرگنبد خضریٰ"
  },
  {
    "id": 314,
    "title": "نعت شریف",
    "description": "ہے وادیٔ بطحا کی فضا اور طرح کی\nچلتی ہے مدینہ میں ہوا اور طرح کی\n\nہر بات کہی جاتی ہے اشکوں کی زباں میں\nہوتی ہے مواجہ میں دعا اور طرح کی\n\nاے سائلو! یہ رحمت کونین کا در ہے\nہوتی ہے یہاں بھیک عطا اور طرح کی\n\nاے کاش ہو ایسی مرے افکار میں جدّت\nہر روز کروں مدح و ثناء اور طرح کی\n\nطاری ہے دل و جاں پہ عجب بسط کا عالم\nلائی ہے خبر بادِ صبا اور طرح کی\n\nجس شان سے چاہیں جسے سرکار نوازیں\nہر کعب کی خاطر ہے ردا اور طرح کی\n\nدیتا ہے سبق اشھد و اسھد کا تفاوت\nہوتی ہے مقرب کی خطا اور طرح کی\n\nنازک ہے مزاج اس کا بہت نظم و غزل سے\nہے نعت نبی صنف ذرا اور طرح کی\n\nشہزادؔ کو ہو جائے عطا رنگ اویسی\nعشاّق میں ہو میری وفا اور طرح کی"
  },
  {
    "id": 315,
    "title": "نعت شریف",
    "description": "کون کہتا ہے خدائی چاہے\nبس محمد کی گدائی چاہے\n\nسازو ساماں پاس ہے لیکن حضور!\nقافلے کو رہنمائی چاہیے\n\nاب تو کرتا ہے تقاضا نفس بھی\nقید خواہش سے رہائی چاہیے\n\nان کی عظمت کو سمجھنے کے لیے\nعزّ و شان کبریائی چاہیے\n\nآرزو ہے دیدئہ بے تاب کی\nپھر وہی جلوہ نمائی چاہیے\n\nقصر والوں سے غرض ہم کو نہیں\nشہر طیبہ تک رسائی چاہیے\n\nاے سراپا نور! اے ظلمت شکن\nقریہ جاں کو صفائی چاہیے\n\nکام جو شہزادؔ آئے حشر میں\nاب کوئی ایسی کمائی چاہیے"
  },
  {
    "id": 316,
    "title": "نعت شریف",
    "description": "سیرت و صورت مصطفی روشنی\nمیرے آقا کی ہے ہر ادا روشنی\n\nان کے الفاظ سورج سے رخشندہ تر\nگفتگو ، حرف ، لہجہ ، صدا روشنی\n\nظلمت دہر میں ہے ستارہ فشاں\nسرور دیں کی مدح و ثنا روشنی\n\nاک سمندر ہے کعبہ بھی انوار کا\nسبز گنبد کی ہے پر جدا روشنی\n\nچھٹ گئیں مطلع دہر سے ظلمتیں\nلے کے آئے رسول خدا روشنی\n\nدیکھ کر دنگ ہے عرش کی آنکھ بھی\nاوڑھ آئی کچھ ایسی قبا روشنی\n\nفیضیاب درشاہ لولاک ہیں\nچاند ، سورج ، ستارے ، صبا ، روشنی\n\nبارگاہ رسالت سے شہزادؔ کو\nہو رہی ہے مسلسل عطا روشنی"
  },
  {
    "id": 317,
    "title": "نعت شریف",
    "description": "پہنچا مرا درود جو ان کی جناب میں\nمجھ کو سلام عرش سے آیا جواب میں\n\nجب تک نہ ہو شریعت خیرالوریٰ کا فیض\nممکن نہیں تمیز گناہ و ثواب میں\n\nاب تو کوئی سبیل حضوری کی ہو حضور\nکب تک رہے گی جان مسلسل عذاب میں\n\nاشکوں نے کی بلال کے لہجے میں گفتگو\nصد شکر کامیاب رہا میں خطاب میں\n\nان کے سوا جہان میں ایسا نہیں کوئی\nجس نے کیا ہو قید سمندر حباب میں\n\nکیسے ثنائے سرور عالم کو چھوڑ دیں\nلازم یہ شق ہے عشق رسالت کے باب میں\n\nوالشمس ، والقمر کہیں وَالیل و والضحیٰ\nنعتیں لکھی ہوئی ہیں خدا کی کتاب میں\n\nاک بار اور کیجیے شہزادؔ پر کرم\nاک بار اور آئیے سرکار خواب میں"
  },
  {
    "id": 318,
    "title": "نعت شریف",
    "description": "بہار ہی پر نہیں ہے موقوف نعت خیرالوریٰ کا موسم\nہر اک مہینہ ہے ماہ مدحت ، ہر ایک موسم ثنا کا موسم\n\nرئوف ہیں وہ رحیم ہیں وہ حبیب رب کریم ہیں وہ\nوہ جب ہوں مائل بہ لطف سمجھو یہی ہے فضل خدا کا موسم\n\nوہ جن کے نقش قدم پہ چل کر ضمیر انسان مطمئن ہے\nرواں ہے کون و مکاں میں ان کے عمل سے رشد و ہدیٰ کا موسم\n\nملے اجازت تو میں بھی دیکھوں وہ سبز گنبد وہ نوری جالی\nعطا ہو فصل وصال آقا! ہو ختم آہ و بکا کا موسم\n\nانہیں کی دریوزہ گر ہیں صدیاں انہیں کے ادنیٰ گدا زمانے\nازل سے تابہ ابد ہے میرے نبی کے جود و سخا کا موسم\n\nابوالبشر تھے نہ ابن مریم مگر وہ جلوہ نما تھے پیہم\nرہا ہے گلزار کن فکاں میں انہیں کے عزّو علا کا موسم\n\nتو پھر ہے شہزادؔ کیسا خطرہ ریاض اعمال کو خزاں کا\nفضائے محشر میں جبکہ ہوگا شفاعت مصطفی کا موسم"
  },
  {
    "id": 319,
    "title": "نعت شریف",
    "description": "پائوں جو دل میں خواہش جاہ و حشم کو میں\nکرتا ہوں یاد آپ کے سنگ شکم کو میں\n\nرہتا ہے اس کی نوک پر اسم رسول پاک\nدیتا ہوں اس خیال سے بوسہ قلم کو میں\n\nپڑھتے ہوئے درود خدا کے حبیب پر\nجائوں گا اطمینان سے ملک عدم کو میں\n\nآتا ہے رشک سائل طیبہ کے بخت پر\nتکتا ہوں جب حضور کے جود و کرم کو میں\n\nاب تو مجھے نصیب ہو طرز عرب حضور!\nبیٹھا ہوں کب سے چھوڑ کر رسم عجم کو میں\n\nڈھل کر نیاز و عجز کے سانچے میں سرتاپا\nچوموں گا جا کے ایک دن ارض حرم کو میں\n\nکرتا ہوں اپنا قبلہ فکر و نظر درست\nمرکز بنا کر آپ کے نقش قدم کو میں"
  },
  {
    "id": 320,
    "title": "نعت شریف",
    "description": "ثانی مصطفی ہوا نہ کوئی\nآپ جیسا کہیں سنا نہ کوئی\n\nآپ آتے اگر نہ عالم میں\nحق سے ہوتا ہی آشنا نہ کوئی\n\nآپ کے بعد اے سراپا جمال\nخلق میں آپ سا ملا نہ کوئی\n\nاس نے کی آپ کے حقوق کی بات\nکر سکا جس کا حق ادا نہ کوئی\n\nپڑھ لیا جھوم کر درود و سلام\nاور مجھ سے ہوئی دعا نہ کوئی\n\nرہبری ان پہ ختم ہے شہزادؔ\nہو گا اب ان سا رہنما نہ کوئی"
  },
  {
    "id": 321,
    "title": "نعت شریف",
    "description": "کر رہا ہوں بیاں حضور کی شان\nالمدد! روح حضرت حسان\n\nآپ ہیں حسن انتخاب بصیر\nآپ جیسا نہیں کوئی انسان\n\nدل سے بے ساختہ نکلتا ہے\nمیرے آقا میں آپ پر قربان\n\nجو ملے ریگزار طیبہ میں\nہیں وہ ذرات نیلم و مرجان\n\nآپ کی پیروی کا نام ہے دیں\nآپ کی ذات سے وفا ایمان\n\nیا نبیe آپ کے سوا نہ جچا\nمسند دہر پر کوئی سلطان\n\nآپ کے لطف پر نظر تھی مری\nچل پڑا گھر سے بے سروسامان\n\nان کی تائید جبرئیل کریں\nمیریل تائید حضرت حسان\n\nاس میں شہزادؔ بس گیا ہے درُود\nقریہ جاں ہو کس طرح ویران"
  },
  {
    "id": 322,
    "title": "نعت شریف",
    "description": "حزن و آلام کو یوں دل سے مٹایا جائے\nذکر سرکار سنا اور سنایا جائے\n\nکرکے فانوس دل و جاں میں ثنا کے روشن\nبزم افکار و تخیل کو سجایا جائے\n\nسنت سرور کونین سے یہ درس ملا\nپہلا پھل آئے تو بچوں کو کھلایا جائے\n\nشافع حشر کو ہو گا یہ گوارا کیسے\nان کی امت کو جہنم میں جلایا جائے\n\nروح اس آس پہ قالب میں لیے پھرتا ہوں\nکاش مجھ کو بھی مدینے میں بلایا جائے\n\nذکر ہو صلِّ علیٰ صلِّ علیٰ کا جاری\nجس گھڑی میرے جنازے کو اٹھایا جائے\n\nآئیں آقا تو ادب سے میں کھڑا ہو پائوں\nاتنا اونچا مری تربت کو بنایا جائے\n\nعشق سرکار سکھانے کے لیے لازم ہے\nنفس کو لذّت بے جا سے بچایا جائے\n\nآئے آواز وہ جاتا ہے ثنا خوان رسول\nجب جہاں سے تیرا شہزادؔ خدایا جائے"
  },
  {
    "id": 323,
    "title": "نعت شریف",
    "description": "حصار حرص و ہوا سے نکل دلِ ناداں\nدیار سرور دوراں کو چل دلِ ناداں\n\nنیاز و عجز سے ملتا ہے اس ہنر میں کمال\nیہ راہ مدح نبی ہے سنبھل دلِ ناداں\n\nفغاں کو ڈھال کر اشکوں کے آبگینوں میں\nبنا دے کام زباں کا سہل دلِ ناداں\n\nخبر ہو گلشن طیبہ کی عندلیبوں کو\nریاض جاں میں کچھ ایسے مچل دلِ ناداں\n\nدرود و نعت ہی لے جا دَرِ حضور پہ ساتھ\nخراب و خام ہے فرد عمل دلِ ناداں\n\nتری نشست بھی ہوگی نبی کے حلقے میں\nذرا تو اپنی روش تو بدل دلِ ناداں\n\nمرا نصیب کہ ہے سامنے ریاض رسول\nہے آج ناظر حسن ازل ، دلِ ناداں\n\nاگر نصیب ہے شہزادؔ کا سا درد تجھے\nتو مانگ شہر نبی میں اجل دلِ ناداں"
  },
  {
    "id": 324,
    "title": "نعت شریف",
    "description": "چوکھٹ نبی کی چھوڑ کر جاتا کہاں کہاں\nان کا فقیر ٹھوکریں کھاتا کہاں کہاں\n\nجیسے بیاں حضور کی خدمت میں کر دیا\nایسے میں دل کا حال سناتا کہاں کہاں\n\nسلطان ملک فقر کی بیعت کیے بغیر\nحرص و ہوا کے ناز اٹھاتا کہاں کہاں\n\nہوتی اگر نہ آپ کی چوکھٹ اسے نصیب\nآنسو گناہگار بہاتا کہاں کہاں\n\nاچھا ہوا دیار سخاوت میں پڑ رہا\nپھر کر صدا فقیر لگاتا کہاں کہاں\n\nہوتا احد کی جنگ میں شہزادؔ گر شریک\nخود کو نہ ان کی ڈھال بناتا کہاں کہاں"
  },
  {
    "id": 325,
    "title": "نعت شریف",
    "description": "کہتا ہے جس کو آپ خدائے جہاں عظیم\nایسی ہے ذات سرورِ کون و مکاں عظیم\n\nہوتی اگر نہ عظمت خیرالبشر کی بات\nکوئی ذرا بتائیے ہوتا یہاں عظیم؟\n\nذات نبی ہے صورت و سیرت میں بے مثال\nان کی زباں کمال ہے ان کا بیاں عظیم\n\nاپنی مثال آپ ہے طیبہ کا سبزہ زار\nاپنی جگہ ہے جلوئہ باغ جناں عظیم\n\nشہزادؔ سوز قلب کا مظہر ہے چشم نم\nیونہی نہیں ہے نعمت اشک رواں عظیم"
  },
  {
    "id": 326,
    "title": "نعت شریف",
    "description": "کتنا کرم ہے مجھ پہ یہ ربِّ ودُود کا\nچشمہ رواں ہے وادیٔ جاں میں درود کا\n\nخیرالوریٰ نے اپنے نقوش قدم کے ساتھ\nنقشہ بنا دیا ہے ہماری حدُود کا\n\nمیرے نبی کے چہرئہ روشن کو دیکھ کر\nقائل ہوا جہان خدا کے وجود کا\n\nجب تک نہیں تھا آپ کی مدحت کا اہتمام\nطاری تھا قلب و روح پہ عالم جمود کا\n\nبیٹھا ہوا ہوں رحمت عالم کی اوٹ میں\nپیش نظر ہے واقعہ عاد و ثمود کا\n\nسیرت کی پیروی ہے سب امراض کا علاج\nبغض و حسد کا ہو وہ مرض یا نمود کا\n\nامت کے نام صاحب امت کا ہے پیام\nہرگز نہ اعتبار تم کرنا یہود کا\n\nان سے ہوا فروغ اطاعت جہان میں\nسیکھا ہے ان سے سب نے سلیقہ سجود کا\n\nشہزادؔ نقش پائے نبی پر چلے چلو!\nچاہو جو انکشاف وجود و شہود کا"
  },
  {
    "id": 327,
    "title": "نعت شریف",
    "description": "کھلا ہے باب آگہی انہیں کے التفات سے\nچھلک رہی ہیں حکمتیں انہیں کی بات بات سے\n\nعصائے عشق جب دیا انہوں نے دست عقل میں\nصدائے ’’الاحد‘‘ اٹھی ضمیر کائنات سے\n\nیہ نقش پائے مصطفی کی پیروی کا فیض ہے\nرہِ بقا ملی ہمیں جہانِ بے ثبات سے\n\nفضائے دہر گرد کذب سے کثیف جب ہوئی\nفروغ صدق کو ملا انہیں کی پاک ذات سے\n\nسکون بخش کیوں نہ ہوں فضائیں اس دیار کی\nسلام جس جگہ پہنچ رہے ہوں شش جہات سے\n\nجو دل جمال مصطفی کے عشق سے تہی رہا\nوہ بہرہ ور نہ ہو سکے گا لذت حیات سے\n\nوہی حبیب حق بھی ہے وہی قریب حق بھی ہے\nجسے ہو کوئی وصف عطا حضور کی صفات سے\n\nثنا کی مشعلیں جلا کے اپنے قلب و روح میں\nکشید کر رہا ہوں نور میں شب حیات سے"
  },
  {
    "id": 328,
    "title": "نعت شریف",
    "description": "آپ ہیں تاجدار ملک درود ، آپ کے واسطے سے صلوٰۃ و ثنا\nآپ ہی کے لیے وجود و شہود آپ کے واسطے صلوٰۃ و ثنا\n\nعرش والے بھی بھیجتے ہیں مدام آپ کی ذات پر درود و سلام\nآپ ممدوح عابد و معبود آپ کے واسطے صلوٰۃ و ثنا\n\nرحمتوں کا ظہور آپ سے ہے ، قلب و جاں کا سرور آپ سے ہے\nرونق افزائے مسند محمود آپ کے واسطے صلوٰۃ و ثنا\n\nمظہر والضحیٰ رخ انور ، ہر سخن حکمتوں کا ہے مصدر\nآپ سے ہے جمال حق کی نمود آپ کے واسطے صلوٰۃ و ثنا\n\nاہل احوال کا عروج و نزول ، اہل اقوال کا وصول و قبول\nآپ ہی کے طفیل ہے موجود ، آپ کے واسطے صلوٰۃ و ثنا\n\nدعویٰ لا اِلٰہ کی آپ دلیل ، آپ ہیں مقتدائے نوح و خلیل\nآپ ہیں شارح حدود و قیود ، آپ کے واسطے صلوٰۃ و ثنا\n\nآپ کی ذات بندگی کا جواز ، آپ کی پیروی کا نام نماز\nآپ ہیں باعث قیام و قعود ، آپ کے واسطے صلوٰۃ و ثنا\n\nآپ نے الفتوں کو عام کیا آپ نے جابروں کو رام کیا\nآپ سے ظلم کی حدیں مسدود ، آپ کے واسطے صلوٰۃ و ثنا\n\nکر چکا ہے یہ تجربہ شہزادؔ ، دافع رنج و غم ہے آپ کی یاد\nآپ کے ذکر سے ہے غم مفقود ، آپ کے واسطے صلوٰۃ و ثنا"
  },
  {
    "id": 329,
    "title": "نعت شریف",
    "description": "شہر نبی کا ہر اک گوشہ حسن سراپا خلد بداماں\nارضِ حرم کا قریہ قریہ حسن سراپا خلد بداماں\n\nجالب و جاذب اک اک منظر نور میں ڈوبے کنکر پتھر\nاز بطحا تا کوئے مدینہ حسن سراپا خلد بداماں\n\nچہرئہ صحرا روشن روشن موجہ خوشبو گلشن گلشن\nروضہ انور وادیٔ طیبہ حسن سراپا خلد بداماں\n\nان کے قدم کی برکت سے ہے ان کی نگاہ رحمت سے ہے\nملک عرب کا ہر اک رستہ حسن سراپا خلد بداماں\n\nفیض نبوّت جود رسالت ، مخزن عرفاں کان مرّوت\nلطف و کرم کا بہتا دریا حسن سراپا خلد بداماں\n\nہر ساعت ہے لطف سخی سے ہر دم فیض نعت نبی سے\nکشت تخیل ارض تمنا حسن سراپا خلد بداماں\n\nممکن ہے یہ ان کے کرم سے نور ہو جاری نوک قلم سے\nہو جائے شہزادؔ کی دنیا حسن سراپا خلد بداماں"
  },
  {
    "id": 330,
    "title": "نعت شریف",
    "description": "نبی کا ذکر دلوں کو نکھار دیتا ہے\nیہ ورد بگڑے ہوئوں کو سنوار دیتا ہے\n\nخیال سرور کونین اتر کے روحوں میں\nتغیرات کو درس قرار دیتا ہے\n\nدرود بیٹھ کر پڑھتا ہوں جب میں خلوت میں\nکوئی مجھے مرے اندر اتار دیتا ہے\n\nمیں جانتا ہوں یہ سرکار کا تصرّف ہے\nجو مشکلات سے مجھ کو گزار دیتا ہے\n\nمرے حضور کا شہزادؔ ہے یہ لطف و کرم\nجو دشت جاں کو پیام بہار دیتا ہے\n\nخدائے پاک غلامانِ سرور دیں کو\nزمیں سے تابہ فلک اقتدار دیتا ہے\n\nجو دل سے کرتے ہیں فرمان مصطفی e تسلیم\nخدا انہی کو جہاں میں وقار دیتا ہے\n\nہے جس کے سر پہ شفاعت کا تاج روز جزا\nصدا اس کو ہر عصیاں شعار دیتا ہے"
  },
  {
    "id": 331,
    "title": "نعت شریف",
    "description": "ہجوم دیکھ کے افلاک پر ستاروں کا\nخیال آتا ہے طیبہ کی رہگزاروں کا\n\nرہے گا یونہی تصرف ازل سے تابہ ابد\nنظام شمس و قمر میں ترے اشاروں کا\n\nشکوہ قیصر و کسریٰ نے ہاتھ باندھ لیے\nکمال دیکھ کے طیبہ کے ریگزاروں کا\n\nمنیٰ و کعبہ و میقات بھی حسیں ہیں مگر\nبدل نہیں ہے ترے شہر کے نظاروں کا\n\nشرف عطا ہو زیارت کا پھر حضور مجھے\nخرام میرے چمن میں بھی ہو بہاروں کا\n\nیہی دیار پیمبر کی پاک گلیاں ہیں\nگداگری جہاں شیوہ ہے تاجداروں کا\n\nازل سے ایک ہیں صدیق ، عمر ، علی ، عثمان\nکچھ اختلاف قسم سے نہیں ہے چاروں کا\n\nگروہ خلق میں شہزادؔ مرسلین کے بعد\nکوئی مثیل نہیں ہے نبی کے یاروں کا"
  },
  {
    "id": 332,
    "title": "نعت شریف",
    "description": "سید انس و جاں کا دروازہ\nہے ریاض جناں کا دروازہ\n\nقاسم گنج ہائے قدرت ہے\nرحمت دو جہاں کا دروازہ\n\nپاس جب تک نہ تھی کلید ثنا\nتھا مقفّل گماں کا دروازہ\n\nذات واحد کی سمت کھلتا ہے\nمصطفی کے مکاں کا دروازہ\n\nہر گھڑی مرجع خلائق ہے\nپادشاہ شہاں کا دروازہ\n\nبے کسوں کے لیے ہے جائے اماں\nمحسن امتاّں کا دروازہ\n\nرہ دکھاتا ہے پیشوائوں کو\nرہبر مرسلاں کا دروازہ\n\nکھل رہا ہے در حضور کی سمت\nسرور قدسیاں کا دروازہ\n\nہے بہت ہی قریب طیبہ سے\nساتویں آسماں کا دروازہ\n\nجونہی حرف ثنا نے دستک دی\nکھل گیا شہر جاں کا دروازہ\n\nباب رحمت ہے باخدا شہزادؔ\nاس شہ ہر زماں کا دروازہ"
  },
  {
    "id": 333,
    "title": "نعت شریف",
    "description": "رات دن مدحت مصطفی اور میں\nروشنی کا ہے اک سلسلہ اور میں\n\nعبد و معبود کا فرق اپنی جگہ\nان کے واصف ہیں دونوں خدا اور میں\n\nان کی باتوں میں رہتے ہیں باہم مگن\nصبح صادق کی ٹھنڈی ہوا اور میں\n\nکاش اک ساتھ پہنچیں در پاک پر\nمیرے آنسو ، حروف دعا اور میں\n\nپانی پانی ہوا ہوں میں یہ سوچ کر\nتاجدار جہاں کا گدا اور میں\n\nشہر طیبہ میں پہنچیں گے امید ہے\nہاتھ میں ہاتھ ڈالے صبا اور میں\n\nکعب و حسّاں پڑھیں نعت جب خلد میں\nساتھ ہوں ان کے احمد رضا اور میں\n\nایک جانب ہو شہزادؔ خلد نظر\nایک جانب صلوٰۃ و ثنا اور میں"
  },
  {
    "id": 334,
    "title": "نعت شریف",
    "description": "حق ثنا کا اگر کچھ ادا ہو گیا\nتم خدا کے تمہارا خدا ہو گیا\n\nجو گدائے درِ مصطفی ہو گیا\nوہ غم دو جہاں سے رہا ہو گیا\n\nیاد آئے نبی کی جسے دیکھ کر\nوہ سمجھ لو سراپا ثنا ہو گیا\n\nنعت دراصل اُس روز ہو گی کوئی\nقلب جس روز جامی نما ہو گیا\n\nجس کے ہاتھوں میں دامن ہے سرکار کا\nاہل عالم کا وہ مقتدا ہو گیا\n\nنعت گوئی کی صورت میں دیکھو ذرا\nمجھ کو کیسا خزینہ عطا ہو گیا\n\nجب سے ذرّے مدینہ کے ہیں آنکھ میں\nچاند تاروں سے میں ماورا ہو گیا\n\nرہنمائی کر اے خضر کے راہبر\nکارواں سے مسافر جدا ہو گیا\n\nاس کی عظمت پہ شہزادؔ قربان میں\nجان و دل سے جو ان پر فدا ہو گیا"
  },
  {
    "id": 335,
    "title": "نعت شریف",
    "description": "میں رہا منہمک عمر بھر نعت میں\nتب دکھائی دیا کچھ اثر نعت میں\n\nکیف مدحت جو پایا تو خواہش ہوئی\nکاش ہو عمر ساری بسر نعت میں\n\nروضۂ مصطفی سے جو ہے متصل\nایک ایسی بھی ہے رہگزر نعت میں\n\nجانے کیا کیا مناظر دکھائی دیئے\nمحو جس دم ہوئی چشم تر نعت میں\n\nنعت کرتی ہے دل کو سکوں آشنا\nہے درخشندہ نورِ نظر نعت میں\n\nپھوٹتی ہے کرن ایک اک حرف سے\nضوفشاں یوں ہیں شمس و قمر نعت میں\n\nگلشن جاں میں پھوٹے شگوفے کئی\nیوں چھڑا ذکر خیرالبشر نعت میں\n\nجب اترتے ہیں شہزادؔ مضموں نئے\nمحو رہتا ہوں شام و سحر نعت میں"
  },
  {
    "id": 336,
    "title": "نعت شریف",
    "description": "در پہ سائل نے دی ہے صدا یا نبی\nہو اسے حرف مدحت عطا یا نبی\n\nدست بستہ کھڑا ہے گدا یا نبی\nچاہتاہے شعورِ ثنا یا نبی\n\nجب زباں ترجمانی سے قاصر رہی\nمیں نے پلکوں پہ رکھ لی دُعا یا نبی\n\nچاہتے ہیں دو عالم خدا کو مگر\nآپ کو چاہتا ہے خدا یا نبی\n\nغیرممکن ہے اس پر ہو راضی خدا\nآپ ہوں جس بشر سے خفا یا نبی\n\nآپ کی ہے ہر اک بات وحی خدا\nآپ فرمائیں جو ہے بجا یا نبی\n\nبھیک وہ چاہتا ہے یہ دریوزہ گر\nجو ہو شایانِ شان سخا یا نبی\n\nجس میں ہو ذکر صلِّ علیٰ کی چمک\nحرف وہ ہے فرشتہ نما یا نبی\n\nقلب شہزادؔ کا زخم در زخم ہے\nچاہیے اس کو خاک شفا یا نبی"
  },
  {
    "id": 337,
    "title": "نعت شریف",
    "description": "جادئہ مدحت سرکار پہ چلنا چاہے\nایک جذبہ ہے جو الفاظ میں ڈھلنا چاہے\n\nروح حسّان میں تجھ سے ہوں مدد کا طالب\nمیرا انداز ثنا روپ بدلنا چاہیے\n\nہادیٔ دہر کے دامن سے رہے وابستہ\nعین طوفان میں جو شخص سنبھلنا چاہے\n\nقاسم خیر سے ہر آن تعلق رکھے\nنرغہ شر سے اگر کوئی نکلنا چاہے\n\nیاد آتی ہیں اسے جب وہ معطرّ گلیاں\nراہ طیبہ میں مرا قلب مچلنا چاہے\n\nبھیج دیتے ہیں کمک شاہِ مدینہ فوراً\nجب مجھے یورش آلام کچلنا چاہے\n\nباغباں سے کوئی نسبت نہیں شہزادؔ اسے\nتوڑ کر شاخ سے جو پھول مسلنا چاہے"
  },
  {
    "id": 338,
    "title": "نعت شریف",
    "description": "اپنے جذبات کو لفظوں میں بدلنا سیکھو\nجادئہ نعت پہ حسان سے چلنا سیکھو\n\nہو اگر اذن طلب ذوقِ بلالی مانگو\nآتش عشق میں اس طرز سے جلنا سیکھو\n\nروضہ شہ پہ کرو ریش سے جاروب کشی\nپیکر عجز میں سلمان سے ڈھلنا سیکھو\n\nطرز رفتار میں گر کوئی تغیرّ آ جائے\nرومیؔ و جامیؔ و سعدیؔ سے سنبھلنا سیکھو\n\nظلمت شب کو اجالوں میں بدلنے کے لیے\nشمع بزم ہدایت سے پگھلنا سیکھو\n\nسُنّت سرورِ دوراں سے تمسّک کرکے\nفتنۂ دہر کے نرغے سے نکلنا سیکھو\n\nجائو شہزادؔ مدینہ میں سوالی بن کر\nشہر الفت کی ہوائوں سے مچلنا سیکھو"
  },
  {
    "id": 339,
    "title": "نعت شریف",
    "description": "کام دیتے ہیں غریبوں کو حوالے تیرے\nکون سا منہ ہے نہیں جس میں نوالے تیرے\n\nرُوح اور جسم کے مابین تھے اس دم آدم\nبزم لولاک میں جس دم تھے اجالے تیرے\n\nتو جہاں چاہے اشارے سے بلائے ان کو\nچاند ، سورج کو کیا حق نے حوالے تیرے\n\nساتھ رہتی ہے تری یاد ہمیشہ میرے\nکام آتے ہیں مصیبت میں سنبھالے تیرے\n\nزندگی ان کے خمیروں میں رچی ہوتی ہے\nموت بھی آئے تو مرتے نہیں پالے تیرے\n\nمجھ گنہگار کی امید ہے بخشش ہو گی\nمیں نے جب حشر کے دن واسطے ڈالے تیرے\n\nان کی آنکھوں میں چھلکتی ہے ترے رخ کی ضیا\nحسن کو ناز ہے جن پر وہ ہیں کالے تیرے\n\nپیروی کرتا ہے جو تیرے نقوش پا کی\nیاد آتے ہیں اسے پائوں کے چھالے تیرے\n\nکعبؔ و حسانؔ کی قسمت پہ ہو شہزادؔ نثار\nجن کے شانوں پہ سجے پاک دوشالے تیرے"
  },
  {
    "id": 340,
    "title": "نعت شریف",
    "description": "ظلمت جاں کو اجالوں کا امیں کر ڈالا\nقلب کو ان کی تجلی نے حسیں کر ڈالا\n\nچشم سرکار جو صحرائوں کی جانب اُٹھی\nذرّہ ریگ کو تابندہ نگیں کر ڈالا\n\nمجھ تہی دست کو مدحت کا قرینہ دے کر\nدشت افکار کو پھولوں کی زمیں کر ڈالا\n\nنوچنے والوں کو ایثار کی عادت ڈالی\nخوگر جبر کو فرخندہ جبیں کر ڈالا\n\nآپ کا سیرت و کردار تھا آقا جس نے\nخوگر وہم کو سر تاپا یقیں کر ڈالا\n\nہادیٔ خلق نے کی راہنمائی ایسے\nماندئہ راہ کو منزل کے قریں کر ڈالا\n\nآپ نے پائے مبارک جو زمیں پر رکھا\nفرش کو ہمقدم عرش بریں کر ڈالا\n\nشافع حشر کی شہزادؔ عنایت دیکھو\nمجھ گنہگار کو جنت کا مکیں کر ڈالا"
  },
  {
    "id": 341,
    "title": "نعت شریف",
    "description": "تجلیات کو دل میں سمو کے آتا ہے\nجو شخص شہر مدینہ سے ہو کے آتا ہے\n\nعجب سرور سا ہوتا ہے اس کے چہرے پر\nجو بارگاہِ رسالت میں رو کے آتا ہے\n\nاسی پہ راز محبت کے فاش ہوتے ہیں\nجو آب اشک سے آنکھوں کو دھو کے آتا ہے\n\nسکون قلب کی نعمت اسی کو ملتی ہے\nجو اس دیار میں پلکیں بھگو کے آتا ہے\n\nثنا کے واسطے جب میں قلم اٹھاتا ہوں\nمرا خیال مدینے سے ہو کے آتا ہے\n\nوہ جس کے زیر تصرف ہیں عالمین تمام\nاسے قرار چٹائی پہ سو کے آتا ہے\n\nبیاں وہ شعر میں شہزادؔ ہو نہیں سکتا\nجو کیف یاد مدینہ میں کھو کے آتا ہے"
  },
  {
    "id": 342,
    "title": "نعت شریف",
    "description": "کون و مکاں پہ آپ کا جود و کرم محیط\nجیسے وجود حرف پہ نوک قلم محیط\n\nاس کی تجلیاّت سے عالم ہے مستنیر\nشمس و قمر پہ آپ کا نقش قدم محیط\n\nاس میں بسی ہے سرور کون و مکاں کی یاد\nکیسے ہوں میرے قلب پہ رنج و الم محیط\n\nقطرہ ہے اک حضور کے بحر علوم کا\nہیں جس کمالِ علم پر لوح و قلم محیط\n\nدرپیش ہے حضور کی مدحت کا مرحلہ\nکیوں کر ہو پھر بیان پہ طرز رقم محیط\n\nفرش زمیں پہ آپ ہیں عرش بریں پہ آپ\nدونوں جہاں پہ آپ کا نوری علم محیط\n\nشہزادؔ پیرویٔ رسالت سے یہ کھلا\nہوتے نہیں ہیں فقر پہ جاہ و حشم محیط"
  },
  {
    "id": 343,
    "title": "نعت شریف",
    "description": "خامہ ، حرف ، ورق سب روشن\nنور ثنا سے ہر شب روشن\n\nذکر خدا و یاد نبی سے\nمسجد روشن ، مکتب روشن\n\nہم پر اُن کے فیض سخن سے\nہے ہر بات کا مطلب روشن\n\nکھلتے ہیں لب ان کی ثنا میں\nہو جاتا ہے دل جب روشن\n\nان کو ضو دی مہر حرا نے\nورنہ تھے یہ دن کب روشن\n\nاکثر نور اسم نبی سے\nرہتے ہیں میرے لب روشن\n\nہر سو ہیں اسلام کی کرنیں\nکتنا ہے یہ مذہب روشن\n\nبجھتی نہیں شہزادؔ وہ مشعل\nجس کو کرتا ہے رب روشن"
  },
  {
    "id": 344,
    "title": "دعا، مناجات ، نعت",
    "description": "لائق حمد اے محمد ا کے خدا\nمجھ کو مدحت کا سلیقہ کر عطا\n\nیا الٰہی جب ثنا میں لب کھلیں\nلہجہ حساں ہو میرا رہنما\n\nہو عطا مجھ کو حضوری کا شرف\nخدمتِ شہ میں ہو حاضر یہ گدا\n\nمیں وہاں بن جائوں سر تاپا طلب\nجوش میں ہو اُن کا دریائے سخا\n\nنور سے بھر جائے کشکول نظر\nاس طرح سرکار ہوں جلوہ نما\n\nالغیاث! اے خالق لوح و قلم\nمانگتا ہوں تجھ سے توفیق ثناء\n\nساتھ میرے تائید جبریل ہو\nمرحلہ درپیش ہو جب نعت کا\n\nظلمت قلب و نظر کے واسطے\nنور کا ساماں ہے ذکر مصطفی\n\nمسکرائے گلستان نعت میں\nگُل کھلائے جو مری فکر رسا\n\nنعت زیبا ہے خدا کو آپ کی\nکہہ کے سب کچھ سب نے آخر یہ کہا\n\nاک طرف ہیں ان کے اوصاف جمیل\nاک طرف شہزادؔ مجھ سا بے نوا"
  },
  {
    "id": 345,
    "title": "نعت شریف",
    "description": "ہجر سرکار مدینہ نے رُلایا کیا کیا\nشعلہ آہ نے سینے کو جلایا کیا کیا\n\nفکر دنیا ، غم عقبٰی ، طلب جاہ و حشم\nعشق محبوب دو عالم نے بھلایا کیا کیا\n\nوادیٔ شوق و مرّوت اے حریمِ طیبہ!\nکیا بتائوں تیری یادوں نے ستایا کیا کیا\n\nشوق دیدار میں پلکوں پہ چراغاں کرکے\nچشم بے تاب نے راہوں کو سجایا کیا کیا\n\nسیل آلام نے جب مجھ کو ڈبونا چاہا\nحوصلہ اُن کی محبت نے بڑھایا کیا کیا\n\nعلم و عرفان و عمل حکمت و ایمان و نجات\nدیکھو آقا نے غلاموں کو دلایا کیا کیا\n\nصدق ، اخلاق ، یقیں ، عزم ، مساوات ، وفا\nہادیٔ خلق نے انساں کو سکھایا کیا کیا\n\nدے کے سرکار نے سائل کو ہنر کی ترغیب\nعزت نفس کو لٹنے سے بچایا کیا کیا\n\nگلشن جاں کو درودوں سے مزّین کرکے\nلطف اس حال میں شہزادؔ اٹھایا کیا کیا"
  },
  {
    "id": 346,
    "title": "نعت شریف",
    "description": "کشور جاں کے تاجدار حضور\nملک ایماں کے شہر یار حضور\n\nہر گھڑی گلشن مدینہ میں\nآپ سے موسم بہار حضور\n\nآپ ہی سے حجاز اقدس ہے\nمرجع موسم بہار حضور\n\nابر رحمت کا ڈال دیں چھینٹا\nرات دن دل ہے بے قرار حضور\n\nآپ کے در پہ نذر کرنے کو\nجان لایا ہے جاں نثار حضور\n\nایسے اترا درُود دل میں مرے\nہو گیا میں ثناء شعار حضور\n\nکام ہے آپ کی ثنا سے مجھے\nہے یہی میرا کاروبار حضور\n\nگلستاں ہے اگر مدینہ تو\nآپ ہیں موسم بہار حضور\n\nآپ خورشید ، یہ ستارے ہیں\nکیا کہوں شان چار یار حضور\n\nسوچتا ہوں کہ ہو نہ سوء ادب\nجب میں کہتا ہوں بار بار حضور\n\nپیرہن لطف کا عنایت ہو\nدامن جاں ہے تار تار حضور\n\nخود کو پاتا ہوں یوں اس امت میں\nجیسے گلشن میں کوئی خار حضور\n\nجن غلاموں سے آپ راضی ہیں\nان میں شہزادؔ ہو شمار حضور"
  },
  {
    "id": 347,
    "title": "نعت شریف",
    "description": "نعت کرتا ہوں جب میں رقم باوضو\nپھیل جاتی ہیں کرنیں مرے چار سُو\n\nایسے چمکے حروف ثناء لوح پر\nجیسے موتی ہوں فردوس کے ہوبہو\n\nاک تسلسل ہے یہ رفعت ذکر کا\nہو رہی ہے جو ان کی ثناء کو بہ کو\n\nکاش ہوتا حریم مدینہ میں ، میں\nگنبدِ سبز رہتا مرے روبرو\n\nآپ کہہ کر مخاطب کریں آپ کو\nان سے نسبت کے لائق نہیں لفظ تو\n\nہے حیات آفریں جس کی ساری فضا\nاس جہان محبت کی ہے آرزو\n\nکام لوں گا کہکشاں سے حرفوں کا میں\nرنگ لائے گی اک دن مری جستجو\n\nیہ تمنا ہے اک نعت ایسی بھی ہو\nجو پڑھی جائے سرکار کے رُوبرو\n\nگویا ذکر الٰہی میں مشغول ہے\nجس کے لب پر ہے سرکار کی گفتگو\n\nوادیٔ جاں میں شہزادؔ کوشش کرو\nہو رواں ان کے اوصاف کی آبجو"
  },
  {
    "id": 348,
    "title": "نعت شریف",
    "description": "اصل عرفان ہے آرزو آپ کی\nحسن ایمان ہے جستجو آپ کی\n\nذاکرین الٰہی میں شامل ہے وہ\nجس کے ہونٹوں پہ ہو گفتگو آپ کی\n\nہے شناور وہی بحر اسرار کا\nبات کرتا ہے جو باوضو آپ کی\n\nجس نے دیکھا جمال حسین و حسن\nاس نے دیکھی جھلک ہو بہو آپ کی\n\nآپ کے ذکر ہے غاسل روح و جاں\nبات ممکن نہیں بے وضو آپ کی\n\nخوش خصائل ہیں سب فیضیاب آپ سے\nمرجع حسن اخلاق خو آپ کی\n\nآپ مہر نبوت ہیں ماہِ حرم\nروشنی جلوہ گر کو بہ کو آپ کی\n\nہر زمانے کو سیراب کرتی رہی\nاز ازل تا ابد آبجو آپ کی\n\nکیوں نہ شہزادؔ کو انس ہو قبر سے\nہو گی صورت وہاں رُوبرو آپ کی"
  },
  {
    "id": 349,
    "title": "نعت شریف",
    "description": "اللہ نے کیا آپ کو قرآن کا حامل\nآیا نہ کوئی دہر میں اس شان کا حامل\n\nہونا تھا اسے آپ کے فیضان کا حامل\nیونہی تو نہیں جسم دل و جان کا حامل\n\nچاہے جو دل و جان سے محبوب خدا کو\nدراصل وہی شخص ہے ایمان کا حامل\n\nہے قریہ جاں آپ کی یادوں سے منور\nہر وقت ہے دل آپ کے احسان کا حامل\n\nامداد کا طالب ہے قلم آپ کے در سے\nآقا یہ مسافر نہیں سامان کا حامل\n\nہو سکتی ہیں سب مشکلیں حل عصر رواں کی\nہو جائے اگر آپ کے فرمان کا حامل\n\nشہزادؔ بھی وابستہ دامان نبی ہے\nشہزادؔ بھی ہے رحمتِ رحمن کا حامل"
  },
  {
    "id": 350,
    "title": "نعت شریف",
    "description": "تیرگی سے پر فضا کو روشنی درکار ہے\nہر زباں کو لذت ذکر نبی درکار ہے\n\nخودبخود چھٹ جائے گا اوہامِ باطل کا ہجوم\nاک مقام مصطفی سے آگہی درکار ہے\n\nآ چکا ہے ساری امت کی صفوں میں انتشار\nاس بھٹکتے قافلے کو رہبری درکار ہے\n\nپیرویٔ مصطفی ہے کامیابی کی دلیل\nکامیابی کے لیے ہم کو یہی درکار ہے\n\nطے کرا دیتی ہے پل میں شاہِ دیں کی اک نظر\nجس مسافت کے لیے پوری صدی درکار ہے\n\nبارگاہِ سرور کونین سے نسبت کے ساتھ\nاتباع سرورِ کونین بھی درکار ہے\n\nآنسوئوں میں بھیگ جائے چہرئہ حرف ثناء\nمیری آنکھوں کو مسلسل اک نمی درکار ہے\n\nمدحت سرکار میں اک شعر کہنے کے لیے\nطبعِ شاعر کو گلوں کی تازگی درکار ہے\n\nنعت کے میدان میں شہزاد ؔفن کے ساتھ ساتھ\nمدح گستر کو بہت سی عاجزی درکار ہے"
  },
  {
    "id": 351,
    "title": "نعت شریف",
    "description": "شہر طیبہ کے لالہ زار کی بات\nراحت افزا ہے اس دیار کی بات\n\nچھوڑ کر ذکر باغ طیبہ کا\nکون سنتا پھرے ، بہار کی بات\n\nوقت زحمت سکون دیتی ہے\nملک رحمت کے تاجدار کی بات\n\nآج تک گونجتی ہے خطبوں میں\nسادہ سے اونٹنی سوار کی بات\n\nہم غلامان مصطفی کے لیے\nگل سے بہتر ہے اُن کے خار کی بات\n\nراحت جاں ہے ذکر آل نبی\nفرحت دل ہے چار یار کی بات\n\nکس توجہ سے سن رہے ہیں حضور\nآج بھی ہر گناہگار کی بات\n\nعرض شہزادؔ کر نبی کے حضور\nباادب اپنے حال زار کی بات"
  },
  {
    "id": 352,
    "title": "نعت شریف",
    "description": "ہر سمت ہو گئے وا ایمان کے دریچے\nکھولے جو مصطفی نے قرآن کے دریچے\n\nروشن کبھی نہ ہوتیں علم و عمل کی راہیں\nکھلتے اگر نہ ان کے فیضان کے دریچے\n\nشاید کہیں چلی ہے باد ریاض طیبہ\nعنبر فشاں ہیں قصر عرفان کے دریچے\n\nرکھا قدم خلا میں جس جس جگہ نبی نے\nکھلتے گئے وہیں پر امکان کے دریچے\n\nکاشانہ نبوت کی سمت رخ ہے ان کا\nجتنے ہیں بارگاہِ رحمن کے دریچے\n\nصبح و مسا رواں ہے جن میں نسیم جنت\nکوئے رسول میں ہیں اس شان کے دریچے\n\nدنیا میں منفرد ہے شہزادؔ شہر طیبہ\nہر سو کھلے ہیں جس میں احسان کے دریچے"
  },
  {
    "id": 353,
    "title": "نعت شریف",
    "description": "فیض خیرالوریٰ ہے ازل تا ابد\nان کا جود و سخا ہے ازل تا ابد\n\nنورشمس الضحیٰ ہے ازل تا ابد\nحسن بدرالدّجی ہے ازل تا ابد\n\nہے ترانہ یہی ملک کونین کا\nذکر صل علیٰ ہے ازل تا ابد\n\nیاد احمد بھی ہے اس طرح دائمی\nجیسے ذکر خدا ہے ازل تا ابد\n\nرک سکی ہے نہ ہر گز رُکے گی کبھی\nمدحت مصطفی ہے ازل تا ابد\n\nانبیاء اولیاء اصفیاء کے لیے\nایک ہی مقتدا ہے ازل تا ابد\n\nہر زمانے کو بھیک ان کے در سے ملی\nباب رحمت کھلا ہے ازل تا ابد\n\nایک شہزادؔ ہے حمد رب مستقل\nایک ان کی ثناء ہے ازل تا ابد"
  },
  {
    "id": 354,
    "title": "نعت شریف",
    "description": "میرے آقا سراپا کمالات ہیں\nفرش تا عرش اُن کے فیوضات ہیں\n\nمعجزے جو ہوئے انبیاء کے لیے\nان کے خدّام کی وہ کرامات ہیں\n\nمصدر ہر سیادت بھی ہیں آپ ہی\nآپ ہی سیّد بزم سادات ہیں\n\nقاسم ارض جنت ہیں میرے نبی\nسلطنت ان کی ارض و سمٰوات ہیں\n\nذات باری ہے قید مکاں سے بری\nلامکاں تک انہیں کے مکانات ہیں\n\nخلد کے ہیں مناظر قبا تا احد\nکیا حسیں یہ زمیں پر مقامات ہیں\n\nکام دیتے ہیں ہر دور میں خضر کا\nان کے قدموں کے جتنے نشانات ہیں\n\nان کی مدحت پہ شہزادؔ ہیں مشتمل\nمصحف حق میں جتنے مقالات ہیں"
  },
  {
    "id": 355,
    "title": "نعت شریف",
    "description": "حسن اعمال کے بدلے میں جزا ملتی ہے\nخوش ہوں سرکار تو مولا کی رضا ملتی ہے\n\nبخشش و رحمت و انعام و کمالات کے ساتھ\nان کے دربار سے سائل کو صدا ملتی ہے\n\nدارالاخلاص ہے وہ شہر مدینہ جس میں\nخوگر جبر کو تعلیم وفا ملتی ہے\n\nکس طرح ہم سے ادا ہو حق مدحت ان کا\nجن کے در سے ہمیں توفیق ثناء ملتی ہے\n\nجب حد شہر مدینہ میں کوئی داخل ہو\nسب سے پہلے اسے جنت کی ہوا ملتی ہے\n\nسیرت سرور دوراں سے یہ معلوم ہوا\nجادئہ حق میں فنا ہو کے بقا ملتی ہے\n\nمنزل نعت پہ شہزادؔ پہنچتا ہے وہی\nجس کو منجانب حق فکرِ رسا ملتی ہے"
  },
  {
    "id": 356,
    "title": "نعت شریف",
    "description": "منصب مدح نبی مجھ کو بہم ہو جائے\nآشنا لوح عقیدت سے قلم ہو جائے\n\nاسم سرکار اگر دل پہ رقم ہو جائے\nعارف ذات الٰہی یہ صنم ہو جائے\n\nقابل رحم ہے بوسنیا و کشمیر کا حال\nاک نظر شاہ عرب! سوئے عجم ہو جائے\n\nباب رحمت سے عطا ہو مجھے خیرات حضور!\nمیری حالت بھی شناسائے کرم ہو جائے\n\nباغ امت میں کھلیں پھول طرب کے آقا!\nختم اسلام کا اب دور الم ہو جائے\n\nیہ تمنا ہے مدینہ کے گلی کوچوں میں\nسر زمیں بوس ہو ایسا کہ قدم ہو جائے\n\nروح شہزادؔ رہے محو ثناء میں ہر دم\nبت کدہ میرے خیالوں کا حرم ہو جائے"
  },
  {
    "id": 357,
    "title": "نعت شریف",
    "description": "دل و نظر سے غبار اترا تو میں نے دیکھا\nفلک سے اک ذی وقار اترا تو میں نے دیکھا\n\nخیال طیبہ میں ، میں جو ڈوبا تو پہنچا چودہ سو سال پیچھے\nقبا میں اک طرح دار اترا تو میں نے دیکھا\n\nحریم وحدت میں جل رہا ہے چراغ نور محمدی کا\nمئے انا کا خمار اترا تو میں نے دیکھا\n\nفضائے یثرب سے نقش طیبہ ابھر رہا ہے\nزمیں پہ قصویٰ سوار اترا تو میں نے دیکھا\n\nثبات شہزادؔ ہے تو ہے شہر مصطفی میں\nمیں بحر خواہش کے پار اترا تو میں نے دیکھا"
  },
  {
    "id": 358,
    "title": "نعت شریف",
    "description": "یاد طیبہ کی ہوا سے باب چشم تر کھلا\nوقت مدحتِ صحن جاں میں رحمتوں کا در کھلا\n\nپھیل جائے گی مہک ذکر نبی کی چار سُو\nروز محشر جب مرے اعمال کا دفتر کھلا\n\nجب کیا میں نے ارادہ مدحت سرکار کا\nسائبانی کے لیے جبریل کا شہپر کھلا\n\nہم کہ آب زر سمجھتے تھے سراب ریگ کو\nجب حضور آئے تو ہم پر فرق خیر و شر کھلا\n\nجانے کب آ جائے طیبہ کا مہاجر لوٹ کر\nرات دن یونہی نہیں رہتا خدا کا گھر کھلا\n\nنقش طیبہ ہو گیا قرطاس جاں پر مرتسم\nیوں مرے وجدان پر فردوس کا منظر کھلا\n\nعقل جب شہزادؔ عشق مصطفی میں ڈھل گئی\nآدمی پر عقدئہ اسرار بحر و بر کھلا"
  },
  {
    "id": 359,
    "title": "نعت شریف",
    "description": "رسم و رواج دہر کی حد سے نکل کے آ\nیہ روضہ حضور ہے زائر سنبھل کے آ\n\nآہستہ سانس لے کہ دیار ادب ہے یہ\nخوش ہوں حضور ایسے توازن سے چل کے آ\n\nہونا ہے پیش تجھ کو پیمبر کے روبرو\nاے سوز احتیاط سے اشکوں میں ڈھل کے آ\n\nاے دل اگر ہے قربت خیرالوریٰ کا شوق\nحرص ہو ہوا و کبر کی عادت بدل کے آ\n\nچاہے اگر ہو شعر میں شہزادؔ کچھ اثر\nعشق نبی کی آگ میں تو بھی پگھل کے آ"
  },
  {
    "id": 360,
    "title": "نعت شریف",
    "description": "کیجیے میرے حق میں دعا یا نبی\nنعت پر ہو مرا خاتمہ یانبی\n\nرک نہ جائے درآمد مضامین کی\nہو نہ جائے قلم بے وفا یا نبی\n\nہاتھ میں لے کے کشکول کم مائیگی\nخیر کا منتظر ہے گدا یا نبی\n\nایسا لگتا ہے کوہِ صفا آج تک\nدے رہا ہے کسی کو صدا یا نبی\n\nآپ کے لطف سے گلشن قلب میں\nچل رہی ہے سکوں کی ہوا یا نبی\n\nدیکھا جائے نگاہ حقیقت سے گر\nمنتشر ہے حرم کی فضا یا نبی\n\nایک شہر مدینہ کے سلطان کیا\nآپ تو ہیں شہ دوسرا یا نبی\n\nجس کا ایک ایک مضمون ہو منفرد\nچاہتا ہوں وہ طرز ثناء یا نبی\n\nآپ کے در سے اشعار توصیف کی\nبھیک لیتی ہے فکر رسا یا نبی\n\nداد دے روحِ حسان جس پر مجھے\nشعر ایسا ہو کوئی عطا یا نبی\n\nکیا لکھے نعت شہزادؔ سا بے ہنر\nمیں کہاں مرتبہ یہ کجا یا نبی"
  },
  {
    "id": 361,
    "title": "نعت شریف",
    "description": "سرکار یہ گدا کا نہ گمان ہے نہ دعویٰ\nمجھے آپ کی ثناء کا نہ گمان ہے نہ دعویٰ\n\nمیں غلام آپ کا ہوں مجھے ہے یہ فخر کافی\nخود بینی و ریاکا نہ گمان ہے نہ دعویٰ\n\nمجھے آپ ہی کے در سے ہے اُمید بہتری کی\nکسی اور سے جزا کا نہ گمان ہے نہ دعویٰ\n\nنہ میں کعبؔ ہوں نہ جامیؔ ، نہ بوصیریؔ و شہیدیؔ\nمجھے صدق یا صفا کا نہ گمان ہے نہ دعویٰ\n\nمیں تلاش میں ابھی ہوں کسی نغمہ رسا کی\nمجھے خوبی نوا کا نہ گمان ہے نہ دعویٰ\n\nمیرے درد کا مداوا ہے بس آپ ہی کے در پہ\nکہیں اور سے شفا کا نہ گمان ہے نہ دعویٰ\n\nمرے مقتدا و رہبر ہیں حضور آپ ، لیکن\nمجھے حسن اقتدا کا نہ گمان ہے نہ دعویٰ"
  },
  {
    "id": 362,
    "title": "نعت شریف",
    "description": "طائر فکر اڑے اور جناں تک پہنچے\nعین ممکن ہے کبھی ان کے مکاں تک پہنچے\n\nجس جگہ آپ گئے اور جہاں تک پہنچے\nغیرممکن ہے کوئی اور وہاں تک پہنچے\n\nچھوڑ کر پیرویٔ نقش کف پائے حضور\nقافلے اہل تیقن کے گماں تک پہنچے\n\nہو خیالوں کو مرے پیکر الفاظ نصیب\nسیل جذبات حد اشک رواں تک پہنچے\n\nکھینچ لو نسبت سرکار مدینہ کا حصار\nاس سے پہلے کہ شرر گلشن جاں تک پہنچے\n\nتو نظر آیا نہیں شہر مدینہ ہم کو\nہم تجسّس میں ترے باغ جناں تک پہنچے\n\nڈھونڈتے ڈھونڈتے اے اصل حقائق تجھ کو\nدارِ ارواح سے ہم دیکھ کہاں تک پہنچے\n\nمیں نے شہزادؔ کیا جونہی تصور ان کا\nحرف باطرزِ گدا باب بیاں تک پہنچے"
  },
  {
    "id": 363,
    "title": "دعا، مناجات، نعت",
    "description": "بارگاہِ سرور دیں کے ثناء خوانوں کی خیر\nشمع وصف شہ طیبہ کے پروانوں کی خیر\n\nآپ کے نقش قدم پر ہیں فدا مژگان تر\nآپ جن سے ہو کے گزرے ان بیابانوں کی خیر\n\nدوپہر کو بیٹھتے تھے آپ جن کی چھائوں میں\nان ثمرآور درختوں ان گلستانوں کی خیر\n\nحضرت صدیق ، عمر ، عثمان، علی ، زید و بلال\nمیرے آقا آپ کے ان مرتبہ دانوں کی خیر\n\nآپ کے زیرقیادت ہے نبوت کا جلوس\nحامل بار نبوت آپ کے شانوں کی خیر\n\nجن کی صورت سے عیاں ہو آپ کی سیرت کا نور\nآپ کے دامن گرفتہ ایسے دیوانوں کی خیر\n\nعشق ہے شہزادؔ جن کو سرور کونین سے\nان غلاموں ان فقیروں ، ان جہانبانوں کی خیر"
  },
  {
    "id": 364,
    "title": "نعت شریف",
    "description": "ان کا پیرو بہک نہیں سکتا\nیہ مسافر تو تھک نہیں سکتا\n\nباغ طیبہ سے رابطے کے بغیر\nکوئی غنچہ چٹک نہیں سکتا\n\nان کی سانسیں جو مشکبار نہ ہوں\nپھول ہر گز مہک نہیں سکتا\n\nسورج ان سے جو فیضیاب نہ ہو\nیوں مسلسل چمک نہیں سکتا\n\nملتفت وہ نہ ہوں تو آنکھوں سے\nایک آنسو ٹپک نہیں سکتا\n\nجب تک اذن رسول پاک نہ ہو\nوقت پلکیں جھپک نہیں سکتا\n\nروبرو میں کھڑا ہوں روضے کے\nآنکھ اٹھاتا ہوں تک نہیں سکتا\n\nجس کے رہبر حضور ہوں شہزادؔ\nوہ مسافر بھٹک نہیں سکتا"
  },
  {
    "id": 365,
    "title": "’’وَرَفَعْنَا لَکَ ذِکْرَکْ‘‘",
    "description": "خدا کی حمد و ثنا و تسبیح\nکا جہاں تک بھی سلسلہ ہے\n\nوہاں پہ اسم رسول اکرم\nکا نور بھی جگمگا رہا ہے\n\nفضائے کون و مکاں میں ہر سُو\nحدود ارض و سما سے باہر\n\nجہاں بھی ہے کوئی سبحہ گرداں\nوہاں درود و سلام بھی ہے\n\nوہاں محمد ا کا نام بھی "
  },
  {
    "id": 366,
    "title": "’’ذکرک ذکری‘‘",
    "description": "خدا نے بخشی ہے آپ رفعت\nمقام و اسم محمدی کو ، رئوف کہہ کر رحیم کہہ کر\n\nعظیم کہہ کر ، کریم کہہ کر\nکہیں الف لام میم کہہ کر\n\nزمیں پہ ان کو کیا محمد (ا)\nفلک پہ احمد انہیں بنایا\n\nغرض کہ توحید کو رسالت کی راہ سے منکشف کیا ہے\nاذان ہو یا نماز دیکھو ، دعا کا سوز و گداز دیکھو\n\nسفر میں دیکھو ، حضر میں دیکھو\nجہاد دیکھو ، محاذ دیکھو\n\nذرا کلام مجید دیکھو یہ شان رب حمید دیکھو\nکہ اس نے ہر اک مقام پر ساتھ اپنے رکھا ہے\n\nاپنے پیارے رسول پیارے (حبیب) کا\nپاک نام نامی"
  },
  {
    "id": 367,
    "title": "نعت شریف",
    "description": "کئی سورج نبی کے در سے پھوٹے\nستارے بھی انہیں کے گھر سے پھوٹے\n\nمزہ دیتی ہے تب مدح سرائی\nجو چشمہ نعت کا اندر سے پھوٹے\n\nعطا کی روشنی ہے شہر جاں میں\nثناء کا نور ہر منظر سے پھوٹے\n\nاُٹھاتا ہوں میں اک لطف حضوری\nگہر جب میری چشم تر سے پھوٹے\n\nادھر ہلنا تھا ان کی انگلیوں کا\nادھر ، چشمے کئی کوثر سے پھوٹے\n\nجہاں میں بانٹتی پھرتی ہے سورج\nکرن جو گنبد اَخضر سے پھوٹے\n\nکھلے شہزادؔ جب اعمال نامہ\nمہک مدحت کی ہر دفتر سے پھوٹے"
  },
  {
    "id": 368,
    "title": "نعت شریف",
    "description": "رونق بزم جہاں شمع شبستان عرب\nثانی باغ جناں حسن گلستان عرب\n\nراحت قلب و نظر غنچہ بستان عرب\nچارئہ درد جگر خار بیابان عرب\n\nتابع حکم شہ دیں ہیں عجم کے دفتر\nدست محبوب خدا میں ہے قلمدان عرب\n\nذرّہ ذرّہ میں چمکتے ہیں یہاں ماہ و نجوم\nجادئہ عرش معلیٰ ہے خیابان عرب\n\nجب کھلا باب عنایات نبوّت اس میں\nآسماں گیر ہوئی وسعت دامان عرب\n\nسنّت سرورِ دیں ، صاحب ایماں کا وقار\nیعنی دستار کہ ہے زینتِ مردان عرب\n\nمجھ کو شہزادؔ کمک روحِ رضاؔ سے پہنچی\nورنہ ہوتی نہ رقم مدحت سلطان عرب"
  },
  {
    "id": 369,
    "title": "نعت شریف",
    "description": "ہاتھ میں لے کے قلم اپنا مقدر لکھنا\nاتنا آساں بھی نہیں نعت پیمبر لکھنا\n\nدفتر حشر کا سرکار کو افسر لکھنا\nکشور ارض و سما کا انہیں سرور لکھنا\n\nدیکھنا ان کی عنایات کریمانہ کو\nاور انہیں سب کے لیے لطف کا پیکر لکھنا\n\nپیاس میں شربت کوثر کی سی لذت دے گا\nشاہ کوثر کا قصیدہ لب کوثر لکھنا\n\nقبر پر ناعت احمد کی لگانا تختی\nواصف شاہ عرب میرے کفن پر لکھنا\n\nبات ہو ان کے مدینے کی تو جنت کہنا\nذکر ہو اس کی فضا کا تو معطر لکھنا\n\nدیکھ کر نقش کف پائے نبی کی جھلمل\nہم سے ممکن نہ ہوا مہ کو منوّر لکھنا\n\nکثرت لطف الٰہی کا ہے شہزادؔ ثبوت\nمدحت مصطفوی لکھنا اور اکثر لکھنا"
  },
  {
    "id": 370,
    "title": "نعت شریف",
    "description": "نظم توصیف نبی کی ابتدا ہو جائے گی\nزندگی جس روز نذر مصطفی ہو جائے گی\n\nاوڑھ لوں گا جسم پر ذکر پیمبر کی ردا\nموت ٹکرائے گی مجھ سے اور فنا ہو جائے گی\n\nہے مجھے کامل یقیں ان کی نگاہ لطف پر\nمیری قسمت میں مدینے کی فضا ہو جائے گی\n\nایک دن حاصل حضوری کا شرف ہو گا مجھے\nایک دن مقبول میری ہر دعا ہو جائے گی\n\nدہر کا ہر ایک رشتہ ان کی نسبت پر نثار\nہر تمنا ان کی سنت پر فدا ہو جائے گی\n\nبخشا جائے گا اسی کو پیشوائی کا مقام\nجس کو حاصل شاہ دیں کی اقتدا ہو جائے گی\n\nمیرے تو شہزادؔ یہ وہم و گماں تک میں نہ تھا\nنعمتِ نعت نبی مجھ کو عطا ہو جائے گی"
  },
  {
    "id": 371,
    "title": "نعت شریف",
    "description": "اخلاص کا پیکر ہیں تو احسان سراپا\nاے سرورِ دیں ! آپ ہیں قرآن سراپا\n\nہے آپ کا دل مخزن اسرارِ الٰہی\nہر ایک ادا آپ کی عرفان سراپا\n\nکی آپ کے ہر فعل نے توحید کی تفسیر\nہیں آپ ہی دیں ، آپ ہی ایمان سراپا\n\nاے ختم رسل! ناسخ ادیان و صحائف\nاے نورِ مبیں ، جلوئہ رحمن سراپا\n\nشہزادؔ خیال آتا ہے جب شہر نبی کا\nہو جاتا ہے دل شوق سے ارمان سراپا"
  },
  {
    "id": 372,
    "title": "نعت شریف",
    "description": "سرور دیں رحمت کونین کی کیا بات ہے\nفخر عالم ہادیٔ دارین کی کیا بات ہے\n\nیاد آتے ہی نہیں جس کی فضا میں رنج و غم\nشہر طیبہ قریہ سکھ چین کی کیا بات ہے\n\nکوئی ثانی ہی نہیں ہے ان کا خلق و خلق میں\nآمنہ بی بی کے نور عین کی کیا بات ہے\n\nجن کا ایک اک نقش ہے رشد و ہدایت کا چراغ\nاس مجسم نور کے نعلین کی کیا بات ہے\n\nجن کی ہے ہر اک ادا نور نبی سے مستفیض\nحضرت عثمان ذوالنورین کی کیا بات ہے\n\nہیں شہ کونین کے شہزادؔ یہ دونوں وزیر\nیعنی صدیق و عمر شیخین کی کیا بات ہے"
  },
  {
    "id": 373,
    "title": "نعت شریف",
    "description": "حسن فطرت کا اوج کمال آپ ہیں\nپیکر نور ، شیریں مقال آپ ہیں\n\nحسنِ کونین ہے مستفیض آپ سے\nتاجدار حریم جمال آپ ہیں\n\nآپ سے گلشن جاں میں رعنائیاں\nرونق بزم فکر و خیال آپ ہیں\n\nآپ کا ذکر ہے راحت قلب و جاں\nدافع رنج و حزن و ملال آپ ہیں\n\nآپ کا نقش پا ہے چراغ ھدٰی\nدہر کے رہبر خوش خصال آپ ہیں\n\nمستفید آپ سے ہر زمانہ ہوا\nمحسن اہل ماضی و حال آپ ہیں\n\nفیض پاتا ہے جذب اویس آپ سے\nذوق افزائے عشق بلال آپ ہیں\n\nکس سے تشبیہ شہزادؔ دے آپ کو\nیا نبی! بے مثیل و مثال آپ ہیں"
  },
  {
    "id": 374,
    "title": "نعت شریف",
    "description": "قلب کو انوار مدحت نے مجلا کر دیا\nنفس کو فیضان سیرت نے مزکی کر دیا\n\nبخش کر کچی زمیں کو استراحت کا شرف\nمصطفی نے فرش کو عرش معلیٰ کر دیا\n\nمہرباں ہے کس قدر مجھ پر مرا رب کریم\nجس نے مجھ کو آپ کی امت میں پیدا کر دیا\n\nمیں کہ محروم تعارف تھا ہجوم خلق میں\nآپ کی نسبت نے مجھ کو با حوالہ کر دیا\n\nحاملیں فیض رسالت کے ہیں اصحاب نبی\nان ستاروں نے جہاں بھر میں اجالا کر دیا\n\nشہسوار بدر و خندق ، صاحب تسبیح و تیغ\nآپ کی تعلیم نے بندے کو مولا کر دیا\n\nان گنت شہزادؔ اس ذات گرامی پر درود\nجس کی چشم لطف نے اسفل کو اعلیٰ کر دیا"
  },
  {
    "id": 375,
    "title": "نعت شریف",
    "description": "نسبت کا اثبات عطا ہو\nخاص کوئی سوغات عطا ہو\n\nسوکھی ہے آنکھوں کی کھیتی\nاشکوں کی برسات عطا ہو\n\nخالی ہے اظہار کا کاسہ\nلفظوں کی خیرات عطا ہو\n\nجس کو سن کر قدسی جھومیں\nمجھ کو ایسی نعت عطا ہو\n\nجس میں ہو معراج بصارت\nایسی بھی اک رات عطا ہو\n\nکرتا ہے شہزادؔ گزارش\nاب عرفان ذات عطا ہو"
  },
  {
    "id": 376,
    "title": "نعت شریف",
    "description": "ان کی سیرت ہے راہبر میری\nشاخ ایماں ہے باثمر میری\n\nآفتاب ثنا کی کرنوں سے\nجگمگاتی ہے ہر سحر میری\n\nڈھال کر سوز جاں کو اشکوں میں\nپیش کرتی ہے چشم تر میری\n\nقافلہ دیکھ کر مدینے کا\nاشک افشاں ہے چشم تر میری\n\nروضہ مصطفی پہ جا پہنچوں\nآہ جائے نہ بے اثر میری\n\nاس میں سرکار کا حوالہ ہے\nبات ہو کیوں نہ معتبر میری\n\nبیت جائے ثنائے خواجہ میں\nزندگی ہے جو مختصر میری\n\nمیں ہوں بیمار بارگاہِ رسول\nچھوڑ دے فکر چارہ گر میری\n\nپھر تو شہزادؔ بات بن جائے\nبات آقا سنیں اگر میری"
  },
  {
    "id": 377,
    "title": "اے مدینہ!",
    "description": "اے مدینہ! اے سرزمینِ ادب\nتجھ سے قائم ہے حسنِ ملکِ عرب\n\nنام تیرے ہیں سب حسین و جمیل\nتیرے آثار شاندار و عجب\n\nتجھ میں جلوہ نما ہیں سرورِ دیں\nتیری عظمت کا ہے یہی تو سبب\n\nارضِ طیبہ اے فرشِ عرش نما\nخلد سے مل رہا ہے تیرا حسب\n\nاے حریم نبی! اے عکس عدن\nسارے شہروں میں تو مجھے ہے احب\n\nراحت قلب و جاں ہے تیرا خیال\nیاد تیری ہے مجھ کو وجہ طرب\n\nاے مطیب! نظیف اے طابہ!\nمصدر صبح جاں تری ہر شب\n\nکھول دے مجھ پہ اپنے دروازے\nمیں ہوں بیمار اور تو ہے مطب\n\nاے دیارِ کرم مجھے بھی نواز\nغم لگاتا ہے بامِ جاں میں نقب\n\nتجھ سے شہزادؔ کو عقیدت ہے\nاس کے دامن میں ہے عمل نہ کسب"
  },
  {
    "id": 378,
    "title": "نعت شریف",
    "description": "پل بھر میں بار یاب حضور خدا میں تھی\nصلِّ علیٰ کی چاشنی شامل دُعا میں تھی\n\nاک سمت فیض وحی تھا ، اک سمت مصطفی\nدونوں جہاں کی روشنی غارِ حرا میں تھی\n\nباب حرم کے سامنے ساکت کھڑا رہا\nکب تاب مدعا طلبی مجھ گدا میں تھی\n\nدستِ سوال دستِ عطا میں بدل گیا\nتاثیر یہ حضور کی شانِ سخا میں تھی\n\nمحشر میں ہوں گے ان کی شفاعت سے فیضیاب\nحکمت یہی بس ایک ہماری خطا میں تھی\n\nپاتا ہوں اب بھی موجِ نفس میں وہی مہک\nخوشبو عجیب شہرِ نبی کی فضا میں تھی\n\nشہزادؔ جب جہان کو دیکھا بچشمِ دل\nہر چیز محو مدحت خیرالوریٰ میں تھی"
  },
  {
    "id": 379,
    "title": "نعت شریف",
    "description": "چھیڑتے اہلِ حقائق بھی فسانے اپنے\nکاش ہوتے درِ آقا پہ ٹھکانے اپنے\n\nچھوڑ کر پیرویٔ نقشِ کف پائے حضور\nاپنے تیروں سے لیے ہم نے نشانے اپنے\n\nکارواں ان کی محبت کا ہمیں لے بھی گیا\nڈھونڈتے ہی رہے اسباب بہانے اپنے\n\nایک اک پل ہو قیامت جو نہ ہو ان کی نظر\nان کی رحمت کا تسلسل ہیں زمانے اپنے\n\nسایہ گنبد خضریٰ ہو میّسر ہم کو\nپائیں تعبیر کبھی خواب سہانے اپنے\n\nذکر اوصاف پیمبر کا ہے شہزادؔ سبب\nداد جبریل سے پاتے ہیں ترانے اپنے"
  },
  {
    "id": 380,
    "title": "نعت شریف",
    "description": "جذب درُوں خلوص کے سانچے میں ڈھل ذرا\nاے دل حدِ حریم نبی ہے سنبھل ذرا\n\nمصداق یہ دیار بھی ’’لااُقْسِمُ‘‘ کا ہے\nاس راہ محترم پہ دبے پائوں چل ذرا\n\nآہستہ سانس لے یہ مقام بقیع ہے\nآرام عاشقاں میں نہ آئے خلل ذرا\n\nخیرات خلق مانگ خلیق عظیم سے\nاے ترش رُو مزاج کو اپنے بدل ذرا\n\nشاید لکھی ہو میرے مقدّر میں یہ زمیں\nرک جائو! اہل کارواں دوچار پل ذرا\n\nشہزادؔ ان کے حسن کرم نے بچا لیا\nآیا نہ کام حشر میں کوئی عمل ذرا"
  },
  {
    "id": 381,
    "title": "نعت شریف",
    "description": "گیا جب نور اسم احمدی ہونٹوں سے آنکھوں تک\nہوئی جلوئہ نما اک روشنی ہونٹوں سے آنکھوں تک\n\nتقاضائے ادب نے ارتقا بخشا تجسس کو\nتمنا دل میں تھی جو آ گئی ہونٹوں سے آنکھوں تک\n\nسکوں دیتی ہے یاد مونس بے چارہ گاں دل کو\nبسیرا جب کرے آزردگی ہونٹوں سے آنکھوں تک\n\nفراق خلد طیبہ میں ہوا کچھ اشکبار ایسے\nید قدرت کی دیکھی زرگری ہونٹوں سے آنکھوں تک\n\nنظر آیا ہر اک زائر لیے کشکول چشم و لب\nسمٹ آئی ہو جیسے زندگی ہونٹوں سے آنکھوں تک\n\nیہ ثمرہ ہے حضوری کے تصور کا کہ اب ہر دم\nمجھے محسوس ہوتی ہے نمی ہونٹوں سے آنکھوں تک\n\nتڑپتا ہے بہت شہزادؔ دل ہجر مدینہ میں\nمگر ہے رہگزر جذبات کی ہونٹوں سے آنکھوں تک"
  },
  {
    "id": 382,
    "title": "نعت شریف",
    "description": "آپ کے التفات کی صورت\nہم نے دیکھی نجات صورت\n\nثبت اس پر ہے نقشِ پائے نبی\nکیوں نہ نکھرے حیات کی صورت\n\nابتسام مہ عرب کے طفیل\nروشن اب تک ہے رات کی صورت\n\nہر تغیرّ دیار طیبہ میں\nدیکھتا ہے ثبات کی صورت\n\nمہر فاران کی شعاع سے ہے\nضوفشاں کائنات کی صورت\n\nآنکھ شہزادؔ چاہیے دل کی\nدیکھنی ہو جو نعت کی صورت"
  },
  {
    "id": 383,
    "title": "نعت شریف",
    "description": "طوفان حوادث میں ہوں تنہا مرے آقا\nجز آپ کے کوئی نہیں اپنا مرے آقا\n\nاس پر جو عنایات کا بادل کبھی برسے\nہو جائے خنک روح کا صحرا مرے آقا\n\nہیں آپ ہی اللہ کی ہر صفت کا مظہر\nلاثانی و بے ہمسر و یکتا مرے آقا\n\nاسرارِ حیات اس پہ کبھی کھل نہیں سکتے\nجو آپ کی عظمت نہیں سمجھا مرے آقا\n\nہوتا جو میسر مجھے وہ دور مقدّس\nسر آپ کے نعلین پہ رکھتا مرے آقا\n\nہوتا ہوں خجل کر کے حضوری کا تصور\nکس طرح کروں عرضِ تمناّ مرے آقا\n\nہو جائوں رہا قید زماں اور مکاں سے\nبن جائے مرا دل ہی مدینہ مرے آقا\n\nچلتے رہیں کونین میں خیرات کے دھارے\nجاری رہے الطاف کا دریا مرے آقا\n\nرکھتا ہے در پاک سے شہزادؔ بھی نسبت\nسائل کو عطا ہو کوئی ٹکڑا مرے آقا"
  },
  {
    "id": 384,
    "title": "نعت شریف",
    "description": "یہی نہیں کہ فقط اس زمیں پہ لہرائے\nعلم حضور کا عرش بریں پہ لہرائے\n\nانہی سے آس ہے بے کس کو چشم رحمت کی\nوہ جن کی ظلّ کرم عالمیں پہ لہرائے\n\nنزول وحی کے لمحات کہکشاں بن کر\nمرے نبی کی مقدّس جبیں پہ لہرائے\n\nعبیر و مشک سے میں بے نیاز ہو جائوں\nاگر وہ دامنِ اقدس کہیں پہ لہرائے\n\nجلی ہے نعت کی مشعل جو میرے آنگن میں\nچراغ لطف کی لو بھی یہیں پہ لہرائے\n\nہو جس مقام پر شہزادؔ تیرگی کا ورُود\nمہ منیر کا پر تو وہیں پہ لہرائے"
  },
  {
    "id": 385,
    "title": "نعت شریف",
    "description": "دیار مصطفوی کا جمال کیا کہنا\nبہر لحاظ ہے جو لازوال کیا کہنا\n\nفلاح کل کی ضمانت ہے پیروی جس کی\nوہ نقش پائے شہِ خوش خصال کیا کہنا\n\nدر نبی کے تصوّر میں سجدہ ریز رہی\nجبین عجز کا اوج کمال کیا کہنا\n\nوہ ، معجزات ہیں جس کی ہر اک ادا پہ نثار\nنہیں ہے دہر میں جس کی مثال کیا کہنا\n\nوفا کا لفظ ہوا اور معتبر جس سے\nمرے حضور کا عاشق بلال کیا کہنا\n\nادب ادب کی صدا دے رہی ہے ہر دھڑکن\nپلک پلک پہ دھرا ہے سوال کیا کہنا\n\nملی ہوئی ہے مرے دل سے سرحد طیبہ\nمرے شعور کا حسن خیال کیا کہنا\n\nاتار دیتا ہے شہزادؔ دل سے بوجھ کئی\nفراق مصطفوی کا ملال کیا کہنا"
  },
  {
    "id": 386,
    "title": "نعت شریف",
    "description": "بعد ہجرت کی سکونت اختیار آ کر یہاں\nآپ نے طیبہ کو بخشا افتخار آ کر یہاں\n\nشہر طیبہ کتنی تسکیں بخش ہے تیری فضا\nچین پاتے ہیں جہاں کے بے قرار آ کر یہاں\n\nکیا کشش ہے بارگاہِ سرورِ کونین میں\nسر جھکاتے ہیں فقیر و تاجدار آ کر یہاں\n\nمعجزہ یہ بھی ہے اس ذات ادب آموز کا\nسیکھتے ہیں تاجور بھی انکسار آ کر یہاں\n\nچوم کر گلزار طیبہ کی تر و تازہ ہوا\nاور بھی دلکش ہوئی فصلِ بہار آ کر یہاں\n\nجنت الفردوس جیسا ہے سماں ماحول میں\nختم ہو جاتا ہے سارا انتظار آ کر یہاں\n\nمرتبہ شہزادؔ ہو جاتا ہے زائر کا بلند\nکم نہیں ہوتی ہے عزت بار بار آ کر یہاں"
  },
  {
    "id": 387,
    "title": "نعت شریف",
    "description": "بنا کے سیرتِ اطہر کو رہنما ہم نے\nنشانِ منزل مقصود پا لیا ہم نے\n\nکبھی نصیب ہو آقا اسے بھی باب مراد\nہر ایک آہ کو پایا ہے نارسا ہم نے\n\nہوئی جو برسر پیکار گردشِ دوراں\nکیا حضور کی رحمت سے رابطہ ہم نے\n\nنگاہِ لطف کو مائل بہ لطف ہی پایا\nدرِ کریم پردی جب کبھی صدا ہم نے\n\nنقوشِ پائے رسالت مآب پر چلنا\nیہی فلاح کا پایا ہے راستہ ہم نے\n\nہر ایک جرم پر نادم ہیں یارسول اللہ!\nادب سے تھام کر دامن کو کہہ دیا ہم نے\n\nبہ مقتضائے عقیدت بصد خلوص و نیاز\nبلیٰ کے ساتھ ہی صلِّ علیٰ کہا ہم نے\n\nکہا حضور نے شہزادؔ لا شریک جسے\nصمیم قلب سے مانا اسے خدا ہم نے"
  },
  {
    "id": 388,
    "title": "نعت شریف",
    "description": "ظلمت میں جبکہ نور کو پیدا کیا گیا\nتاریکیوں کو دہر سے چلتا کیا گیا\n\nاوصاف ہر رسول کو خالق نے کچھ دیے\nشاہِ رُسل کو خلق میں یکتا کیا گیا\n\nرفعت کسی کے ذکر کو ایسی کہاں نصیب\nجیسے مرے حضور کا چرچا کیا گیا\n\nاے صاحب شفاعت کبریٰ ترے طفیل\nہم بے زروں سے خلد کا سودا کیا گیا\n\nتاحشر آفتاب نبوت کے فیض سے\nدھرتی کو رشک عالم بالا کیا گیا\n\nکیا عرض کر سکوں گا پیمبر کے روبرو\nگر نعت ہی کا مجھ سے تقاضا کیا گیا\n\nشہزادؔ گلستان مدینہ کی شکل میں\nکندہ زمیں پہ خلد کا نقشہ کیا گیا"
  },
  {
    "id": 389,
    "title": "نعت شریف",
    "description": "سائل نے لگائی ہے صدا اور طرح کی\nہو بھیک سخی آج عطا اور طرح کی\n\nبے مثل ہیں ہر ایک پیمبر کے خصائص\nہے آپ کی ہر ایک ادا اور طرح کی\n\nآ جائے دعائوں میں اگر تیرا حوالہ\nکرتا ہے عنایات خدا اور طرح کی\n\nسرکار بھی فرماتے ہیں لطف اور طرح کا\nہو جاتی ہے جب مجھ سے خطا اور طرح کی\n\nہے روز فزوں اوجِ کمالاتِ نبوّت\nہر آن ہے قامت پہ قبا اور طرح کی\n\nہو سایہ فگن مجھ پہ ترے ذکر کی چادر\nشہزادؔ کو مل جائے ردا اور طرح کی"
  },
  {
    "id": 390,
    "title": "نعت شریف",
    "description": "ہر ایک رنج و الم کی دوا میسر ہو\nتری گلی کی ہمیں بھی فضا میسر ہو\n\nبس ایک شعر ہو میری نجات کا باعث\nاگر مجھے بھی شعور ثناء میسر ہو\n\nیہ ان کی چشم عنایت سے کچھ بعید نہیں\nگناہگار کو قربِ خدا میسر ہو\n\nخفا رہے مرا مالک یہ ہو نہیں سکتا\nاگر حضور کی مجھ کو رضا میسر ہو\n\nحضور ایک اشارہ کریں جو ہلکا سا\nدل کثیف کو صدق و صفا میسر ہو\n\nاسے ملے گی ہر اک چیز آپ کے در سے\nاُمیدوار ہے سائل صدا میسر ہو\n\nکرم حضور کا شہزادؔ ہو تو گھر بیٹھے\nدرِ حضور کی ٹھنڈی ہوا میسر ہو"
  },
  {
    "id": 391,
    "title": "نعت شریف",
    "description": "عیاں قرآں کے حرفوں سے ترا اکرام ہے آقا\nتری ہر اک ادا پر مشتمل اسلام ہے آقا\n\nنبی’‘ ، صاحب’‘ ، عبد’‘ ، حریص’‘ ، حاشر ’‘، ذکر’‘\nفیوض و نور کا چشمہ ترا ہر نام ہے آقا\n\nترے شایان شاں ہے عبدہٗ کے لفظ کی حرمت\nفَاَوْحٰی کا فقط تیرے لیے پیغام ہے آقا\n\nچنا اپنے لیے تو نے رسول عبد کا منصب\nتحیر خیز یہ کیسا حسیں اقدام ہے آقا\n\nسلامت ہے جو ذوق بندگی تیری عنایت ہے\nسحر خیزی کا جذبہ تیرا فیض عام ہے آقا\n\nہے مرشد فقر والوں کا ترا سنگِ شکم بستہ\nتری خاک گزر اقطاب کا احرام ہے آقا\n\nاے اعزاز دے اپنی غلامی کی سند دے کر\nترا شہزادؔ بھی اک بندئہ بے دام ہے آقا"
  },
  {
    "id": 392,
    "title": "٭        پاکستان ٹیلی ویژن کی طرف سے ربیع الاول ۱۴۲۲ھ میں پیش کیے جانے والے خصوصی پروگرام ’’القابِ رسول‘‘ کے لئے لکھی اور پیش کی گئی۔",
    "description": "نعت شریف\nنجات شر سے ملی خیر کے قریب ہوا\n\nہزار شکر کہ وہ در مجھے نصیب ہوا\nزکوٰۃ دی جو فصاحت کی مصطفی نے اسے\n\nجو سنگ پارہ تھا وہ رشک صد خطیب ہوا\nکوئی خلیل ، مسیح و کلیم ہے کوئی\n\nخدا کا ایک ہی پیارا مگر حبیب ہوا\nہوا طلوع وہ سورج بشارتیں لے کر\n\nدیارِ جبر میں وہ عدل کا نقیب ہوا\nتجلیات کے دیار میں عکس ماہ مبیں\n\nنظر نواز یہ منظر بہت عجیب ہوا\nبہشت و عرش بھی تکتے ہیں رشک سے اس کو\n\nدرِ حضور پہ حاضر جو خوش نصیب ہوا\nبدل گیا ہے شفا میں ہر اک مرض شہزادؔ\n\nغم فراق مدینہ مرا طبیب ہ"
  },
  {
    "id": 393,
    "title": "نعت شریف",
    "description": "حرف میں ہے اثر تو اچھا ہے\nدرد دل میں ہے گر تو اچھا ہے\n\nآبرو ہے اسی میں عاصی کی\nتر رہے چشم تر تو اچھا ہے\n\nبارگاہِ شہ دو عالم میں\nعرض ہو مختصر تو اچھا ہے\n\nجانے آ جائیں کس گھڑی سرکار\nمیں رہوں منتظر تو اچھا ہے\n\nدل رہے ان کے در سے وابستہ\nہو نہ یہ در بدر تو اچھا ہے\n\nکیا خبر نعت کب عطا ہو جائے\nساتھ ہو آبِ زر تو اچھا ہے\n\nسبز گنبد ، سنہری جالی کو\nچوم ہی لے نظر تو اچھا ہے\n\nآ گیا ہے نظر دیار حبیب\nختم ہو اب سفر تو اچھا ہے\n\nان کے شہزادؔ زیر سایہ ہی\nزندگی ہو بسر تو اچھا ہے"
  },
  {
    "id": 394,
    "title": "نعت شریف",
    "description": "تاجدار حرم ! رحم فرمائیے\nاے سراپا کرم! رحم فرمائیے\n\nہم گنہگار ہیں ، ہم سیہ کار ہیں\nاے شفیعِ امم رحم فرمائیے\n\nسید و سرورِ تُرک و تاز و مغل\nاے امیرِ عجم رحم فرمائیے\n\nدست اغیار میں ہے کلیدِ حرم\nاے امینِ حرم رحم فرمائیے\n\nکعبہ پھر سے صلیبوں میں محصور ہے\nاے عَلِیْ اِلْھَمْ رحم فرمائیے\n\nبگڑا امت کے چہرے کا ہر نقش ہے\nحسن روئے ارم رحم فرمائیے\n\nسبز گنبد کی قربت عطا کیجیے\nاے مبارک قدم رحم فرمائیے\n\nدر سے شہزادؔ آقا نہ خالی پھرے\nاے قسیم نِعَمْ رحم فرمائیے"
  },
  {
    "id": 395,
    "title": "نعت شریف",
    "description": "دیار نبی کی فضائوں کی خیر\nمدینے کی ٹھنڈی ہوائوں کی خیر\n\nغنیمت ہے دنیا میں ان کا وجود\nدر مصطفی کے گدائوں کی خیر\n\nوسیلہ ہے جن کا تری ذات پاک\nلبوں پر سجی ان دعائوں کی خیر\n\nحفاظت کا حق نے کیا انتظام\nفرشتوں نے مانگی ادائوں کی خیر\n\nیہ دیکھا ہے تیری عدالت کا فیض\nخطا کار مانگیں سزائوں کی خیر\n\nیہ کہتے ہیں کوتاہ دامن فقیر\nسخی! ان مسلسل عطائوں کی خیر\n\nادب سے جھکی گردنوں کو سلام\nنگاہوں سے بہتی خطائوں کی خیر\n\nمواجہہ میں رہتی ہیں جو پست تر\nلرزتی ، سسکتی صدائوں کی خیر\n\nملا جن کو تیری رضا کا مقام\nزمانے کے ان رہنمائوں کی خیر\n\nمدینے کی گلیوں کے ذرّات میں\nچمکتی ہوئی کہکشائوں کی خیر\n\nسناتے ہیں شہزادؔ ذکرِ رسول\nشہِ دیں کے مدح سرائوں کی خیر"
  },
  {
    "id": 396,
    "title": "نعت شریف",
    "description": "نوازشات رسالت مآب کیا کہنا\nکھلا ہے لطف و عنایت کا باب کیا کہنا\n\nجبین و عارض خیرالوریٰ ، تعال اللہ\nکھلی ہوئی ہے خدا کی کتاب کیا کہنا\n\nملا ہے جس سے مسائل کا حل زمانے کو\nدیا حضور نے ایسا نصاب کیا کہنا\n\nکریم و طہٰ و یٰسٓ ، ابطحی و عظیم\nمرے رسول کا اک اک خطاب کیا کہنا\n\nخدا نے صورت ختم الرسل میں بھیج دیا\nہر اک سوال کا کامل جواب کیا کہنا\n\nلو روبرو ہیں مرے مصطفی کے جبرائیل\nیہ ہمنشینی بحر و حباب کیا کہنا\n\nبلال و بوذر و سلمان کی ہر ایک ادا\nوہ جانثاریٔ زید و خباب کیا کہنا\n\nدر حبیب کے ذروں میں غور سے دیکھو\nدمک رہے ہیں کئی آفتاب کیا کہنا\n\nمرے خیال میں شہزادؔ ہے دیار حبیب\nسجے ہیں آنکھ میں طیبہ کے خواب کیا کہنا"
  },
  {
    "id": 397,
    "title": "نعت شریف",
    "description": "خیال جنت طیبہ ہے اور میں تنہا\nتجلیاّت کی دنیا ہے اور میں تنہا\n\nحضور آپ ہی ڈھارس بندھائیے میری\nسفر کی رات ہے صحرا ہے اور میں تنہا\n\nمری حیات کا یاد نبی سے ربط رہے\nبڑا طویل یہ رستہ ہے اور میں تنہا\n\nعجیب لطف ہے دوری میں بھی حضوری کا\nجمال گنبد خضریٰ ہے اور میں تنہا\n\nاے چشم لطف و عنایت مری کفالت کر\nتفکرّات کا میلہ ہے اور میں تنہا\n\nمدد کو آئیے میری اے دستگیر جہاں\nمقابل ایک زمانہ ہے اور میں تنہا\n\nمجھے ثبات کی صورت دکھائیے آقا!\nتغیرات کا پہرا ہے اور میں تنہا\n\nکمک کو بھیجئے شہزادؔ کی سکون و سرور\nغم حیات کا کانٹا ہے اور میں تنہا"
  },
  {
    "id": 398,
    "title": "نعت شریف",
    "description": "بیاں کیا ہو حسن و جمال رسول\nنہیں انبیاء میں مثال رسول\n\nفروغ صداقت کا باعث ہوا\nزمانے میں صدق مقال رسول\n\nفرشتوں میں انسانیت کا وقار\nہے قائم بفیض کمال رسول\n\nمخالف پہ ہیبت ہے میلوں پرے\nتعال اللہ! رعب و جلال رسول\n\n{ OL 100 }\nفطوبیٰ لنا ، ثم طوبیٰ لنا\n\nکہ داریم نسبت بہ آل رسول\nبہاروں کے دن ہوں ، کہ فصل خزاں\n\nرہے ساتھ ہر دم خیال رسول\nدیار کرم میں بہ گوش خیال\n\nسنیں ہم اذان بلال رسول\nیہ منظر ہو شہزادؔ روز جزا\n\n’’من و دست و دامان آل رسول ا "
  },
  {
    "id": 399,
    "title": "نعت شریف",
    "description": "یاد حضور تازگی فکر بشر کی ہے\nوصل حبیب آرزو قلب ونظر کی ہے\n\nان کے لیے ہی جلوئہ خالق ہے آشکار\nان کے لیے ہی روشنی شمس و قمر کی ہے\n\nخادم ہے آسماں بھی اسی بارگاہ کا\nساری زمیں کنیز شہ بحر و بر کی ہے\n\nبے شک سکون بخش ہے کعبہ کی دید بھی\nکچھ کیفیت عجیب ہی آقا کے در کی ہے\n\nمجھ سا ضعیف اور یہ مدحت کے مرحلے\nمیری طرف نگاہ کسی دیدہ ور کی ہے\n\nبطحا کے تاج دار کی چوکھٹ پہ خم رہے\nعظمت اسی میں بندئہ عاجز کے سر کی ہے\n\nذرّہ ہے ایک اور ہزاروں تجلیات\nنورانیّت عجیب تری رہ گزر کی ہے\n\nجس کو کہ اختلاف ہو تیرے مزاج سے\nایسی بھی کوئی چال قضا و قدر کی ہے؟\n\nآتے تھے جس کی دید کو شہزادؔ جبرئیل\nگردش اسی کے واسطے شام و سحر کی ہے"
  },
  {
    "id": 400,
    "title": "نعت شریف",
    "description": "آئی ہے ہوا شہر پیمبر سے گزر کر\nیا حور چلی آتی ہے جنت سے اتر کر\n\nکھل جائے گی ذرّات مدینہ کی حقیقت\nاک آنکھ کو کر شمس ، تو اک آنکھ قمر کر\n\nآ پہنچا ہے اک بار تو اب لوٹ کے مت جا\nاب عمر اسی شہر منوّر میں بسر کر\n\nکیا چیز ہیں یہ پیرس و لندن کی فضائیں\nاک بار مری مان مدینے کا سفر کر\n\nشاید تری قسمت میں ہوں لمحات حضوری\nاس دیدئہ نمناک کو کچھ اور بھی تر کر\n\nاے یاد خدا! عشق نبی! ذکر مدینہ!\nسینے میں اتر ، روح میں آ ، قلب میں گھر کر\n\nرکھ اوڑھ کے ہر وقت ردا صلِّ علیٰ کی\nاے میری دعا خود کو شناسائے اثر کر\n\nمابین ہوں شہزادؔ میں اب بیم و رجا کے\nرکتا ہوں تو آداب سے چلتا ہوں تو ڈر کر"
  },
  {
    "id": 401,
    "title": "نعت شریف",
    "description": "ایسے ہو میری زیست کا ہر پل بسر حضور\nآنکھوں کے سامنے رہے طیبہ نگر حضور\n\nکیسے کروں میں آپ کے آگے کوئی سوال\nاٹھتی نہیں ہے شرم سے میری نظر حضور\n\nسائے میں اپنے لطف کے عاصی کو دیں پناہ\nبرہم ہے کچھ مزاج قضا و قدر حضور\n\nپھر ہے شب سیاہ کو تاروں کی احتیاج\nپھر سے جہاں میں بانٹیے شمس و قمر حضور\n\nدست کرم کے ہاتھ ہے دست تہی کی لاج\nیونہی نہ بیت جائیں یہ شام و سحر حضور\n\nمیرے بدن سے پھوٹنے لگتی ہے روشنی\nکرتا ہوں جب میں آپ کی جانب سفر حضور\n\nزائر دیار قدس کا جاتا ہے جس طرف\nرہتے ہیں ساتھ ساتھ یہ دیوار و در حضور\n\nمیری جبیں ہی لائق چوکھٹ نہ ہوسکی\nکرتے ہیں سجدہ آپ کو سنگ و شجر حضور\n\nدشت عرب کو آپ نے رشک چمن کیا\nہو جائے میری سمت بھی اب تو گزر حضور\n\nہوتا ہے اہل نعت میں شہزادؔ کا شمار\nکافی ہے مجھ کو عشق کا اتنا ثمر حضور"
  },
  {
    "id": 402,
    "title": "نعت شریف",
    "description": "ساری دنیا میں ہے شان سیّد سادات خوب\nحق نے محبوب دو عالم کی بنائی ذات خوب\n\nخواب میں بھی نعت ہی کہتا رہا ہوں آج میں\nیاد سرکار مدینہ میں کٹی ہے رات خوب\n\nحلم ، بندہ پروری ، اخلاص ، سچائی ، وفا\nاس مجسم حسن کی ہیں سب کی سب صفات خوب\n\nمہر و مہ تک ہو گئے جس کے اشارے سے گداز\nرشک دستِ دائودی ہے مصطفی کا ہاتھ خوب\n\nاللہ اللہ کیا زمیں ہے از مدینہ تا حطیم\nشہر مکہ اور منیٰ ، مزدلفہ و عرفات خوب\n\nاہل حج سے پوچھیے اک اک ادا کی کیفیات\nصفا و مروہ کی دوڑیں ، زم زم و میقات خوب\n\nہے عقیدہ عشق والوں کا ازل سے بس یہی\nآئیں جو محبوب کی جانب سے وہ آفات خوب\n\nآئینے شمس و قمر کے ، رشک افلاک و نجوم\nمیرے آقا کی گلی کے ہیں سبھی ذرّات خوب\n\nان کے اوصاف حمیدہ کا بیاں ممکن نہیں\nسرور کونین کی شہزادؔ ہے ہر بات خوب"
  },
  {
    "id": 403,
    "title": "نعت شریف",
    "description": "کونین کے سلطان ہیں سرکار مدینہ\nتسکین دل و جان ہیں سرکار مدینہ\n\nاللہ کا احسان ہیں سرکار مدینہ\nایماں ہے بدن جان ہیں سرکار مدینہ\n\nتکیہ ہے فقط آپ کے الطاف و کرم پر\nہم لوگ تو نادان ہیں سرکار مدینہ\n\nاللہ کے بعد آپ کا ہمسر نہیں کوئی\nکہنے کو تو انسان ہیں سرکار مدینہ\n\nہے آپ کی ہر ایک ادا مظہر فطرت\nچلتا ہوا قرآن ہیں سرکار مدینہ\n\nبے کس ہے جو لاچار ہے جس کا نہیں کوئی\nاس کا سر و سامان ہیں سرکار مدینہ\n\nشرمندہ یہی سوچ کے رہتا ہوں ہمیشہ\nشاہد میرے ہر آن ہیں سرکار مدینہ\n\nوابستہ ہوں شہزادؔ میں دربار نبی سے\nمیں دل ہوں تو ارمان ہیں سرکار مدینہ"
  },
  {
    "id": 404,
    "title": "نعت شریف",
    "description": "بے مثل ہے ہر وصف رسول عربی کا\nہو سکتا نہیں حسن بیاں میرے نبی کا\n\nچرچا ہے اسی نور مجسم کا عجم میں\nشیدا ہے عرب ہاشمی و مطلبی کا\n\nلیتا ہوں میں جب نام نبی اپنی زباں سے\nہوتا ہے گماں خود پہ مجھے بے ادبی کا\n\nاے شیریں دہن ، نوری بدن ، رحمت عالم\nہے تذکرہ حوروں میں تری بوالعجبی کا\n\nتڑپا ہوں بہت ہجر میں اے صاحب کوثر\nساماں ہو کوئی اب تو مری تشنہ لبی کا\n\nاے چارہ گر چارہ گراں! چارہ گری کر\nمعلوم نہیں ہوتا سبب بے سببی کا\n\nہو جائے مری روح پہ انوار کی بارش\nتکمیل کو پہنچے یہ سفر حق طلبی کا\n\nشہزادؔ تو ہے ہی ترے دربار کا شاعر\nدشمن بھی ہے مداح تری خوش لقبی کا"
  },
  {
    "id": 405,
    "title": "نعت شریف",
    "description": "’’تو کجامن کجا‘‘\nیہ میرے آقا کا لطف ہے کہ\n\nرواں ہے میرا قلم\nثناء کے رستے پہ\n\nعاجزی سے\nیہ ان کی رحمت کا ایک ادنیٰ سا\n\nمعجزہ ہے\nکہ مجھ سا بے بس ضعیف بندہ\n\nزبان مدحت میں کھولتا ہے\nیہ ان کی شفقت کہ\n\nنعت ذکر خفی کی صورت\nمرے رگ و پے میں\n\nرچ چکی "
  },
  {
    "id": 406,
    "title": "نعت شریف",
    "description": "یاد سرکار نے کیا لطف روا رکھا ہے\nاک مدینہ میرے سینے میں بسا رکھا ہے\n\nاہل عالم پہ کھلیں میرے معائب\nمیرے عصیاں کو درودوں نے چھپا رکھا ہے\n\nسیل آلام مجھے کب کا بہا لے جاتا\nمیری بگڑی کو شہِ دیں نے بنا رکھا ہے\n\nقمقمے مدحت سرکار کے روشن کرکے\nبزم افکار و تخیل کو سجا رکھا ہے\n\nروضۂ شہ کو خیالوں میں بسا کر ہم نے\nبام مژگاں پہ ستاروں کو ٹکا رکھا ہے\n\nناز کرتے ہیں سرعرش فرشتے اس پر\nجس کو سرکار نے قدموں میں بٹھا رکھا ہے\n\nجوش میں آئیں نہ کیوں بحر کرم کی موجیں\nشافع حشر نے ہاتھوں کو اٹھا رکھا ہے\n\nمیں یہ سوچوں گا مدینہ میں بہ فرط حیرت\nشاہ طیبہ نے مجھے پاس بلا رکھا ہے؟\n\nکتنا خوش بخت ہے شہزادؔ یہ لکڑی کا ستون\nجس کو سرکار نے سینے سے لگا رکھا ہے"
  },
  { "id": 407, "title": "تحیت", "description": "" }
]
