[
  {
    "id": 1,
    "title": "حمدباری تعالیٰ",
    "description": "جرم ہیں بے حساب یا توّاب\nکھول بخشش کا باب یا توّاب\n\nپیاس بجھ جائے کشت باطن کی\nبھیج ایسا سحاب یا توّاب\n\nبخش تسکین قلب کو میرے\nدور ہو اضطراب یا توّاب\n\nسن صدا ’’ربنا ظلمنا‘‘ کی\nبخش بے احتساب یا توّاب\n\nآنکھ نم ہے جبیں عرق آلود\nقلب ہے آب آب یا توّاب\n\nتیرے لطف و کرم کے دریا سے\nمیں رہوں فیضیاب یا توّاب\n\nمیرے عیبوں پہ ڈال دے پردہ\nٹال سارے عذاب یا توّاب\n\nتیری رحمت بنا بھی دیتی ہے\nمعصیت کو صواب یا توّاب\n\nجس کو تو خود سنوارنا چاہے\nوہ ہو کیسے خراب یا توّاب\n\nمجھ کو خوگر بنا اطاعت کا\nبخش علم الکتاب یا توّاب\n\nتو ہے ارحم ترا رسول رحیم\nہوگا کس پر عتاب یا توّاب\n\nدل سے نکلی ہے سوز و درد کے ساتھ\nہو دعا مستجاب یا توّاب\n\nظلمت جاں کو نور کر اے نور!\nہو حقیقت یہ خواب یا توّاب\n\nقرب شہزادؔ کو نواز اپنا!\nاب اٹھا دے حجاب یا توّاب"
  },
  {
    "id": 2,
    "title": "حمدباری تعالیٰ",
    "description": "تیری جانب جو دھیان باقی ہے\nاس لیے تو جہان باقی ہے\n\nتیری یادوں کے فیض سے مولا\nقلب پہ امتنان باقی ہے\n\nاور ہر چیز کے لیے ہے فنا\nایک تیری ہی شان باقی ہے\n\nجو ترے رنگ سے ہوئے رنگین\nان کا نام و نشان باقی ہے\n\nدم بھروں میں تری اطاعت کا\nجب تلک تن میں جان باقی ہے\n\nکروٹیں لیں کئی زمانے نے\nپر ترا سائبان باقی ہے\n\nبخش دے گا گناہگار کو تو\nیہ یقیں ، یہ گمان باقی ہے\n\nمٹ گئے نام بادشاہوں کے\nذکر تیرا ہر آن باقی ہے\n\nجانے شہزادؔ کس ادا کے طفیل\nیہ زمین آسمان باقی ہے"
  },
  {
    "id": 3,
    "title": "حمدباری تعالیٰ",
    "description": "تیرے جلوے ہیں ہر جگہ ہر سو\nآنکھ ہو تو فقط ہے تو ہی تو\n\nکس کلی میں نہیں ہے رنگ ترا\nکس چمن میں نہیں تری خوشبو\n\nآئنہ خلد کا بنے یہ جہاں\nتیرے بندوں میں گر ہو تیری خو\n\nتیری رحمت سے فیضیاب ہے وہ\nجس کا دل کہہ رہا ہو اللہ ھُو\n\nجذب ایسا مجھے عطا فرما!\nبھول جائیں مجھے یہ کاخ و کو\n\nنَحْنُ مِنْ مُسْلِمِیْنَ اَسْلَمْنَا\nاِنَّـکَ قُلْتَنَا فَلاَ تَہِنُوْا\n\nمن میں شہزادؔ کے ہے تیری لگن\nخوگر حمد تن کا ہے ہر مُو"
  },
  {
    "id": 4,
    "title": "حمدباری تعالیٰ",
    "description": "تو اصل حسن و جمال یا رب!\nتو خالق ہر کمال یا رب!\n\nہر ایک تشبیہہ سے منزّہ\nنہیں ہے تیری مثال یا رب!\n\nترا تصرف ہے خشک و تر پر\nترے ہیں دشت و جبال یا رب!\n\nبڑائی شایانِ شاں ہے جس کے\nتو ہے وہی ذوالجلال یارب!\n\nتجھے ہی زیبا ہے بس تکبر\nہے فخر تیرا ہی مال یارب!\n\nمجھے عطا ہو یقیں کی دولت\nچلا تواضع کی چال یارب!\n\nکھڑا ہے کاسہ بدست سائل\nجواب چاہے ، سوال یا رب!\n\nگدا کو بخشے جو بے نیازی\nعجب ہے تیرا خیال یارب!\n\nکہیں قدم لڑکھڑا نہ جائے\nسنبھال مجھ کو سنبھال یارب!\n\nاٹھی ہے سینے میں اک چبھن سی\nورائے حزن و ملال یارب!\n\nمیں مستحق ہوں مجھے عطا ہو\nزکوٰۃ عشق بلال یا رب!\n\nہوا ہے تیغ ہوس کا حملہ\nعطا ہو رحمت کی ڈھال یارب!\n\nکرے جو شہزادؔ کوئی دعویٰ\nکہاں یہ اس کی مجال یارب!"
  },
  {
    "id": 5,
    "title": "حمدباری تعالیٰ",
    "description": "جرم میرے ہزار یا غفار\nرحم تیرا شعار یا غفار\n\nکر نہ پائے گا کوئی پیمانہ\nتیرے احساں شمار یا غفار\n\nمیں ہوں اک عبد بے نوا تیرا\nتو ہے پروردگار یا غفار!\n\nتیری رحمت سے ہے فرشتوں میں\nآدمی کا وقار یا غفار!\n\nمطلع جاں سے اب اتار ہی دے\nخواہشوں کا غبار یا غفار!\n\nعاجزی عبد کا لبادہ ہے\nکبر تیرا ازار یا غفار!\n\nنفس کو بادئہ تغافل کا\nچڑھ نہ جائے خمار یا غفار!\n\nمیں ہوں بیم و رجا کی کشتی میں\nپار مجھ کو اتار یا غفار!\n\nتیرے جود و سخا پہ پلتے ہیں\nمفلس و تاجدار یا غفار!\n\nکاش ہو طور اک تجلیّ سے\nقلب تیرہ و تار یا غفار!\n\nباغ عرفان میں رہے شہزادؔ\nمثل باد بہار یا غفار!"
  },
  {
    "id": 6,
    "title": "حمدباری تعالیٰ",
    "description": "یاالٰہی مجھے میرے شر سے بچا\nمجھ کو ابلیس کے ہر اثر سے بچا\n\nاپنی رحمت کے سائے میں محفوظ رکھ\nفتنہ زن سے ، تعظیم زر سے بچا\n\nمجھ کو اپنی اطاعت کی توفیق دے\nدین و دنیا میں خوف و خطر سے بچا\n\nجس پہ چل کر خسارہ اٹھانا پڑے\nمجھ کو ایسی ہر اک رہگزر سے بچا\n\nدے توازن طبیعت کو ہر حال میں\nمجھ کو تاثیر ہر خشک و تر سے بچا\n\nبخش اپنی حضوری کا مولا شرف\nمجھ کو غفلت پہ مبنی خبر سے بچا\n\nجس میں پنہاں ہو تاثیر بغض و حسد\nمیری ہستی کو ایسی نظر سے بچا\n\nجس میں تیرے نبی ا  کی محبت نہ ہو\nہر مسلمان کو اس ڈگر سے بچا\n\nہم کو حفظ مراتب کی توفیق دے\nعیب جویانِ خیرالبشر سے بچا\n\nپھر سے نمرودیت ہے مرے سامنے\nمجھ کو فرعونِ حاضر کے شر سے بچا\n\nمجھ کو ذوق قناعت کی خیرات دے\nاپنے سائل کو غیروں کے در سے بچا\n\nکر دے سجدہ جو تیرے سوا اور کو\nمیرے تن کو سدا ایسے سر سے بچا\n\nجس میں تحسیں نہ ہو ، جسٍ میں تسکیں نہ ہو\nاس سفر سے بچا ، اس حضر سے بچا\n\nیا الٰہی مری روح کو پاک رکھ!\nمیرے باطن کو ہر شوروشر سے بچا\n\nبخش عصمت کا شہزادؔ کو سائباں\nہر گھڑی حب اموال و زر سے بچا"
  },
  {
    "id": 7,
    "title": "حمدباری تعالیٰ",
    "description": "میں نے کہا تو کون ہے؟ اس نے کہا ربّ جہاں\nمیں نے کہا کیا نام ہے؟ اس نے کہا شاہِ جہاں\n\nمیں نے کہا رحمت تری؟ اس نے کہا ہے بیکراں\nمیں نے کہا قدرت تری؟ اس نے کہا ہر دم عیاں\n\nمیں نے کہا کیا کام ہے؟ اس نے کہا جود و کرم\nمیں نے کہا کیا شان ہے؟ اس نے کہا فوق از گماں\n\nمیں نے کہا کیا لائوں میں؟ اس نے کہا بس عاجزی\nمیں نے کہا میں کیا کروں؟ اس نے کہا میرا بیاں\n\nمیں نے کہا تیرا پتہ؟ اس نے کہا قلب حزیں\nمیں نے کہا رخت سفر؟ اس نے کہا عزم جواں\n\nمیں نے کہا میں کیا بنوں؟ اس نے کہا بندہ مرا\nمیں نے کہا خدمت ہے کیا؟ اس نے کہا آہ و فغاں\n\nمیں نے کہا سائل ہوں میں؟ اس نے کہا کچھ مانگ لے\nمیں نے کہا تیری رضا؟ اس نے کہا دیدی ہے ہاں\n\nمیں نے کہا ذات نبی؟ اس نے کہا مقصود کل\nمیں نے کہا کعبہ ہے کیا؟ اس نے کہا میرا نشاں\n\nمیں نے کہا شہزادؔ کا؟ اس نے کہا سب ٹھیک ہے\nمیں نے کہا محشر کے دن؟ اس نے کہا دوں گا اماں"
  },
  {
    "id": 8,
    "title": "حمدباری تعالیٰ",
    "description": "سب سے افضل سب سے اعلیٰ تیرا نام\nسب سے بہتر سب سے بالا تیرا نام\n\nاول ، آخر ، ظاہر ، باطن تیری شان\nہر اونچے کی سوچ سے اونچا تیرا نام\n\nملتی ہے تسکیں اسی سے روحوں کو\nکتنا میٹھا ، کتنا پیارا تیرا نام\n\nشاہد ہے ہر ذرہ تیری قدرت پر\nلکھا ہے ہر چیز پہ مولا تیرا نام\n\nمیری ہر اک رگ میں کرنیں رقصاں ہیں\nجب سے صحن روح میں چمکا تیرا نام\n\nجب بھی شاخ نخلِ تمناّ خشک ہوئی\nآس کا بادل بن کر برسا تیرا نام\n\nجس کے دل کی آنکھ خدایا روشن ہے\nاس نے ہر سو روشن دیکھا تیرا نام\n\nاس دن سے اک کیف سا اس پر طاری ہے\nجس دن سے شہزادؔ نے جانا تیرا نام"
  },
  {
    "id": 9,
    "title": "حمدباری تعالیٰ",
    "description": "وہی مصور وہی ہے باری رضیت باللہ رضیت باللہ\nاسی کی حمد و ثنا ہے ساری رضیت باللہ رضیت باللہ\n\nوہی ہے خالق وہی ہے مالک وہ سب کا رب ہے وہ سب کا رازق\nاسی کا سکہ جہاں میں جاری رضیت باللہ رضیت باللہ\n\nوہی ہے معبود عالمیں کا وہی نگہباں ہے اس زمیں کا\nاسی کو لائق ہے تاجداری رضیت باللہ رضیت باللہ\n\nوہی تو مطلوب انبیاء ہے وہی تو مقصود اصفیا ہے\nاسی کی خاطر ہے اشکباری رضیت باللہ رضیت باللہ\n\nہیں اس کے قبضے میں سب خزانے اسی کے دریوزہ گر زمانے\nوہی تو کرتا ہے چارہ کاری رضیت باللہ رضیت باللہ\n\nخدائے جن و بشر وہی ہے حقیقتاً مقتدر وہی ہے\nاسی کے نوری اسی کے ناری رضیت باللہ رضیت باللہ\n\nرحیم ہے وہ کریم ہے وہ عظیم تر سے عظیم ہے وہ\nوہی مٹائے گا بے قراری رضیت باللہ رضیت باللہ\n\nچمن میں بلبل کا چہچہانا ، سحر کو غنچوں کا کھلکھلانا\nاسی نے دی گل کو طرح داری رضیت باللہ رضیت باللہ\n\nاسی سے شہزادؔ ہے محبت اسی کی کرتے ہیں ہم عبادت\nاسی کا دل پر ہے خوف طاری رضیت باللہ رضیت باللہ"
  },
  {
    "id": 10,
    "title": "حمدباری تعالیٰ",
    "description": "یوں تو کرتے ہیں فرشتے بھی عبادت تیری\nآئی انسان کے حصے میں نیابت تیری\n\nتیرا آغاز بھی اب تک نہ کوئی جان سکا\nکون جانے کہ کہاں تک ہے نہایت تیری\n\nانبیاء ہی نے کرایا ہے تعارف تیرا\nانبیاء ہی نے بیاں کی ہے روایت تیری\n\nہو سکا ارض و سما سے نہ تحمل جس کا\nآخر انساں نے سنبھالی ہے امانت تیری\n\nمست رکھتا ہے سمندر کو تصور تیرا\nکوہ کو وجد میں لاتی ہے حکایت تیری\n\nچاند ، تارے ہیں ترے حسن کا مظہر مولا!\nلالہ و گل سے نمایاں ہے نفاست تیری\n\nتیری تسبیح کے خوگر ہیں پرندے سارے\nپتے پتے سے عیاں ہوتی ہے عظمت تیری\n\nقلب کی آنکھ کھلی ہو تو پتہ چلتا ہے\nتیرا عرفان ہے کیا ، کیا ہے حقیقت تیری\n\nاپنی تسخیر کی کوشش میں لگا ہے کب سے\nچاہتا ہے ترا شہزادؔ حمایت تیری"
  },
  {
    "id": 11,
    "title": "حمدباری تعالیٰ",
    "description": "میں اپنے دل میں تیرے ذکر کی محفل سجاتا ہوں\nمرے مالک! میں تیری یاد میں تسکین پاتا ہوں\n\nمراقب ہو کے تیرے قرب کی لذت اٹھاتا ہوں\nمیں رنگ و نور کے چشموں میں اس صورت نہاتا ہوں\n\nکبھی میں اَنْفسُ و آفاق میں چکر لگاتا ہوں\nکبھی عرش معلی سے بھی آگے گھوم آتا ہوں\n\nحواس خمسۂ باطن میں تیرا شوق بڑھتا ہے\nتری تسبیح کے نغمات جب میں گنگناتا ہوں\n\nتخیل رابطہ کرتا ہے جب اصل لطائف سے\nبڑی مشکل سے اپنے آپ میں اس دم سماتا ہوں\n\nترے فیضان سے ہیں قلب ، روح و سر ، خفی روشن\nترے لطف و کرم کی روشنی سے جگمگاتا ہوں\n\nبہ فیضِ اسم احمد کوئی دم ایسا بھی ہوتا ہے\nمیں اپنی روح کو سرکار کے روضے پہ پاتا ہوں\n\nدرود پاک جب پڑھتا ہوں میں کامل حضوری سے\nکبھی بطحا میں ہوتا ہوں کبھی طیبہ کو جاتا ہوں\n\nخیال آتا ہے اے شہزادؔ جب اعمال نامے کا\nندامت سے خدا کے سامنے سر کو جھکاتا ہوں"
  },
  {
    "id": 12,
    "title": "حمدباری تعالیٰ",
    "description": "یاالٰہی بے کسوں کا آسرا تو ہی تو ہے\nسربلندی کی حدوں کا منتہا تو ہی تو ہے\n\nتیرے حسن خلق کا مظہر ہیں یہ شمس و قمر\nجس کی ہر تخلیق ٹھہری دلربا تو ہی تو ہے\n\nمیرے دل کے وسوسے بھی تجھ سے پوشیدہ نہیں\nمجھ سے بڑھ کر ہے جسے میرا پتا تو ہی تو ہے\n\nتیری جانب ہے توجہ جسم و جان و روح کی\nمیرے مولا! مرجع حرف دعا تو ہی تو ہے\n\nتیرے اوصاف و محاسن کا بیاں ممکن نہیں\nمیری ہر حمد و ثنا سے ماورا تو ہی تو ہے\n\nبن گیا شہزادؔ تیرے لطف سے عبدالنبی\nجس کے بندے ہیں نبی وہ ذوالعُلا تو ہی تو ہے"
  },
  {
    "id": 13,
    "title": "حمدباری تعالیٰ",
    "description": "ہے عالم کا روزی رساں میرا اللہ\nہے خلاّق و ربِّ جہاں میرا اللہ\n\nورائے حدِ ہر گماں میرا اللہ\nعیاں میرا اللہ نہاں میرا اللہ\n\nکہاں ہے وہ لیکن ، کہاں وہ نہیں ہے\nیہاں میرا اللہ وہاں میرا اللہ\n\nتصرّف ہے دارین میں اس کا جاری\nہے مقصود ہر انس و جاں میرا اللہ\n\nکھلا کر دلوں میں معارف کے غنچے\nسجاتا ہے گلزار جاں میرا اللہ\n\nمیں کیا اس کی شہزادؔ توصیف لکھوں\nکہاں میں ضعیف اور کہاں میرا اللہ"
  },
  {
    "id": 14,
    "title": "حمدباری تعالیٰ",
    "description": "ابتدا تو ہے انتہا ہے تو\nاے کہ خلاّق دوسرا ہے تو\n\nسجدہ کرتے ہیں انبیاء تجھ کو\nاے کہ معبود مصطفی ہے تو\n\nمصدر لطف ، بارگاہ تیری\nمرجع آہ نارسا ہے تو\n\nراحت قلب و جاں ہے ذکر ترا\nمنبع رحمت و عطا ہے تو\n\nاے غنی! مغنی ، اجود الاجواد\nاپنے ہر وصف میں جدا ہے تو\n\nبخش میرے گناہ اے غفار!\nغافر الذنب والخطا ہے تو\n\nتیرا ہر چیز پر تصرف ہے\nکیوں کہ ہر چیز کا خدا ہے تو\n\nکیوں نہ شہزادؔ تیری حمد لکھے\nخالق حسن والضحیٰ ہے تو"
  },
  {
    "id": 15,
    "title": "حمدباری تعالیٰ",
    "description": "راحت افزا عجب ہے ذکر ترا\nمغفرت کا سبب ہے ذکر ترا\n\nزینتِ نطق ، تیرا اسم عظیم\nوجہِ تحریک لب ہے ذکر ترا\n\nوقت کے ہاتھ میں تری تسبیح\nگردش روز و شب ہے ذکر ترا\n\nبندگی ، حلم ، آگہی ، ایثار\nدیکھا جائے تو سب ہے ذکر ترا\n\nبے بسی کی سیاہ راتوں میں\nروشنی کا سبب ہے ذکر ترا\n\nجس کا احصا کرے زبانِ بشر\nاتنا محدود کب ہے ذکر ترا\n\nتیرے ارشاد سے ہوا معلوم\nذکر شاہ عرب ہے ذکر ترا\n\nجس کو نسبت ہے تیرے پیاروں سے\nاس زمیں کا ادب ہے ذکر ترا\n\nفکرِ شہزادؔ کے لیے لاریب\nباعثِ تاب و تب ہے ذکر ترا"
  },
  {
    "id": 16,
    "title": "حمدباری تعالیٰ",
    "description": "اے رحیم و کریم اے ستار\nتو نے بخشا ہے آدمی کو وقار\n\nفضل درکار ہے گناہوں کو\nاے حلیم و وکیل اے غفار\n\nبات بنتی ہے تیری رحمت سے\nاے شہید و حمید اے مختار\n\nبھر دے مولا ثناء کے پھولوں سے\nمیرے فکر و شعور کا گلزار\n\nآسمان و زمیں یہ شمس و قمر\nتیری صنعت گری کا ہیں اظہار\n\nسج کے آئے رخ رسالت پر\nتیری توحید کے حسیں انوار\n\nتیری تسبیح مجھ سے ہو نہ سکی\nہے مرے لب پہ عجز کا اقرار\n\nجو ہوا مجھ سے میں نے کر دیکھا\nمیرے حالات کو اب آپ سنوار\n\nنفس کے شر سے مجھ کو رکھ محفوظ\nبھوت خواہش کا میرے سر سے اتار\n\nحمد شہزادؔ سے ہو کیا تیری\nتو ہے بے عیب اور میں بے کار"
  },
  {
    "id": 17,
    "title": "مناجات",
    "description": "فضائے فکر پر چھایا ہوا غبار اتار\nریاض جاں میں مرے رب نئی بہار اتار\n\nاجال کعبۂ دل کے خلافِ کہنہ کو\nدیار سرورِ عالم میں ایک بار اتار\n\nنجات بخش مجھے غیر کے تعلق سے\nبہت ضعیف ہوں سر سے مرے یہ بار اتار\n\nجو تیرے حکم کو نافذ کرے زمانے میں\nفلک سے فرش پر اب تو وہ شہسوار اتار\n\nنکال میرے رگ و پے سے خواہشات کا میل\nانانیت کا مری آنکھ سے خمار اتار\n\nستیزہ کار ہے ہر موج میری کشتی سے\nحیات و موت کے مالک اسے بھی پار اتار\n\nنئے خیال کی شہزادؔ کو بشارت دے\nدل حزیں پہ کوئی حرف خوشگوار اتار"
  },
  {
    "id": 18,
    "title": "نعت شریف",
    "description": "سرور دیں کی گدائی واہ وا\nشہر طیبہ تک رسائی واہ وا\n\nاللہ اللہ خوش نصیبی کا عروج\nرات دن مدحت سرائی واہ وا\n\nسرور کونین کے اعزاز میں\nدست بستہ ہے خدائی واہ وا\n\nروشنی میں ڈھل گئی ہیں ظلمتیں\nاے ظہور مصطفائی! واہ وا\n\nاہل محشر دیکھ کر حیران ہیں\nہم غلاموں کی رہائی واہ وا\n\nلب پہ آنا تھا درود پاک کا\nہو گئی دل کی صفائی واہ وا\n\nپیر کامل کی خدایا خیر ہو\nمے ہمیں ایسی پلائی واہ وا\n\nترجمہ شہزادؔ اشکوں نے کیا\nنعت آنکھوں نے سنائی واہ وا"
  },
  {
    "id": 19,
    "title": "نعت شریف",
    "description": "نعت سرکار کہاں اور کہاں میں بیکار\nشعر گوئی ہے مری ان کے کرم کا اظہار\n\nزیب دیتی ہے جہاں بانی انہیں قوموں کو\nآپ جیسا ہو جن اقوام کا میر و سردار\n\nجب سے دیکھا ہے وہ خورشیدِ نبوّت میں نے\nتب سے رہتا ہے مرا بخت ہمیشہ بیدار\n\nکاش آ جائے میسر وہ شفا بخش فضا\nجس میں پاتے ہیں سکوں سارے جہاں کے بیمار\n\nآپ کے لطف و عطا ، جود و سخا نے توڑی\nنفرت و جبر جفا ، جور و ستم کی دیوار\n\nاور جچتا ہی نہیں کوئی قسم سے اس کو\nکوئی کر لیتا ہے جب آپ کے رخ کا دیدار\n\nچاند ہے آپ کا خادم تو ہے خورشید غلام\nآپ کے حکم پہ چلتے ہیں جبال و اشجار\n\nاب تو موصول حضوری کا ہو پیغام مجھے\nاب تو مل جائے مجھے کوئی بشارت سرکار\n\nاپنے شہزادؔ کے حالات پہ بھی ایک نظر\nفرش تا عرش کیا آپ کو حق نے مختار"
  },
  {
    "id": 20,
    "title": "نعت شریف",
    "description": "یوں تازگی روح کا سامان کریں گے\nہر سانس کو آقا کا ثنا خوان کریں گے\n\nجوڑیں گے مدینے کی ہوائوں سے تعلق\nافکار کے جنگل کو گلستان کریں گے\n\nکروا کے اسے گنبد خضریٰ کا نظارہ\nہم نفس منافق کو مسلمان کریں گے\n\nکیا کیا نہ عطا ہوگا فقیروں کو وہاں سے\nدربار میں جب مدحت سلطان کریں گے\n\nلٹکیں گی یونہی سر پہ ہمارے یہ صلیبیں\nجب تک نہ قبول آپ کا فرمان کریں گے\n\nپھوٹیں گی ہر اک شعر سے تاثیر کی کرنیں\nہم نعت کو جب تابع قرآن کریں گے\n\nمحشر میں پڑھے جائیں گے سرکار کی نعتیں\nیوں مرحلہ خلد کو آسان کریں گے\n\nہر ذہن کو ہم دیں گے مدینے کا تصوّر\nہر قلب کو ہم صاحب عرفان کریں گے\n\nجس ذات سے شہزادؔ ہے ہر چیز سلامت\nاس ذات پہ ہر چیز کو قربان کریں گے"
  },
  {
    "id": 21,
    "title": "نعت شریف",
    "description": "دیار باطن کے طاقچوں میں دیے ثناء کے جلائے رکھنا\nادب سے پلکوں پہ آنسوئوں کے حسین موتی سجائے رکھنا\n\nاگر نہ ان کے ادب کا دامن ہمارے دست نیاز میں ہو\nعبث ہے صوم و صلوٰۃ کے پھر پہاڑ سر پر اٹھائے رکھنا\n\nاگر نہ کشت یقیں پہ برسیں سحاب لطف نبی کی بوندیں\nتو بے اثر ہے ریاضتوں کی چتا میں خود کو بٹھائے رکھنا\n\nحروف نعت نبی کی قوت کا ایک ادنیٰ مظاہرہ ہے\nہمارا نوک قلم چبھو کر ضمیر شب کو جگائے رکھنا\n\nلگائو یادِ نبی کے پودے دل و نظر کی کیاریوں میں\nجو چاہتے ہو عقیدتوں کا چمن ہمیشہ کھلائے رکھنا\n\nعلاج امراض روح و جاں کا ہے ذکر صل علیٰ میں پنہاں\nجو چاہتے ہو سکوں کی دولت اسی میں دل کو لگائے رکھنا\n\nیہی ہے ایمان کا تقاضا ، اسی میں ذات خدا ہے راضی\nجبیں عجز و نیاز شہزادؔ ان کے در پر جھکائے رکھنا"
  },
  {
    "id": 22,
    "title": "نعت شریف",
    "description": "جو تیری یاد میں گزرے وہی لمحہ مؤثر ہے\nکہ اس لمحے کی خوشبو سے مشام جاں معطر ہے\n\nپرونا فکر کی تسبیح میں موتی درودوں کے\nیہی ہے حاصل ہستی یہی میرا مقدر ہے\n\nجناب سرورِ کونین کی چوکھٹ پہ وہ دیکھو!\nگزارش لے کے پلکوں پر کھڑا کوئی سخنور ہے\n\nکوئی سلطان پھر کیسے جچے اس کی نگاہوں میں\nدرِ سرکار کا سائل تو خود رشک سکندر ہے\n\nنظر سرکار کی سیرت کے ہر پہلو پہ ہو جس کی\nوہی مرشد وہی رہبر وہی حاکم مؤقر ہے\n\nپہنچتی ہے کمک ہر دم مجھے شہر مدینہ سے\nمرے آگے اسی خاطر مری ہستی مسخر ہے\n\nشہ کونین کے لطف و کرم پر ہے مدار اس کا\nحقیقت آشنا جس نور سے میرا تصور ہے\n\nخدا کے فضل سے تحریک ہے میرے لطائف میں\nنگاہِ مرشد کامل سے میرا دل منور ہے\n\nعجب فیضان ہے شہزادؔ نعت سرورِ دیں کا\nپریشانی کے اندر بھی مجھے تسکیں میسر ہے"
  },
  {
    "id": 23,
    "title": "نعت شریف",
    "description": "یہ ہے ایماں کہ ہیں بعد خدا خیرالبشر افضل\nخدا جانے مقام مصطفی ہے کس قدر افضل\n\nلگے سرکار کے قدموں سے جو ذرّے جواہر ہیں\nانہیں کے فیض نسبت سے ہوئے سنگ و شجر افضل\n\nفضیلت ہے معانی آشنا ان کی ادائوں سے\nہر اک پہلو ہے ان کی زندگی کا سربسر افضل\n\nہدایت بخش سب انداز ہیں شاہ مدینہ کے\nہے ان کا ہر عمل افضل ، سفر افضل ، حضر افضل\n\nنقوش پا انہیں کے خضر کا رستہ دکھاتے ہیں\nانہیں کا راستہ سیدھا ، انہیں کی رہگزر افضل\n\nخدا کا ذکر ہو جس میں ، نبی کی نعت ہو جس میں\nنہ کیوں وہ شام ہو پیاری ، نہ کیوں ہو وہ سحر افضل\n\nپرکھ لو بات یہ بے شک شریعت کی کسوٹی پر\nہے بیت اللہ سے میرے نبی کا مستقر افضل\n\nمرا آغاز اور انجام ہے شہزادؔ نعت ان کی\nہوا ہے کام اک مجھ سے یہی مقدور بھر افضل"
  },
  {
    "id": 24,
    "title": "نعت شریف",
    "description": "دل سے حمد خدا نکلتی ہے\nساتھ ان کی ثناء نکلتی ہے\n\nجا پہنچتی ہے گوش رحمت میں\nقلب سے جو صدا نکلتی ہے\n\nاوڑھ کر بردئہ درود و سلام\nمیرے منہ سے دعا نکلتی ہے\n\nصبح سحری کے وقت طیبہ سے\nلے کے خوشبو صبا نکلتی ہے\n\nجنتی ہیں وہ جن کے ہونٹوں سے\nمدحت مصطفی نکلتی ہے\n\nغم مٹانے کو سبز گنبد سے\nاک تجلی جدا نکلتی ہے\n\nموت شہزادؔ ان کے زائر سے\nاپنا دامن بچا نکلتی ہے"
  },
  {
    "id": 25,
    "title": "نعت شریف",
    "description": "سہارا دے دیا بروقت ان کی غمگساری نے\nمجھے تو مار ڈالا تھا مری عصیاں شعاری نے\n\nضرورت ہے مجھے سرکار پھر تسکین و راحت کی\nبنایا قریہ جاں میں ٹھکانہ بے قراری نے\n\nکبھی ممکن نہیں تھا نخوت و ظلم و تشدد سے\nکیا جو کام سلطان حرم کی انکساری نے\n\nمجھے اعزاز دے وہ کاش اپنی میزبانی کا\nشرف بخشا ابوایوب کو جس کی سواری نے\n\nصحابہ ہوں رسول اللہ کے یا اولیاء اللہ\nنوازے ہیں انہیں یہ مرتبے خدمت گزاری نے\n\nخدا کے نور کی کرنیں اسی کے صحن میں چمکیں\nاگرچہ راستہ روکا بہت بوجہل ناری نے\n\nاثر ہے سارے عالم میں ہوائے شہر طیبہ کا\nچمن کو رنگ بخشے ہیں اسی بادِ بہاری نے\n\nہجوم رنج ہو شہزادؔ یا مجمع مصائب کا\nمجھے تنہا نہیں چھوڑا کبھی محبوب باری نے"
  },
  {
    "id": 26,
    "title": "نعت شریف",
    "description": "مدحِ نبی کرے جو فرشتہ سرشت ہو\nکہتا ہے نعت جس کا عقیدہ درست ہو\n\nفضلِ خدا و لطفِ نبی سے ہے کیا بعید\nبزمِ رسول پاک ہو ، ہم ہوں بہشت ہو\n\nدرپیش ہے حضور کی مدحت کا مرحلہ\nکیسے سمندِ فکر کی رفتار سست ہو\n\nنسبت ہو جس کو سرور عالم کی فوج سے\nاس کو کسی محاذ پہ کیسے شکست ہو\n\nدل میں خدا کی یاد ہو ، لب پہ نبی کا نام\nمیری ہر اک نشست بس ایسی نشست ہو\n\nکامل ہے ان کے عشق میں شہزادؔ اس قدر\nجتنا تو اتباع شریعت میں چست ہو"
  },
  {
    "id": 27,
    "title": "نعت شریف",
    "description": "عشق احمد خدا سے ملتا ہے\nرب نبی کی رضا سے ملتا ہے\n\nعلم و حکمت ، کمال فکر و شعور\nسب در مصطفی سے ملتا ہے\n\nباخدا جب کبھی سوال کریں\nان کے دست عطا سے ملتا ہے\n\nمانگنے کا اگر سلیقہ ہو\nفیض ان کے گدا سے ملتا ہے\n\nزائرو ! یوں حضور سے ملنا\nجیسے بندہ خدا سے ملتا ہے\n\nکتنے خوش بخت ہیں وہ لوگ جنہیں\nلطف ان کی ثنا سے ملتا ہے\n\nراہ عرفاں کے ہر مسافر کو\nفیض اس رہنما سے ملتا ہے\n\nہم سے شہزادؔ سب فقیروں کو\nشاہِ جود و سخا سے ملتا ہے"
  },
  {
    "id": 28,
    "title": "نعت شریف",
    "description": "موج رحمت حضور کا گریہ\nنور والا ہے نور کا گریہ\n\nبن گیا رہنمائے اہل کمال\nتاجدار شعور کا گریہ\n\nکھول دے گا جناں کے دروازے\nشاہِ یوم النشور کا گریہ\n\nشانِ خیرالوریٰ کا مظہر ہے\nارنی گوئے طور کا گریہ\n\nعاشقان نبی کو حاصل ہے\nکس نشاط و سرور کا گریہ\n\nبہر دید حضور ہے شہزادؔ\nجن و انسان و حور کا گریہ"
  },
  {
    "id": 29,
    "title": "نعت شریف",
    "description": "نبی کی غلامی مرے کام آئی\nمدینے سے چٹھی مرے نام آئی\n\nدرخشاں ہمیشہ سے ہے مہرفاراں\nنہیں اس کے اوپر کبھی شام آئی\n\nنئی نعت مکتوب طیبہ کی صورت\nحضوری کا بن کر ہے پیغام آئی\n\nیہ اعجاز ہے ذکر صل علیٰ کا\nمصیبت بھی اکثر مرے کام آئی\n\nتعال اللہ! خورشید توحید نکلا\nخوشا! صبح ترحیل اصنام آئی\n\nہر اک نعت شہزادؔ تسکیں بداماں\nدلاسہ بنے وقت آلام آئی"
  },
  {
    "id": 30,
    "title": "نعت شریف",
    "description": "دیار باطن کی ہر گلی میں رہیں ثناء کے چراغ روشن\nشعور نعت نبی کی کرنوں سے ہو مرا بھی دماغ روشن\n\nانہیں کی نسبت سے جنگلوں پر صدا بہاریں ہیں گلستاں کی\nانہیں کی برکت سے ہو گئے ہیں دلوں کے ٹوٹے ایاغ روشن\n\nملی ہیں کتنی حسیں ادائیں خدا سے محبوب دو جہاں کو\nکہ جن ادائوں کی یاد سے ہیں دلوں میں الفت کے داغ روشن\n\nوسیلہ عالم میں آیتوں کے فروغ کا کس کی ذات ٹھہری\nکیے خدا نے لبوں پہ کس کے حروفِ ا لاّالبلاغ روشن\n\nنجات کس کے کرم سے پائی دل قلندر نے ماسوا سے\nکیے ہیں کس نے شب ہوا میں اطاعتوں کے چراغ روشن\n\nتجھے بھی شہزادؔ مل ہی جائے گا نور آقا کی بارگہ سے\nکہ ہے عقابوں کی ہم نشینی کے فیض سے قلب زاغ روشن"
  },
  {
    "id": 31,
    "title": "نعت شریف",
    "description": "وہ بشر جس کے تصور سے قوی ایمان ہو\nکون ہے ان کے سوا جو بولتا قرآن ہو\n\nشام ہستی میں جلیں حسن عقیدت کے چراغ\nروشنی صبح جاں میں نعت کا فیضان ہو\n\nپھر عطا ہو جائیں قلب و جاں کو وہ سرشاریاں\nپھر مرے آقا حضوری کا کوئی سامان ہو\n\nیہ زمیں کیا آسمانوں میں بھی ہوں جس کے وزیر\nغیرممکن ہے کہ اب ایسا کوئی سلطان ہو\n\nزیب تن ان کے نہ ہو کیوں کر امامت کی قبا\nجن کا ہر ارشاد پاک اللہ کا فرمان ہو\n\nمظہر ذات و صفات حق تعالیٰ ہیں حضور\nکیوں نہ ان کے حسن سے ظاہر خدا کی شان ہو\n\nذکر اوصاف نبی شہزادؔ اکثر کیجیے\nشاید اس طرح سے کچھ شکرانہ احسان ہو"
  },
  {
    "id": 32,
    "title": "نعت شریف",
    "description": "ہے اپنی جگہ خوب عبادات کی لذت\nلیکن ہے جدا تیری ملاقات کی لذت\n\nملتا ہے عجب لطف ترے شہر کی حد میں\nمسحور کیے دیتی ہے حالات کی لذت\n\nجس رات کہ حاصل تھا ترے رخ کا نظارہ\nبھولی نہیں اب تک مجھے اس رات کی لذت\n\nروشن تری تقلید سے اعمال کا چہرہ\nتسکین فشاں تیرے خیالات کی لذت\n\nہے اوج پہ اس شخص کی قسمت کا ستارہ\nحاصل ہو جسے خدمت سادات کی لذت\n\nہو جاتا ہے اک کیف مری روح پہ طاری\nیاد آتی ہے جب تیرے مقالات کی لذت\n\nٹوٹا ترے ارشاد سے تفریق کا جادو\nبخشی تری سیرت نے مساوات کی لذت\n\nفتویٰ یہ ملا حضرت مالک کے عمل سے\nقرباں تیری دہلیز پہ عرفات کی لذت\n\nپاتا ہی نہیں نعت سے شہزادؔ فراغت\nچکھ لیتا کبھی ورنہ مناجات کی لذت"
  },
  {
    "id": 33,
    "title": "نعت شریف",
    "description": "تکتا ہے سوئے گنبد خضریٰ بچشم نم\nزائر جو چھوڑتا ہے مدینہ بچشم نم\n\nہوتی ہیں اس کی ذات پہ رحمت کی بارشیں\nدیکھے جو ایک بار وہ روضہ بچشم نم\n\nمقبول بارگاہ کو ہوتا ہے بس نصیب\nیادشہِ ہدی میں تڑپنا بچشم نم\n\nاہل نظر کو ارض مدینہ ہے کیوں عزیز\nجا کر وہاں یہ بات سمجھنا بچشم نم\n\nپوچھو تم اس سے روضۂ سرکار کا مقام\nدیکھا ہے جس نے خلد کا نقشہ بچشم نم\n\nپہنچے دیار قدس میں جتنے تھے خوش نصیب\nپیچھے رہا حضور میں تنہا بچشم نم\n\nارض حرم میں کاش میں باطن کی آنکھ سے\nدیکھوں تجلیات کی دنیا بچشم نم\n\nآقا! مجھے دکھائیے راہِ مدافعت\nدیتا ہوں اپنی ذات کا پہرہ بچشم نم\n\nٹھہروں گا اس دیار میں شہزادؔ کس طرح\nمیں نے ہزار بار یہ سوچا بچشم نم"
  },
  {
    "id": 34,
    "title": "نعت شریف",
    "description": "مطلع صبح عرب پر ہے سجا مہر منیر\nدینے آیا ہے اندھیروں کو ضیا مہر منیر\n\nابتدائے آفرنیش کا محرک اس کا نور\nہے کمالاتِ بشر کی انتہا مہر منیر\n\nضوفشاں ہے کائنات حسن میں اس کا جمال\nزینت کون و مکاں ، نور خدا مہر منیر\n\nآج تک جس سے منور ہے ضمیر کائنات\nروشنی کا وہ مکمل سلسلہ مہر منیر\n\nقاسم فیضان باری ، پیکر لطف و کرم\nرحمت حق ، منبع صدق و صفا مہر منیر\n\nبحر اسرار و معارف ، صاحب خلق عظیم\nکنز عرفاں ، مخزن جود و سخا مہر منیر\n\nروح عیسیٰ ، جان موسیٰ ، قرۃ العین خلیل\nفخر آدم ، مقتدائے انبیاء مہر منیر\n\nتیری کرنوں سے مزین جس کا طول و عرض ہو\nدے مجھے خیرات میں ایسی قبا مہر منیر\n\nتیری سیرت سے ملا ہے میری ہستی کو جواز\nکیسے ہوگا مجھ سے تیرا حق ادا مہر منیر\n\nروز محشر دوں گا میں شہزادؔ یوں ان کو صدا\nالمدد! اے شافع روز جزا مہر منیر"
  },
  {
    "id": 35,
    "title": "نعت شریف",
    "description": "ملے گی قلب کو تسکین زیر گنبد خضریٰ\nبہ فیض طہٰ و یٰسین زیر گنبد خضریٰ\n\nجہاں رنگ و بو محتاج ہے جس کے تصرّف کا\nہے ایسا صاحب تکوین زیر گنبد خضریٰ\n\nٹھکانہ آئو پہلے سے بنا لیں ہم وہاں اپنا\nسمٹ جائے گا آخر دین زیر گنبد خضریٰ\n\nکھڑا ہو کر کروں نذر نبی تحفہ تحیّت کا\nپڑھوں پھر بیٹھ کر یٰسین زیر گنبد خضریٰ\n\nمرے قلب و نظر میں نور کے فانوس ہوں روشن\nہو میری روح کی تزئین زیر گنبد خضریٰ\n\nعجب کیا ہے مدینے کی فضا مجھ کو میسر ہو\nلکھوں اس نعت کی تضمین زیرگنبد خضریٰ\n\nمقام اس سبز گنبد کا کوئی افلاک سے پوچھے\nخدا کے لاڈلے ہیں تین زیر گنبد خضریٰ\n\nاگر توفیق مل جائے مواجہ میں حضوری کی\nبجائوں ہچکیوں کی بین زیر گنبد خضریٰ\n\nمجھے خیرات دیں سرکار اسرار و معارف کی\nکریں ارشاد اور تلقین زیر گنبد خضریٰ\n\nسمندر رحمتوں کے جوش میں آ جایا کرتے ہیں\nصدا دے جب کوئی مسکین زیر گنبد خضریٰ\n\nدرود پاک ہو شہزادؔ ہو روضے کی جالی ہو\nدعا ہے سب کہو آمین زیرگنبد خضریٰ"
  },
  {
    "id": 36,
    "title": "نعت شریف",
    "description": "ہے وادیٔ بطحا کی فضا اور طرح کی\nچلتی ہے مدینہ میں ہوا اور طرح کی\n\nہر بات کہی جاتی ہے اشکوں کی زباں میں\nہوتی ہے مواجہ میں دعا اور طرح کی\n\nاے سائلو! یہ رحمت کونین کا در ہے\nہوتی ہے یہاں بھیک عطا اور طرح کی\n\nاے کاش ہو ایسی مرے افکار میں جدّت\nہر روز کروں مدح و ثناء اور طرح کی\n\nطاری ہے دل و جاں پہ عجب بسط کا عالم\nلائی ہے خبر بادِ صبا اور طرح کی\n\nجس شان سے چاہیں جسے سرکار نوازیں\nہر کعب کی خاطر ہے ردا اور طرح کی\n\nدیتا ہے سبق اشھد و اسھد کا تفاوت\nہوتی ہے مقرب کی خطا اور طرح کی\n\nنازک ہے مزاج اس کا بہت نظم و غزل سے\nہے نعت نبی صنف ذرا اور طرح کی\n\nشہزادؔ کو ہو جائے عطا رنگ اویسی\nعشاّق میں ہو میری وفا اور طرح کی"
  },
  {
    "id": 37,
    "title": "نعت شریف",
    "description": "کون کہتا ہے خدائی چاہے\nبس محمد کی گدائی چاہے\n\nسازو ساماں پاس ہے لیکن حضور!\nقافلے کو رہنمائی چاہیے\n\nاب تو کرتا ہے تقاضا نفس بھی\nقید خواہش سے رہائی چاہیے\n\nان کی عظمت کو سمجھنے کے لیے\nعزّ و شان کبریائی چاہیے\n\nآرزو ہے دیدئہ بے تاب کی\nپھر وہی جلوہ نمائی چاہیے\n\nقصر والوں سے غرض ہم کو نہیں\nشہر طیبہ تک رسائی چاہیے\n\nاے سراپا نور! اے ظلمت شکن\nقریہ جاں کو صفائی چاہیے\n\nکام جو شہزادؔ آئے حشر میں\nاب کوئی ایسی کمائی چاہیے"
  },
  {
    "id": 38,
    "title": "نعت شریف",
    "description": "سیرت و صورت مصطفی روشنی\nمیرے آقا کی ہے ہر ادا روشنی\n\nان کے الفاظ سورج سے رخشندہ تر\nگفتگو ، حرف ، لہجہ ، صدا روشنی\n\nظلمت دہر میں ہے ستارہ فشاں\nسرور دیں کی مدح و ثنا روشنی\n\nاک سمندر ہے کعبہ بھی انوار کا\nسبز گنبد کی ہے پر جدا روشنی\n\nچھٹ گئیں مطلع دہر سے ظلمتیں\nلے کے آئے رسول خدا روشنی\n\nدیکھ کر دنگ ہے عرش کی آنکھ بھی\nاوڑھ آئی کچھ ایسی قبا روشنی\n\nفیضیاب درشاہ لولاک ہیں\nچاند ، سورج ، ستارے ، صبا ، روشنی\n\nبارگاہ رسالت سے شہزادؔ کو\nہو رہی ہے مسلسل عطا روشنی"
  },
  {
    "id": 39,
    "title": "نعت شریف",
    "description": "پہنچا مرا درود جو ان کی جناب میں\nمجھ کو سلام عرش سے آیا جواب میں\n\nجب تک نہ ہو شریعت خیرالوریٰ کا فیض\nممکن نہیں تمیز گناہ و ثواب میں\n\nاب تو کوئی سبیل حضوری کی ہو حضور\nکب تک رہے گی جان مسلسل عذاب میں\n\nاشکوں نے کی بلال کے لہجے میں گفتگو\nصد شکر کامیاب رہا میں خطاب میں\n\nان کے سوا جہان میں ایسا نہیں کوئی\nجس نے کیا ہو قید سمندر حباب میں\n\nکیسے ثنائے سرور عالم کو چھوڑ دیں\nلازم یہ شق ہے عشق رسالت کے باب میں\n\nوالشمس ، والقمر کہیں وَالیل و والضحیٰ\nنعتیں لکھی ہوئی ہیں خدا کی کتاب میں\n\nاک بار اور کیجیے شہزادؔ پر کرم\nاک بار اور آئیے سرکار خواب میں"
  },
  {
    "id": 40,
    "title": "نعت شریف",
    "description": "بہار ہی پر نہیں ہے موقوف نعت خیرالوریٰ کا موسم\nہر اک مہینہ ہے ماہ مدحت ، ہر ایک موسم ثنا کا موسم\n\nرئوف ہیں وہ رحیم ہیں وہ حبیب رب کریم ہیں وہ\nوہ جب ہوں مائل بہ لطف سمجھو یہی ہے فضل خدا کا موسم\n\nوہ جن کے نقش قدم پہ چل کر ضمیر انسان مطمئن ہے\nرواں ہے کون و مکاں میں ان کے عمل سے رشد و ہدیٰ کا موسم\n\nملے اجازت تو میں بھی دیکھوں وہ سبز گنبد وہ نوری جالی\nعطا ہو فصل وصال آقا! ہو ختم آہ و بکا کا موسم\n\nانہیں کی دریوزہ گر ہیں صدیاں انہیں کے ادنیٰ گدا زمانے\nازل سے تابہ ابد ہے میرے نبی کے جود و سخا کا موسم\n\nابوالبشر تھے نہ ابن مریم مگر وہ جلوہ نما تھے پیہم\nرہا ہے گلزار کن فکاں میں انہیں کے عزّو علا کا موسم\n\nتو پھر ہے شہزادؔ کیسا خطرہ ریاض اعمال کو خزاں کا\nفضائے محشر میں جبکہ ہوگا شفاعت مصطفی کا موسم"
  },
  {
    "id": 41,
    "title": "نعت شریف",
    "description": "پائوں جو دل میں خواہش جاہ و حشم کو میں\nکرتا ہوں یاد آپ کے سنگ شکم کو میں\n\nرہتا ہے اس کی نوک پر اسم رسول پاک\nدیتا ہوں اس خیال سے بوسہ قلم کو میں\n\nپڑھتے ہوئے درود خدا کے حبیب پر\nجائوں گا اطمینان سے ملک عدم کو میں\n\nآتا ہے رشک سائل طیبہ کے بخت پر\nتکتا ہوں جب حضور کے جود و کرم کو میں\n\nاب تو مجھے نصیب ہو طرز عرب حضور!\nبیٹھا ہوں کب سے چھوڑ کر رسم عجم کو میں\n\nڈھل کر نیاز و عجز کے سانچے میں سرتاپا\nچوموں گا جا کے ایک دن ارض حرم کو میں\n\nکرتا ہوں اپنا قبلہ فکر و نظر درست\nمرکز بنا کر آپ کے نقش قدم کو میں"
  },
  {
    "id": 42,
    "title": "نعت شریف",
    "description": "ثانی مصطفی ہوا نہ کوئی\nآپ جیسا کہیں سنا نہ کوئی\n\nآپ آتے اگر نہ عالم میں\nحق سے ہوتا ہی آشنا نہ کوئی\n\nآپ کے بعد اے سراپا جمال\nخلق میں آپ سا ملا نہ کوئی\n\nاس نے کی آپ کے حقوق کی بات\nکر سکا جس کا حق ادا نہ کوئی\n\nپڑھ لیا جھوم کر درود و سلام\nاور مجھ سے ہوئی دعا نہ کوئی\n\nرہبری ان پہ ختم ہے شہزادؔ\nہو گا اب ان سا رہنما نہ کوئی"
  },
  {
    "id": 43,
    "title": "نعت شریف",
    "description": "کر رہا ہوں بیاں حضور کی شان\nالمدد! روح حضرت حسان\n\nآپ ہیں حسن انتخاب بصیر\nآپ جیسا نہیں کوئی انسان\n\nدل سے بے ساختہ نکلتا ہے\nمیرے آقا میں آپ پر قربان\n\nجو ملے ریگزار طیبہ میں\nہیں وہ ذرات نیلم و مرجان\n\nآپ کی پیروی کا نام ہے دیں\nآپ کی ذات سے وفا ایمان\n\nیا نبیe آپ کے سوا نہ جچا\nمسند دہر پر کوئی سلطان\n\nآپ کے لطف پر نظر تھی مری\nچل پڑا گھر سے بے سروسامان\n\nان کی تائید جبرئیل کریں\nمیریل تائید حضرت حسان\n\nاس میں شہزادؔ بس گیا ہے درُود\nقریہ جاں ہو کس طرح ویران"
  },
  {
    "id": 44,
    "title": "نعت شریف",
    "description": "حزن و آلام کو یوں دل سے مٹایا جائے\nذکر سرکار سنا اور سنایا جائے\n\nکرکے فانوس دل و جاں میں ثنا کے روشن\nبزم افکار و تخیل کو سجایا جائے\n\nسنت سرور کونین سے یہ درس ملا\nپہلا پھل آئے تو بچوں کو کھلایا جائے\n\nشافع حشر کو ہو گا یہ گوارا کیسے\nان کی امت کو جہنم میں جلایا جائے\n\nروح اس آس پہ قالب میں لیے پھرتا ہوں\nکاش مجھ کو بھی مدینے میں بلایا جائے\n\nذکر ہو صلِّ علیٰ صلِّ علیٰ کا جاری\nجس گھڑی میرے جنازے کو اٹھایا جائے\n\nآئیں آقا تو ادب سے میں کھڑا ہو پائوں\nاتنا اونچا مری تربت کو بنایا جائے\n\nعشق سرکار سکھانے کے لیے لازم ہے\nنفس کو لذّت بے جا سے بچایا جائے\n\nآئے آواز وہ جاتا ہے ثنا خوان رسول\nجب جہاں سے تیرا شہزادؔ خدایا جائے"
  },
  {
    "id": 45,
    "title": "نعت شریف",
    "description": "حصار حرص و ہوا سے نکل دلِ ناداں\nدیار سرور دوراں کو چل دلِ ناداں\n\nنیاز و عجز سے ملتا ہے اس ہنر میں کمال\nیہ راہ مدح نبی ہے سنبھل دلِ ناداں\n\nفغاں کو ڈھال کر اشکوں کے آبگینوں میں\nبنا دے کام زباں کا سہل دلِ ناداں\n\nخبر ہو گلشن طیبہ کی عندلیبوں کو\nریاض جاں میں کچھ ایسے مچل دلِ ناداں\n\nدرود و نعت ہی لے جا دَرِ حضور پہ ساتھ\nخراب و خام ہے فرد عمل دلِ ناداں\n\nتری نشست بھی ہوگی نبی کے حلقے میں\nذرا تو اپنی روش تو بدل دلِ ناداں\n\nمرا نصیب کہ ہے سامنے ریاض رسول\nہے آج ناظر حسن ازل ، دلِ ناداں\n\nاگر نصیب ہے شہزادؔ کا سا درد تجھے\nتو مانگ شہر نبی میں اجل دلِ ناداں"
  },
  {
    "id": 46,
    "title": "نعت شریف",
    "description": "چوکھٹ نبی کی چھوڑ کر جاتا کہاں کہاں\nان کا فقیر ٹھوکریں کھاتا کہاں کہاں\n\nجیسے بیاں حضور کی خدمت میں کر دیا\nایسے میں دل کا حال سناتا کہاں کہاں\n\nسلطان ملک فقر کی بیعت کیے بغیر\nحرص و ہوا کے ناز اٹھاتا کہاں کہاں\n\nہوتی اگر نہ آپ کی چوکھٹ اسے نصیب\nآنسو گناہگار بہاتا کہاں کہاں\n\nاچھا ہوا دیار سخاوت میں پڑ رہا\nپھر کر صدا فقیر لگاتا کہاں کہاں\n\nہوتا احد کی جنگ میں شہزادؔ گر شریک\nخود کو نہ ان کی ڈھال بناتا کہاں کہاں"
  },
  {
    "id": 47,
    "title": "نعت شریف",
    "description": "کہتا ہے جس کو آپ خدائے جہاں عظیم\nایسی ہے ذات سرورِ کون و مکاں عظیم\n\nہوتی اگر نہ عظمت خیرالبشر کی بات\nکوئی ذرا بتائیے ہوتا یہاں عظیم؟\n\nذات نبی ہے صورت و سیرت میں بے مثال\nان کی زباں کمال ہے ان کا بیاں عظیم\n\nاپنی مثال آپ ہے طیبہ کا سبزہ زار\nاپنی جگہ ہے جلوئہ باغ جناں عظیم\n\nشہزادؔ سوز قلب کا مظہر ہے چشم نم\nیونہی نہیں ہے نعمت اشک رواں عظیم"
  },
  {
    "id": 48,
    "title": "نعت شریف",
    "description": "کتنا کرم ہے مجھ پہ یہ ربِّ ودُود کا\nچشمہ رواں ہے وادیٔ جاں میں درود کا\n\nخیرالوریٰ نے اپنے نقوش قدم کے ساتھ\nنقشہ بنا دیا ہے ہماری حدُود کا\n\nمیرے نبی کے چہرئہ روشن کو دیکھ کر\nقائل ہوا جہان خدا کے وجود کا\n\nجب تک نہیں تھا آپ کی مدحت کا اہتمام\nطاری تھا قلب و روح پہ عالم جمود کا\n\nبیٹھا ہوا ہوں رحمت عالم کی اوٹ میں\nپیش نظر ہے واقعہ عاد و ثمود کا\n\nسیرت کی پیروی ہے سب امراض کا علاج\nبغض و حسد کا ہو وہ مرض یا نمود کا\n\nامت کے نام صاحب امت کا ہے پیام\nہرگز نہ اعتبار تم کرنا یہود کا\n\nان سے ہوا فروغ اطاعت جہان میں\nسیکھا ہے ان سے سب نے سلیقہ سجود کا\n\nشہزادؔ نقش پائے نبی پر چلے چلو!\nچاہو جو انکشاف وجود و شہود کا"
  },
  {
    "id": 49,
    "title": "نعت شریف",
    "description": "کھلا ہے باب آگہی انہیں کے التفات سے\nچھلک رہی ہیں حکمتیں انہیں کی بات بات سے\n\nعصائے عشق جب دیا انہوں نے دست عقل میں\nصدائے ’’الاحد‘‘ اٹھی ضمیر کائنات سے\n\nیہ نقش پائے مصطفی کی پیروی کا فیض ہے\nرہِ بقا ملی ہمیں جہانِ بے ثبات سے\n\nفضائے دہر گرد کذب سے کثیف جب ہوئی\nفروغ صدق کو ملا انہیں کی پاک ذات سے\n\nسکون بخش کیوں نہ ہوں فضائیں اس دیار کی\nسلام جس جگہ پہنچ رہے ہوں شش جہات سے\n\nجو دل جمال مصطفی کے عشق سے تہی رہا\nوہ بہرہ ور نہ ہو سکے گا لذت حیات سے\n\nوہی حبیب حق بھی ہے وہی قریب حق بھی ہے\nجسے ہو کوئی وصف عطا حضور کی صفات سے\n\nثنا کی مشعلیں جلا کے اپنے قلب و روح میں\nکشید کر رہا ہوں نور میں شب حیات سے"
  },
  {
    "id": 50,
    "title": "نعت شریف",
    "description": "آپ ہیں تاجدار ملک درود ، آپ کے واسطے سے صلوٰۃ و ثنا\nآپ ہی کے لیے وجود و شہود آپ کے واسطے صلوٰۃ و ثنا\n\nعرش والے بھی بھیجتے ہیں مدام آپ کی ذات پر درود و سلام\nآپ ممدوح عابد و معبود آپ کے واسطے صلوٰۃ و ثنا\n\nرحمتوں کا ظہور آپ سے ہے ، قلب و جاں کا سرور آپ سے ہے\nرونق افزائے مسند محمود آپ کے واسطے صلوٰۃ و ثنا\n\nمظہر والضحیٰ رخ انور ، ہر سخن حکمتوں کا ہے مصدر\nآپ سے ہے جمال حق کی نمود آپ کے واسطے صلوٰۃ و ثنا\n\nاہل احوال کا عروج و نزول ، اہل اقوال کا وصول و قبول\nآپ ہی کے طفیل ہے موجود ، آپ کے واسطے صلوٰۃ و ثنا\n\nدعویٰ لا اِلٰہ کی آپ دلیل ، آپ ہیں مقتدائے نوح و خلیل\nآپ ہیں شارح حدود و قیود ، آپ کے واسطے صلوٰۃ و ثنا\n\nآپ کی ذات بندگی کا جواز ، آپ کی پیروی کا نام نماز\nآپ ہیں باعث قیام و قعود ، آپ کے واسطے صلوٰۃ و ثنا\n\nآپ نے الفتوں کو عام کیا آپ نے جابروں کو رام کیا\nآپ سے ظلم کی حدیں مسدود ، آپ کے واسطے صلوٰۃ و ثنا\n\nکر چکا ہے یہ تجربہ شہزادؔ ، دافع رنج و غم ہے آپ کی یاد\nآپ کے ذکر سے ہے غم مفقود ، آپ کے واسطے صلوٰۃ و ثنا"
  },
  {
    "id": 51,
    "title": "نعت شریف",
    "description": "شہر نبی کا ہر اک گوشہ حسن سراپا خلد بداماں\nارضِ حرم کا قریہ قریہ حسن سراپا خلد بداماں\n\nجالب و جاذب اک اک منظر نور میں ڈوبے کنکر پتھر\nاز بطحا تا کوئے مدینہ حسن سراپا خلد بداماں\n\nچہرئہ صحرا روشن روشن موجہ خوشبو گلشن گلشن\nروضہ انور وادیٔ طیبہ حسن سراپا خلد بداماں\n\nان کے قدم کی برکت سے ہے ان کی نگاہ رحمت سے ہے\nملک عرب کا ہر اک رستہ حسن سراپا خلد بداماں\n\nفیض نبوّت جود رسالت ، مخزن عرفاں کان مرّوت\nلطف و کرم کا بہتا دریا حسن سراپا خلد بداماں\n\nہر ساعت ہے لطف سخی سے ہر دم فیض نعت نبی سے\nکشت تخیل ارض تمنا حسن سراپا خلد بداماں\n\nممکن ہے یہ ان کے کرم سے نور ہو جاری نوک قلم سے\nہو جائے شہزادؔ کی دنیا حسن سراپا خلد بداماں"
  },
  {
    "id": 52,
    "title": "نعت شریف",
    "description": "نبی کا ذکر دلوں کو نکھار دیتا ہے\nیہ ورد بگڑے ہوئوں کو سنوار دیتا ہے\n\nخیال سرور کونین اتر کے روحوں میں\nتغیرات کو درس قرار دیتا ہے\n\nدرود بیٹھ کر پڑھتا ہوں جب میں خلوت میں\nکوئی مجھے مرے اندر اتار دیتا ہے\n\nمیں جانتا ہوں یہ سرکار کا تصرّف ہے\nجو مشکلات سے مجھ کو گزار دیتا ہے\n\nمرے حضور کا شہزادؔ ہے یہ لطف و کرم\nجو دشت جاں کو پیام بہار دیتا ہے\n\nخدائے پاک غلامانِ سرور دیں کو\nزمیں سے تابہ فلک اقتدار دیتا ہے\n\nجو دل سے کرتے ہیں فرمان مصطفی e تسلیم\nخدا انہی کو جہاں میں وقار دیتا ہے\n\nہے جس کے سر پہ شفاعت کا تاج روز جزا\nصدا اس کو ہر عصیاں شعار دیتا ہے"
  },
  {
    "id": 53,
    "title": "نعت شریف",
    "description": "ہجوم دیکھ کے افلاک پر ستاروں کا\nخیال آتا ہے طیبہ کی رہگزاروں کا\n\nرہے گا یونہی تصرف ازل سے تابہ ابد\nنظام شمس و قمر میں ترے اشاروں کا\n\nشکوہ قیصر و کسریٰ نے ہاتھ باندھ لیے\nکمال دیکھ کے طیبہ کے ریگزاروں کا\n\nمنیٰ و کعبہ و میقات بھی حسیں ہیں مگر\nبدل نہیں ہے ترے شہر کے نظاروں کا\n\nشرف عطا ہو زیارت کا پھر حضور مجھے\nخرام میرے چمن میں بھی ہو بہاروں کا\n\nیہی دیار پیمبر کی پاک گلیاں ہیں\nگداگری جہاں شیوہ ہے تاجداروں کا\n\nازل سے ایک ہیں صدیق ، عمر ، علی ، عثمان\nکچھ اختلاف قسم سے نہیں ہے چاروں کا\n\nگروہ خلق میں شہزادؔ مرسلین کے بعد\nکوئی مثیل نہیں ہے نبی کے یاروں کا"
  },
  {
    "id": 54,
    "title": "نعت شریف",
    "description": "سید انس و جاں کا دروازہ\nہے ریاض جناں کا دروازہ\n\nقاسم گنج ہائے قدرت ہے\nرحمت دو جہاں کا دروازہ\n\nپاس جب تک نہ تھی کلید ثنا\nتھا مقفّل گماں کا دروازہ\n\nذات واحد کی سمت کھلتا ہے\nمصطفی کے مکاں کا دروازہ\n\nہر گھڑی مرجع خلائق ہے\nپادشاہ شہاں کا دروازہ\n\nبے کسوں کے لیے ہے جائے اماں\nمحسن امتاّں کا دروازہ\n\nرہ دکھاتا ہے پیشوائوں کو\nرہبر مرسلاں کا دروازہ\n\nکھل رہا ہے در حضور کی سمت\nسرور قدسیاں کا دروازہ\n\nہے بہت ہی قریب طیبہ سے\nساتویں آسماں کا دروازہ\n\nجونہی حرف ثنا نے دستک دی\nکھل گیا شہر جاں کا دروازہ\n\nباب رحمت ہے باخدا شہزادؔ\nاس شہ ہر زماں کا دروازہ"
  },
  {
    "id": 55,
    "title": "نعت شریف",
    "description": "رات دن مدحت مصطفی اور میں\nروشنی کا ہے اک سلسلہ اور میں\n\nعبد و معبود کا فرق اپنی جگہ\nان کے واصف ہیں دونوں خدا اور میں\n\nان کی باتوں میں رہتے ہیں باہم مگن\nصبح صادق کی ٹھنڈی ہوا اور میں\n\nکاش اک ساتھ پہنچیں در پاک پر\nمیرے آنسو ، حروف دعا اور میں\n\nپانی پانی ہوا ہوں میں یہ سوچ کر\nتاجدار جہاں کا گدا اور میں\n\nشہر طیبہ میں پہنچیں گے امید ہے\nہاتھ میں ہاتھ ڈالے صبا اور میں\n\nکعب و حسّاں پڑھیں نعت جب خلد میں\nساتھ ہوں ان کے احمد رضا اور میں\n\nایک جانب ہو شہزادؔ خلد نظر\nایک جانب صلوٰۃ و ثنا اور میں"
  },
  {
    "id": 56,
    "title": "نعت شریف",
    "description": "حق ثنا کا اگر کچھ ادا ہو گیا\nتم خدا کے تمہارا خدا ہو گیا\n\nجو گدائے درِ مصطفی ہو گیا\nوہ غم دو جہاں سے رہا ہو گیا\n\nیاد آئے نبی کی جسے دیکھ کر\nوہ سمجھ لو سراپا ثنا ہو گیا\n\nنعت دراصل اُس روز ہو گی کوئی\nقلب جس روز جامی نما ہو گیا\n\nجس کے ہاتھوں میں دامن ہے سرکار کا\nاہل عالم کا وہ مقتدا ہو گیا\n\nنعت گوئی کی صورت میں دیکھو ذرا\nمجھ کو کیسا خزینہ عطا ہو گیا\n\nجب سے ذرّے مدینہ کے ہیں آنکھ میں\nچاند تاروں سے میں ماورا ہو گیا\n\nرہنمائی کر اے خضر کے راہبر\nکارواں سے مسافر جدا ہو گیا\n\nاس کی عظمت پہ شہزادؔ قربان میں\nجان و دل سے جو ان پر فدا ہو گیا"
  },
  {
    "id": 57,
    "title": "نعت شریف",
    "description": "میں رہا منہمک عمر بھر نعت میں\nتب دکھائی دیا کچھ اثر نعت میں\n\nکیف مدحت جو پایا تو خواہش ہوئی\nکاش ہو عمر ساری بسر نعت میں\n\nروضۂ مصطفی سے جو ہے متصل\nایک ایسی بھی ہے رہگزر نعت میں\n\nجانے کیا کیا مناظر دکھائی دیئے\nمحو جس دم ہوئی چشم تر نعت میں\n\nنعت کرتی ہے دل کو سکوں آشنا\nہے درخشندہ نورِ نظر نعت میں\n\nپھوٹتی ہے کرن ایک اک حرف سے\nضوفشاں یوں ہیں شمس و قمر نعت میں\n\nگلشن جاں میں پھوٹے شگوفے کئی\nیوں چھڑا ذکر خیرالبشر نعت میں\n\nجب اترتے ہیں شہزادؔ مضموں نئے\nمحو رہتا ہوں شام و سحر نعت میں"
  },
  {
    "id": 58,
    "title": "نعت شریف",
    "description": "در پہ سائل نے دی ہے صدا یا نبی\nہو اسے حرف مدحت عطا یا نبی\n\nدست بستہ کھڑا ہے گدا یا نبی\nچاہتاہے شعورِ ثنا یا نبی\n\nجب زباں ترجمانی سے قاصر رہی\nمیں نے پلکوں پہ رکھ لی دُعا یا نبی\n\nچاہتے ہیں دو عالم خدا کو مگر\nآپ کو چاہتا ہے خدا یا نبی\n\nغیرممکن ہے اس پر ہو راضی خدا\nآپ ہوں جس بشر سے خفا یا نبی\n\nآپ کی ہے ہر اک بات وحی خدا\nآپ فرمائیں جو ہے بجا یا نبی\n\nبھیک وہ چاہتا ہے یہ دریوزہ گر\nجو ہو شایانِ شان سخا یا نبی\n\nجس میں ہو ذکر صلِّ علیٰ کی چمک\nحرف وہ ہے فرشتہ نما یا نبی\n\nقلب شہزادؔ کا زخم در زخم ہے\nچاہیے اس کو خاک شفا یا نبی"
  },
  {
    "id": 59,
    "title": "نعت شریف",
    "description": "جادئہ مدحت سرکار پہ چلنا چاہے\nایک جذبہ ہے جو الفاظ میں ڈھلنا چاہے\n\nروح حسّان میں تجھ سے ہوں مدد کا طالب\nمیرا انداز ثنا روپ بدلنا چاہیے\n\nہادیٔ دہر کے دامن سے رہے وابستہ\nعین طوفان میں جو شخص سنبھلنا چاہے\n\nقاسم خیر سے ہر آن تعلق رکھے\nنرغہ شر سے اگر کوئی نکلنا چاہے\n\nیاد آتی ہیں اسے جب وہ معطرّ گلیاں\nراہ طیبہ میں مرا قلب مچلنا چاہے\n\nبھیج دیتے ہیں کمک شاہِ مدینہ فوراً\nجب مجھے یورش آلام کچلنا چاہے\n\nباغباں سے کوئی نسبت نہیں شہزادؔ اسے\nتوڑ کر شاخ سے جو پھول مسلنا چاہے"
  },
  {
    "id": 60,
    "title": "نعت شریف",
    "description": "اپنے جذبات کو لفظوں میں بدلنا سیکھو\nجادئہ نعت پہ حسان سے چلنا سیکھو\n\nہو اگر اذن طلب ذوقِ بلالی مانگو\nآتش عشق میں اس طرز سے جلنا سیکھو\n\nروضہ شہ پہ کرو ریش سے جاروب کشی\nپیکر عجز میں سلمان سے ڈھلنا سیکھو\n\nطرز رفتار میں گر کوئی تغیرّ آ جائے\nرومیؔ و جامیؔ و سعدیؔ سے سنبھلنا سیکھو\n\nظلمت شب کو اجالوں میں بدلنے کے لیے\nشمع بزم ہدایت سے پگھلنا سیکھو\n\nسُنّت سرورِ دوراں سے تمسّک کرکے\nفتنۂ دہر کے نرغے سے نکلنا سیکھو\n\nجائو شہزادؔ مدینہ میں سوالی بن کر\nشہر الفت کی ہوائوں سے مچلنا سیکھو"
  },
  {
    "id": 61,
    "title": "نعت شریف",
    "description": "کام دیتے ہیں غریبوں کو حوالے تیرے\nکون سا منہ ہے نہیں جس میں نوالے تیرے\n\nرُوح اور جسم کے مابین تھے اس دم آدم\nبزم لولاک میں جس دم تھے اجالے تیرے\n\nتو جہاں چاہے اشارے سے بلائے ان کو\nچاند ، سورج کو کیا حق نے حوالے تیرے\n\nساتھ رہتی ہے تری یاد ہمیشہ میرے\nکام آتے ہیں مصیبت میں سنبھالے تیرے\n\nزندگی ان کے خمیروں میں رچی ہوتی ہے\nموت بھی آئے تو مرتے نہیں پالے تیرے\n\nمجھ گنہگار کی امید ہے بخشش ہو گی\nمیں نے جب حشر کے دن واسطے ڈالے تیرے\n\nان کی آنکھوں میں چھلکتی ہے ترے رخ کی ضیا\nحسن کو ناز ہے جن پر وہ ہیں کالے تیرے\n\nپیروی کرتا ہے جو تیرے نقوش پا کی\nیاد آتے ہیں اسے پائوں کے چھالے تیرے\n\nکعبؔ و حسانؔ کی قسمت پہ ہو شہزادؔ نثار\nجن کے شانوں پہ سجے پاک دوشالے تیرے"
  },
  {
    "id": 62,
    "title": "نعت شریف",
    "description": "ظلمت جاں کو اجالوں کا امیں کر ڈالا\nقلب کو ان کی تجلی نے حسیں کر ڈالا\n\nچشم سرکار جو صحرائوں کی جانب اُٹھی\nذرّہ ریگ کو تابندہ نگیں کر ڈالا\n\nمجھ تہی دست کو مدحت کا قرینہ دے کر\nدشت افکار کو پھولوں کی زمیں کر ڈالا\n\nنوچنے والوں کو ایثار کی عادت ڈالی\nخوگر جبر کو فرخندہ جبیں کر ڈالا\n\nآپ کا سیرت و کردار تھا آقا جس نے\nخوگر وہم کو سر تاپا یقیں کر ڈالا\n\nہادیٔ خلق نے کی راہنمائی ایسے\nماندئہ راہ کو منزل کے قریں کر ڈالا\n\nآپ نے پائے مبارک جو زمیں پر رکھا\nفرش کو ہمقدم عرش بریں کر ڈالا\n\nشافع حشر کی شہزادؔ عنایت دیکھو\nمجھ گنہگار کو جنت کا مکیں کر ڈالا"
  },
  {
    "id": 63,
    "title": "نعت شریف",
    "description": "تجلیات کو دل میں سمو کے آتا ہے\nجو شخص شہر مدینہ سے ہو کے آتا ہے\n\nعجب سرور سا ہوتا ہے اس کے چہرے پر\nجو بارگاہِ رسالت میں رو کے آتا ہے\n\nاسی پہ راز محبت کے فاش ہوتے ہیں\nجو آب اشک سے آنکھوں کو دھو کے آتا ہے\n\nسکون قلب کی نعمت اسی کو ملتی ہے\nجو اس دیار میں پلکیں بھگو کے آتا ہے\n\nثنا کے واسطے جب میں قلم اٹھاتا ہوں\nمرا خیال مدینے سے ہو کے آتا ہے\n\nوہ جس کے زیر تصرف ہیں عالمین تمام\nاسے قرار چٹائی پہ سو کے آتا ہے\n\nبیاں وہ شعر میں شہزادؔ ہو نہیں سکتا\nجو کیف یاد مدینہ میں کھو کے آتا ہے"
  },
  {
    "id": 64,
    "title": "نعت شریف",
    "description": "کون و مکاں پہ آپ کا جود و کرم محیط\nجیسے وجود حرف پہ نوک قلم محیط\n\nاس کی تجلیاّت سے عالم ہے مستنیر\nشمس و قمر پہ آپ کا نقش قدم محیط\n\nاس میں بسی ہے سرور کون و مکاں کی یاد\nکیسے ہوں میرے قلب پہ رنج و الم محیط\n\nقطرہ ہے اک حضور کے بحر علوم کا\nہیں جس کمالِ علم پر لوح و قلم محیط\n\nدرپیش ہے حضور کی مدحت کا مرحلہ\nکیوں کر ہو پھر بیان پہ طرز رقم محیط\n\nفرش زمیں پہ آپ ہیں عرش بریں پہ آپ\nدونوں جہاں پہ آپ کا نوری علم محیط\n\nشہزادؔ پیرویٔ رسالت سے یہ کھلا\nہوتے نہیں ہیں فقر پہ جاہ و حشم محیط"
  },
  {
    "id": 65,
    "title": "نعت شریف",
    "description": "خامہ ، حرف ، ورق سب روشن\nنور ثنا سے ہر شب روشن\n\nذکر خدا و یاد نبی سے\nمسجد روشن ، مکتب روشن\n\nہم پر اُن کے فیض سخن سے\nہے ہر بات کا مطلب روشن\n\nکھلتے ہیں لب ان کی ثنا میں\nہو جاتا ہے دل جب روشن\n\nان کو ضو دی مہر حرا نے\nورنہ تھے یہ دن کب روشن\n\nاکثر نور اسم نبی سے\nرہتے ہیں میرے لب روشن\n\nہر سو ہیں اسلام کی کرنیں\nکتنا ہے یہ مذہب روشن\n\nبجھتی نہیں شہزادؔ وہ مشعل\nجس کو کرتا ہے رب روشن"
  },
  {
    "id": 66,
    "title": "دعا، مناجات ، نعت",
    "description": "لائق حمد اے محمد ا کے خدا\nمجھ کو مدحت کا سلیقہ کر عطا\n\nیا الٰہی جب ثنا میں لب کھلیں\nلہجہ حساں ہو میرا رہنما\n\nہو عطا مجھ کو حضوری کا شرف\nخدمتِ شہ میں ہو حاضر یہ گدا\n\nمیں وہاں بن جائوں سر تاپا طلب\nجوش میں ہو اُن کا دریائے سخا\n\nنور سے بھر جائے کشکول نظر\nاس طرح سرکار ہوں جلوہ نما\n\nالغیاث! اے خالق لوح و قلم\nمانگتا ہوں تجھ سے توفیق ثناء\n\nساتھ میرے تائید جبریل ہو\nمرحلہ درپیش ہو جب نعت کا\n\nظلمت قلب و نظر کے واسطے\nنور کا ساماں ہے ذکر مصطفی\n\nمسکرائے گلستان نعت میں\nگُل کھلائے جو مری فکر رسا\n\nنعت زیبا ہے خدا کو آپ کی\nکہہ کے سب کچھ سب نے آخر یہ کہا\n\nاک طرف ہیں ان کے اوصاف جمیل\nاک طرف شہزادؔ مجھ سا بے نوا"
  },
  {
    "id": 67,
    "title": "نعت شریف",
    "description": "ہجر سرکار مدینہ نے رُلایا کیا کیا\nشعلہ آہ نے سینے کو جلایا کیا کیا\n\nفکر دنیا ، غم عقبٰی ، طلب جاہ و حشم\nعشق محبوب دو عالم نے بھلایا کیا کیا\n\nوادیٔ شوق و مرّوت اے حریمِ طیبہ!\nکیا بتائوں تیری یادوں نے ستایا کیا کیا\n\nشوق دیدار میں پلکوں پہ چراغاں کرکے\nچشم بے تاب نے راہوں کو سجایا کیا کیا\n\nسیل آلام نے جب مجھ کو ڈبونا چاہا\nحوصلہ اُن کی محبت نے بڑھایا کیا کیا\n\nعلم و عرفان و عمل حکمت و ایمان و نجات\nدیکھو آقا نے غلاموں کو دلایا کیا کیا\n\nصدق ، اخلاق ، یقیں ، عزم ، مساوات ، وفا\nہادیٔ خلق نے انساں کو سکھایا کیا کیا\n\nدے کے سرکار نے سائل کو ہنر کی ترغیب\nعزت نفس کو لٹنے سے بچایا کیا کیا\n\nگلشن جاں کو درودوں سے مزّین کرکے\nلطف اس حال میں شہزادؔ اٹھایا کیا کیا"
  },
  {
    "id": 68,
    "title": "نعت شریف",
    "description": "کشور جاں کے تاجدار حضور\nملک ایماں کے شہر یار حضور\n\nہر گھڑی گلشن مدینہ میں\nآپ سے موسم بہار حضور\n\nآپ ہی سے حجاز اقدس ہے\nمرجع موسم بہار حضور\n\nابر رحمت کا ڈال دیں چھینٹا\nرات دن دل ہے بے قرار حضور\n\nآپ کے در پہ نذر کرنے کو\nجان لایا ہے جاں نثار حضور\n\nایسے اترا درُود دل میں مرے\nہو گیا میں ثناء شعار حضور\n\nکام ہے آپ کی ثنا سے مجھے\nہے یہی میرا کاروبار حضور\n\nگلستاں ہے اگر مدینہ تو\nآپ ہیں موسم بہار حضور\n\nآپ خورشید ، یہ ستارے ہیں\nکیا کہوں شان چار یار حضور\n\nسوچتا ہوں کہ ہو نہ سوء ادب\nجب میں کہتا ہوں بار بار حضور\n\nپیرہن لطف کا عنایت ہو\nدامن جاں ہے تار تار حضور\n\nخود کو پاتا ہوں یوں اس امت میں\nجیسے گلشن میں کوئی خار حضور\n\nجن غلاموں سے آپ راضی ہیں\nان میں شہزادؔ ہو شمار حضور"
  },
  {
    "id": 69,
    "title": "نعت شریف",
    "description": "نعت کرتا ہوں جب میں رقم باوضو\nپھیل جاتی ہیں کرنیں مرے چار سُو\n\nایسے چمکے حروف ثناء لوح پر\nجیسے موتی ہوں فردوس کے ہوبہو\n\nاک تسلسل ہے یہ رفعت ذکر کا\nہو رہی ہے جو ان کی ثناء کو بہ کو\n\nکاش ہوتا حریم مدینہ میں ، میں\nگنبدِ سبز رہتا مرے روبرو\n\nآپ کہہ کر مخاطب کریں آپ کو\nان سے نسبت کے لائق نہیں لفظ تو\n\nہے حیات آفریں جس کی ساری فضا\nاس جہان محبت کی ہے آرزو\n\nکام لوں گا کہکشاں سے حرفوں کا میں\nرنگ لائے گی اک دن مری جستجو\n\nیہ تمنا ہے اک نعت ایسی بھی ہو\nجو پڑھی جائے سرکار کے رُوبرو\n\nگویا ذکر الٰہی میں مشغول ہے\nجس کے لب پر ہے سرکار کی گفتگو\n\nوادیٔ جاں میں شہزادؔ کوشش کرو\nہو رواں ان کے اوصاف کی آبجو"
  },
  {
    "id": 70,
    "title": "نعت شریف",
    "description": "اصل عرفان ہے آرزو آپ کی\nحسن ایمان ہے جستجو آپ کی\n\nذاکرین الٰہی میں شامل ہے وہ\nجس کے ہونٹوں پہ ہو گفتگو آپ کی\n\nہے شناور وہی بحر اسرار کا\nبات کرتا ہے جو باوضو آپ کی\n\nجس نے دیکھا جمال حسین و حسن\nاس نے دیکھی جھلک ہو بہو آپ کی\n\nآپ کے ذکر ہے غاسل روح و جاں\nبات ممکن نہیں بے وضو آپ کی\n\nخوش خصائل ہیں سب فیضیاب آپ سے\nمرجع حسن اخلاق خو آپ کی\n\nآپ مہر نبوت ہیں ماہِ حرم\nروشنی جلوہ گر کو بہ کو آپ کی\n\nہر زمانے کو سیراب کرتی رہی\nاز ازل تا ابد آبجو آپ کی\n\nکیوں نہ شہزادؔ کو انس ہو قبر سے\nہو گی صورت وہاں رُوبرو آپ کی"
  },
  {
    "id": 71,
    "title": "نعت شریف",
    "description": "اللہ نے کیا آپ کو قرآن کا حامل\nآیا نہ کوئی دہر میں اس شان کا حامل\n\nہونا تھا اسے آپ کے فیضان کا حامل\nیونہی تو نہیں جسم دل و جان کا حامل\n\nچاہے جو دل و جان سے محبوب خدا کو\nدراصل وہی شخص ہے ایمان کا حامل\n\nہے قریہ جاں آپ کی یادوں سے منور\nہر وقت ہے دل آپ کے احسان کا حامل\n\nامداد کا طالب ہے قلم آپ کے در سے\nآقا یہ مسافر نہیں سامان کا حامل\n\nہو سکتی ہیں سب مشکلیں حل عصر رواں کی\nہو جائے اگر آپ کے فرمان کا حامل\n\nشہزادؔ بھی وابستہ دامان نبی ہے\nشہزادؔ بھی ہے رحمتِ رحمن کا حامل"
  },
  {
    "id": 72,
    "title": "نعت شریف",
    "description": "تیرگی سے پر فضا کو روشنی درکار ہے\nہر زباں کو لذت ذکر نبی درکار ہے\n\nخودبخود چھٹ جائے گا اوہامِ باطل کا ہجوم\nاک مقام مصطفی سے آگہی درکار ہے\n\nآ چکا ہے ساری امت کی صفوں میں انتشار\nاس بھٹکتے قافلے کو رہبری درکار ہے\n\nپیرویٔ مصطفی ہے کامیابی کی دلیل\nکامیابی کے لیے ہم کو یہی درکار ہے\n\nطے کرا دیتی ہے پل میں شاہِ دیں کی اک نظر\nجس مسافت کے لیے پوری صدی درکار ہے\n\nبارگاہِ سرور کونین سے نسبت کے ساتھ\nاتباع سرورِ کونین بھی درکار ہے\n\nآنسوئوں میں بھیگ جائے چہرئہ حرف ثناء\nمیری آنکھوں کو مسلسل اک نمی درکار ہے\n\nمدحت سرکار میں اک شعر کہنے کے لیے\nطبعِ شاعر کو گلوں کی تازگی درکار ہے\n\nنعت کے میدان میں شہزاد ؔفن کے ساتھ ساتھ\nمدح گستر کو بہت سی عاجزی درکار ہے"
  },
  {
    "id": 73,
    "title": "نعت شریف",
    "description": "شہر طیبہ کے لالہ زار کی بات\nراحت افزا ہے اس دیار کی بات\n\nچھوڑ کر ذکر باغ طیبہ کا\nکون سنتا پھرے ، بہار کی بات\n\nوقت زحمت سکون دیتی ہے\nملک رحمت کے تاجدار کی بات\n\nآج تک گونجتی ہے خطبوں میں\nسادہ سے اونٹنی سوار کی بات\n\nہم غلامان مصطفی کے لیے\nگل سے بہتر ہے اُن کے خار کی بات\n\nراحت جاں ہے ذکر آل نبی\nفرحت دل ہے چار یار کی بات\n\nکس توجہ سے سن رہے ہیں حضور\nآج بھی ہر گناہگار کی بات\n\nعرض شہزادؔ کر نبی کے حضور\nباادب اپنے حال زار کی بات"
  },
  {
    "id": 74,
    "title": "نعت شریف",
    "description": "ہر سمت ہو گئے وا ایمان کے دریچے\nکھولے جو مصطفی نے قرآن کے دریچے\n\nروشن کبھی نہ ہوتیں علم و عمل کی راہیں\nکھلتے اگر نہ ان کے فیضان کے دریچے\n\nشاید کہیں چلی ہے باد ریاض طیبہ\nعنبر فشاں ہیں قصر عرفان کے دریچے\n\nرکھا قدم خلا میں جس جس جگہ نبی نے\nکھلتے گئے وہیں پر امکان کے دریچے\n\nکاشانہ نبوت کی سمت رخ ہے ان کا\nجتنے ہیں بارگاہِ رحمن کے دریچے\n\nصبح و مسا رواں ہے جن میں نسیم جنت\nکوئے رسول میں ہیں اس شان کے دریچے\n\nدنیا میں منفرد ہے شہزادؔ شہر طیبہ\nہر سو کھلے ہیں جس میں احسان کے دریچے"
  },
  {
    "id": 75,
    "title": "نعت شریف",
    "description": "فیض خیرالوریٰ ہے ازل تا ابد\nان کا جود و سخا ہے ازل تا ابد\n\nنورشمس الضحیٰ ہے ازل تا ابد\nحسن بدرالدّجی ہے ازل تا ابد\n\nہے ترانہ یہی ملک کونین کا\nذکر صل علیٰ ہے ازل تا ابد\n\nیاد احمد بھی ہے اس طرح دائمی\nجیسے ذکر خدا ہے ازل تا ابد\n\nرک سکی ہے نہ ہر گز رُکے گی کبھی\nمدحت مصطفی ہے ازل تا ابد\n\nانبیاء اولیاء اصفیاء کے لیے\nایک ہی مقتدا ہے ازل تا ابد\n\nہر زمانے کو بھیک ان کے در سے ملی\nباب رحمت کھلا ہے ازل تا ابد\n\nایک شہزادؔ ہے حمد رب مستقل\nایک ان کی ثناء ہے ازل تا ابد"
  },
  {
    "id": 76,
    "title": "نعت شریف",
    "description": "میرے آقا سراپا کمالات ہیں\nفرش تا عرش اُن کے فیوضات ہیں\n\nمعجزے جو ہوئے انبیاء کے لیے\nان کے خدّام کی وہ کرامات ہیں\n\nمصدر ہر سیادت بھی ہیں آپ ہی\nآپ ہی سیّد بزم سادات ہیں\n\nقاسم ارض جنت ہیں میرے نبی\nسلطنت ان کی ارض و سمٰوات ہیں\n\nذات باری ہے قید مکاں سے بری\nلامکاں تک انہیں کے مکانات ہیں\n\nخلد کے ہیں مناظر قبا تا احد\nکیا حسیں یہ زمیں پر مقامات ہیں\n\nکام دیتے ہیں ہر دور میں خضر کا\nان کے قدموں کے جتنے نشانات ہیں\n\nان کی مدحت پہ شہزادؔ ہیں مشتمل\nمصحف حق میں جتنے مقالات ہیں"
  },
  {
    "id": 77,
    "title": "نعت شریف",
    "description": "حسن اعمال کے بدلے میں جزا ملتی ہے\nخوش ہوں سرکار تو مولا کی رضا ملتی ہے\n\nبخشش و رحمت و انعام و کمالات کے ساتھ\nان کے دربار سے سائل کو صدا ملتی ہے\n\nدارالاخلاص ہے وہ شہر مدینہ جس میں\nخوگر جبر کو تعلیم وفا ملتی ہے\n\nکس طرح ہم سے ادا ہو حق مدحت ان کا\nجن کے در سے ہمیں توفیق ثناء ملتی ہے\n\nجب حد شہر مدینہ میں کوئی داخل ہو\nسب سے پہلے اسے جنت کی ہوا ملتی ہے\n\nسیرت سرور دوراں سے یہ معلوم ہوا\nجادئہ حق میں فنا ہو کے بقا ملتی ہے\n\nمنزل نعت پہ شہزادؔ پہنچتا ہے وہی\nجس کو منجانب حق فکرِ رسا ملتی ہے"
  },
  {
    "id": 78,
    "title": "نعت شریف",
    "description": "منصب مدح نبی مجھ کو بہم ہو جائے\nآشنا لوح عقیدت سے قلم ہو جائے\n\nاسم سرکار اگر دل پہ رقم ہو جائے\nعارف ذات الٰہی یہ صنم ہو جائے\n\nقابل رحم ہے بوسنیا و کشمیر کا حال\nاک نظر شاہ عرب! سوئے عجم ہو جائے\n\nباب رحمت سے عطا ہو مجھے خیرات حضور!\nمیری حالت بھی شناسائے کرم ہو جائے\n\nباغ امت میں کھلیں پھول طرب کے آقا!\nختم اسلام کا اب دور الم ہو جائے\n\nیہ تمنا ہے مدینہ کے گلی کوچوں میں\nسر زمیں بوس ہو ایسا کہ قدم ہو جائے\n\nروح شہزادؔ رہے محو ثناء میں ہر دم\nبت کدہ میرے خیالوں کا حرم ہو جائے"
  },
  {
    "id": 79,
    "title": "نعت شریف",
    "description": "دل و نظر سے غبار اترا تو میں نے دیکھا\nفلک سے اک ذی وقار اترا تو میں نے دیکھا\n\nخیال طیبہ میں ، میں جو ڈوبا تو پہنچا چودہ سو سال پیچھے\nقبا میں اک طرح دار اترا تو میں نے دیکھا\n\nحریم وحدت میں جل رہا ہے چراغ نور محمدی کا\nمئے انا کا خمار اترا تو میں نے دیکھا\n\nفضائے یثرب سے نقش طیبہ ابھر رہا ہے\nزمیں پہ قصویٰ سوار اترا تو میں نے دیکھا\n\nثبات شہزادؔ ہے تو ہے شہر مصطفی میں\nمیں بحر خواہش کے پار اترا تو میں نے دیکھا"
  },
  {
    "id": 80,
    "title": "نعت شریف",
    "description": "یاد طیبہ کی ہوا سے باب چشم تر کھلا\nوقت مدحتِ صحن جاں میں رحمتوں کا در کھلا\n\nپھیل جائے گی مہک ذکر نبی کی چار سُو\nروز محشر جب مرے اعمال کا دفتر کھلا\n\nجب کیا میں نے ارادہ مدحت سرکار کا\nسائبانی کے لیے جبریل کا شہپر کھلا\n\nہم کہ آب زر سمجھتے تھے سراب ریگ کو\nجب حضور آئے تو ہم پر فرق خیر و شر کھلا\n\nجانے کب آ جائے طیبہ کا مہاجر لوٹ کر\nرات دن یونہی نہیں رہتا خدا کا گھر کھلا\n\nنقش طیبہ ہو گیا قرطاس جاں پر مرتسم\nیوں مرے وجدان پر فردوس کا منظر کھلا\n\nعقل جب شہزادؔ عشق مصطفی میں ڈھل گئی\nآدمی پر عقدئہ اسرار بحر و بر کھلا"
  },
  {
    "id": 81,
    "title": "نعت شریف",
    "description": "رسم و رواج دہر کی حد سے نکل کے آ\nیہ روضہ حضور ہے زائر سنبھل کے آ\n\nآہستہ سانس لے کہ دیار ادب ہے یہ\nخوش ہوں حضور ایسے توازن سے چل کے آ\n\nہونا ہے پیش تجھ کو پیمبر کے روبرو\nاے سوز احتیاط سے اشکوں میں ڈھل کے آ\n\nاے دل اگر ہے قربت خیرالوریٰ کا شوق\nحرص ہو ہوا و کبر کی عادت بدل کے آ\n\nچاہے اگر ہو شعر میں شہزادؔ کچھ اثر\nعشق نبی کی آگ میں تو بھی پگھل کے آ"
  },
  {
    "id": 82,
    "title": "نعت شریف",
    "description": "کیجیے میرے حق میں دعا یا نبی\nنعت پر ہو مرا خاتمہ یانبی\n\nرک نہ جائے درآمد مضامین کی\nہو نہ جائے قلم بے وفا یا نبی\n\nہاتھ میں لے کے کشکول کم مائیگی\nخیر کا منتظر ہے گدا یا نبی\n\nایسا لگتا ہے کوہِ صفا آج تک\nدے رہا ہے کسی کو صدا یا نبی\n\nآپ کے لطف سے گلشن قلب میں\nچل رہی ہے سکوں کی ہوا یا نبی\n\nدیکھا جائے نگاہ حقیقت سے گر\nمنتشر ہے حرم کی فضا یا نبی\n\nایک شہر مدینہ کے سلطان کیا\nآپ تو ہیں شہ دوسرا یا نبی\n\nجس کا ایک ایک مضمون ہو منفرد\nچاہتا ہوں وہ طرز ثناء یا نبی\n\nآپ کے در سے اشعار توصیف کی\nبھیک لیتی ہے فکر رسا یا نبی\n\nداد دے روحِ حسان جس پر مجھے\nشعر ایسا ہو کوئی عطا یا نبی\n\nکیا لکھے نعت شہزادؔ سا بے ہنر\nمیں کہاں مرتبہ یہ کجا یا نبی"
  },
  {
    "id": 83,
    "title": "نعت شریف",
    "description": "سرکار یہ گدا کا نہ گمان ہے نہ دعویٰ\nمجھے آپ کی ثناء کا نہ گمان ہے نہ دعویٰ\n\nمیں غلام آپ کا ہوں مجھے ہے یہ فخر کافی\nخود بینی و ریاکا نہ گمان ہے نہ دعویٰ\n\nمجھے آپ ہی کے در سے ہے اُمید بہتری کی\nکسی اور سے جزا کا نہ گمان ہے نہ دعویٰ\n\nنہ میں کعبؔ ہوں نہ جامیؔ ، نہ بوصیریؔ و شہیدیؔ\nمجھے صدق یا صفا کا نہ گمان ہے نہ دعویٰ\n\nمیں تلاش میں ابھی ہوں کسی نغمہ رسا کی\nمجھے خوبی نوا کا نہ گمان ہے نہ دعویٰ\n\nمیرے درد کا مداوا ہے بس آپ ہی کے در پہ\nکہیں اور سے شفا کا نہ گمان ہے نہ دعویٰ\n\nمرے مقتدا و رہبر ہیں حضور آپ ، لیکن\nمجھے حسن اقتدا کا نہ گمان ہے نہ دعویٰ"
  },
  {
    "id": 84,
    "title": "نعت شریف",
    "description": "طائر فکر اڑے اور جناں تک پہنچے\nعین ممکن ہے کبھی ان کے مکاں تک پہنچے\n\nجس جگہ آپ گئے اور جہاں تک پہنچے\nغیرممکن ہے کوئی اور وہاں تک پہنچے\n\nچھوڑ کر پیرویٔ نقش کف پائے حضور\nقافلے اہل تیقن کے گماں تک پہنچے\n\nہو خیالوں کو مرے پیکر الفاظ نصیب\nسیل جذبات حد اشک رواں تک پہنچے\n\nکھینچ لو نسبت سرکار مدینہ کا حصار\nاس سے پہلے کہ شرر گلشن جاں تک پہنچے\n\nتو نظر آیا نہیں شہر مدینہ ہم کو\nہم تجسّس میں ترے باغ جناں تک پہنچے\n\nڈھونڈتے ڈھونڈتے اے اصل حقائق تجھ کو\nدارِ ارواح سے ہم دیکھ کہاں تک پہنچے\n\nمیں نے شہزادؔ کیا جونہی تصور ان کا\nحرف باطرزِ گدا باب بیاں تک پہنچے"
  },
  {
    "id": 85,
    "title": "دعا، مناجات، نعت",
    "description": "بارگاہِ سرور دیں کے ثناء خوانوں کی خیر\nشمع وصف شہ طیبہ کے پروانوں کی خیر\n\nآپ کے نقش قدم پر ہیں فدا مژگان تر\nآپ جن سے ہو کے گزرے ان بیابانوں کی خیر\n\nدوپہر کو بیٹھتے تھے آپ جن کی چھائوں میں\nان ثمرآور درختوں ان گلستانوں کی خیر\n\nحضرت صدیق ، عمر ، عثمان، علی ، زید و بلال\nمیرے آقا آپ کے ان مرتبہ دانوں کی خیر\n\nآپ کے زیرقیادت ہے نبوت کا جلوس\nحامل بار نبوت آپ کے شانوں کی خیر\n\nجن کی صورت سے عیاں ہو آپ کی سیرت کا نور\nآپ کے دامن گرفتہ ایسے دیوانوں کی خیر\n\nعشق ہے شہزادؔ جن کو سرور کونین سے\nان غلاموں ان فقیروں ، ان جہانبانوں کی خیر"
  },
  {
    "id": 86,
    "title": "نعت شریف",
    "description": "ان کا پیرو بہک نہیں سکتا\nیہ مسافر تو تھک نہیں سکتا\n\nباغ طیبہ سے رابطے کے بغیر\nکوئی غنچہ چٹک نہیں سکتا\n\nان کی سانسیں جو مشکبار نہ ہوں\nپھول ہر گز مہک نہیں سکتا\n\nسورج ان سے جو فیضیاب نہ ہو\nیوں مسلسل چمک نہیں سکتا\n\nملتفت وہ نہ ہوں تو آنکھوں سے\nایک آنسو ٹپک نہیں سکتا\n\nجب تک اذن رسول پاک نہ ہو\nوقت پلکیں جھپک نہیں سکتا\n\nروبرو میں کھڑا ہوں روضے کے\nآنکھ اٹھاتا ہوں تک نہیں سکتا\n\nجس کے رہبر حضور ہوں شہزادؔ\nوہ مسافر بھٹک نہیں سکتا"
  },
  {
    "id": 87,
    "title": "’’وَرَفَعْنَا لَکَ ذِکْرَکْ‘‘",
    "description": "خدا کی حمد و ثنا و تسبیح\nکا جہاں تک بھی سلسلہ ہے\n\nوہاں پہ اسم رسول اکرم\nکا نور بھی جگمگا رہا ہے\n\nفضائے کون و مکاں میں ہر سُو\nحدود ارض و سما سے باہر\n\nجہاں بھی ہے کوئی سبحہ گرداں\nوہاں درود و سلام بھی ہے\n\nوہاں محمد ا کا نام بھی "
  },
  {
    "id": 88,
    "title": "’’ذکرک ذکری‘‘",
    "description": "خدا نے بخشی ہے آپ رفعت\nمقام و اسم محمدی کو ، رئوف کہہ کر رحیم کہہ کر\n\nعظیم کہہ کر ، کریم کہہ کر\nکہیں الف لام میم کہہ کر\n\nزمیں پہ ان کو کیا محمد (ا)\nفلک پہ احمد انہیں بنایا\n\nغرض کہ توحید کو رسالت کی راہ سے منکشف کیا ہے\nاذان ہو یا نماز دیکھو ، دعا کا سوز و گداز دیکھو\n\nسفر میں دیکھو ، حضر میں دیکھو\nجہاد دیکھو ، محاذ دیکھو\n\nذرا کلام مجید دیکھو یہ شان رب حمید دیکھو\nکہ اس نے ہر اک مقام پر ساتھ اپنے رکھا ہے\n\nاپنے پیارے رسول پیارے (حبیب) کا\nپاک نام نامی"
  },
  {
    "id": 89,
    "title": "نعت شریف",
    "description": "کئی سورج نبی کے در سے پھوٹے\nستارے بھی انہیں کے گھر سے پھوٹے\n\nمزہ دیتی ہے تب مدح سرائی\nجو چشمہ نعت کا اندر سے پھوٹے\n\nعطا کی روشنی ہے شہر جاں میں\nثناء کا نور ہر منظر سے پھوٹے\n\nاُٹھاتا ہوں میں اک لطف حضوری\nگہر جب میری چشم تر سے پھوٹے\n\nادھر ہلنا تھا ان کی انگلیوں کا\nادھر ، چشمے کئی کوثر سے پھوٹے\n\nجہاں میں بانٹتی پھرتی ہے سورج\nکرن جو گنبد اَخضر سے پھوٹے\n\nکھلے شہزادؔ جب اعمال نامہ\nمہک مدحت کی ہر دفتر سے پھوٹے"
  },
  {
    "id": 90,
    "title": "نعت شریف",
    "description": "رونق بزم جہاں شمع شبستان عرب\nثانی باغ جناں حسن گلستان عرب\n\nراحت قلب و نظر غنچہ بستان عرب\nچارئہ درد جگر خار بیابان عرب\n\nتابع حکم شہ دیں ہیں عجم کے دفتر\nدست محبوب خدا میں ہے قلمدان عرب\n\nذرّہ ذرّہ میں چمکتے ہیں یہاں ماہ و نجوم\nجادئہ عرش معلیٰ ہے خیابان عرب\n\nجب کھلا باب عنایات نبوّت اس میں\nآسماں گیر ہوئی وسعت دامان عرب\n\nسنّت سرورِ دیں ، صاحب ایماں کا وقار\nیعنی دستار کہ ہے زینتِ مردان عرب\n\nمجھ کو شہزادؔ کمک روحِ رضاؔ سے پہنچی\nورنہ ہوتی نہ رقم مدحت سلطان عرب"
  },
  {
    "id": 91,
    "title": "نعت شریف",
    "description": "ہاتھ میں لے کے قلم اپنا مقدر لکھنا\nاتنا آساں بھی نہیں نعت پیمبر لکھنا\n\nدفتر حشر کا سرکار کو افسر لکھنا\nکشور ارض و سما کا انہیں سرور لکھنا\n\nدیکھنا ان کی عنایات کریمانہ کو\nاور انہیں سب کے لیے لطف کا پیکر لکھنا\n\nپیاس میں شربت کوثر کی سی لذت دے گا\nشاہ کوثر کا قصیدہ لب کوثر لکھنا\n\nقبر پر ناعت احمد کی لگانا تختی\nواصف شاہ عرب میرے کفن پر لکھنا\n\nبات ہو ان کے مدینے کی تو جنت کہنا\nذکر ہو اس کی فضا کا تو معطر لکھنا\n\nدیکھ کر نقش کف پائے نبی کی جھلمل\nہم سے ممکن نہ ہوا مہ کو منوّر لکھنا\n\nکثرت لطف الٰہی کا ہے شہزادؔ ثبوت\nمدحت مصطفوی لکھنا اور اکثر لکھنا"
  },
  {
    "id": 92,
    "title": "نعت شریف",
    "description": "نظم توصیف نبی کی ابتدا ہو جائے گی\nزندگی جس روز نذر مصطفی ہو جائے گی\n\nاوڑھ لوں گا جسم پر ذکر پیمبر کی ردا\nموت ٹکرائے گی مجھ سے اور فنا ہو جائے گی\n\nہے مجھے کامل یقیں ان کی نگاہ لطف پر\nمیری قسمت میں مدینے کی فضا ہو جائے گی\n\nایک دن حاصل حضوری کا شرف ہو گا مجھے\nایک دن مقبول میری ہر دعا ہو جائے گی\n\nدہر کا ہر ایک رشتہ ان کی نسبت پر نثار\nہر تمنا ان کی سنت پر فدا ہو جائے گی\n\nبخشا جائے گا اسی کو پیشوائی کا مقام\nجس کو حاصل شاہ دیں کی اقتدا ہو جائے گی\n\nمیرے تو شہزادؔ یہ وہم و گماں تک میں نہ تھا\nنعمتِ نعت نبی مجھ کو عطا ہو جائے گی"
  },
  {
    "id": 93,
    "title": "نعت شریف",
    "description": "اخلاص کا پیکر ہیں تو احسان سراپا\nاے سرورِ دیں ! آپ ہیں قرآن سراپا\n\nہے آپ کا دل مخزن اسرارِ الٰہی\nہر ایک ادا آپ کی عرفان سراپا\n\nکی آپ کے ہر فعل نے توحید کی تفسیر\nہیں آپ ہی دیں ، آپ ہی ایمان سراپا\n\nاے ختم رسل! ناسخ ادیان و صحائف\nاے نورِ مبیں ، جلوئہ رحمن سراپا\n\nشہزادؔ خیال آتا ہے جب شہر نبی کا\nہو جاتا ہے دل شوق سے ارمان سراپا"
  },
  {
    "id": 94,
    "title": "نعت شریف",
    "description": "سرور دیں رحمت کونین کی کیا بات ہے\nفخر عالم ہادیٔ دارین کی کیا بات ہے\n\nیاد آتے ہی نہیں جس کی فضا میں رنج و غم\nشہر طیبہ قریہ سکھ چین کی کیا بات ہے\n\nکوئی ثانی ہی نہیں ہے ان کا خلق و خلق میں\nآمنہ بی بی کے نور عین کی کیا بات ہے\n\nجن کا ایک اک نقش ہے رشد و ہدایت کا چراغ\nاس مجسم نور کے نعلین کی کیا بات ہے\n\nجن کی ہے ہر اک ادا نور نبی سے مستفیض\nحضرت عثمان ذوالنورین کی کیا بات ہے\n\nہیں شہ کونین کے شہزادؔ یہ دونوں وزیر\nیعنی صدیق و عمر شیخین کی کیا بات ہے"
  },
  {
    "id": 95,
    "title": "نعت شریف",
    "description": "حسن فطرت کا اوج کمال آپ ہیں\nپیکر نور ، شیریں مقال آپ ہیں\n\nحسنِ کونین ہے مستفیض آپ سے\nتاجدار حریم جمال آپ ہیں\n\nآپ سے گلشن جاں میں رعنائیاں\nرونق بزم فکر و خیال آپ ہیں\n\nآپ کا ذکر ہے راحت قلب و جاں\nدافع رنج و حزن و ملال آپ ہیں\n\nآپ کا نقش پا ہے چراغ ھدٰی\nدہر کے رہبر خوش خصال آپ ہیں\n\nمستفید آپ سے ہر زمانہ ہوا\nمحسن اہل ماضی و حال آپ ہیں\n\nفیض پاتا ہے جذب اویس آپ سے\nذوق افزائے عشق بلال آپ ہیں\n\nکس سے تشبیہ شہزادؔ دے آپ کو\nیا نبی! بے مثیل و مثال آپ ہیں"
  },
  {
    "id": 96,
    "title": "نعت شریف",
    "description": "قلب کو انوار مدحت نے مجلا کر دیا\nنفس کو فیضان سیرت نے مزکی کر دیا\n\nبخش کر کچی زمیں کو استراحت کا شرف\nمصطفی نے فرش کو عرش معلیٰ کر دیا\n\nمہرباں ہے کس قدر مجھ پر مرا رب کریم\nجس نے مجھ کو آپ کی امت میں پیدا کر دیا\n\nمیں کہ محروم تعارف تھا ہجوم خلق میں\nآپ کی نسبت نے مجھ کو با حوالہ کر دیا\n\nحاملیں فیض رسالت کے ہیں اصحاب نبی\nان ستاروں نے جہاں بھر میں اجالا کر دیا\n\nشہسوار بدر و خندق ، صاحب تسبیح و تیغ\nآپ کی تعلیم نے بندے کو مولا کر دیا\n\nان گنت شہزادؔ اس ذات گرامی پر درود\nجس کی چشم لطف نے اسفل کو اعلیٰ کر دیا"
  },
  {
    "id": 97,
    "title": "نعت شریف",
    "description": "نسبت کا اثبات عطا ہو\nخاص کوئی سوغات عطا ہو\n\nسوکھی ہے آنکھوں کی کھیتی\nاشکوں کی برسات عطا ہو\n\nخالی ہے اظہار کا کاسہ\nلفظوں کی خیرات عطا ہو\n\nجس کو سن کر قدسی جھومیں\nمجھ کو ایسی نعت عطا ہو\n\nجس میں ہو معراج بصارت\nایسی بھی اک رات عطا ہو\n\nکرتا ہے شہزادؔ گزارش\nاب عرفان ذات عطا ہو"
  },
  {
    "id": 98,
    "title": "نعت شریف",
    "description": "ان کی سیرت ہے راہبر میری\nشاخ ایماں ہے باثمر میری\n\nآفتاب ثنا کی کرنوں سے\nجگمگاتی ہے ہر سحر میری\n\nڈھال کر سوز جاں کو اشکوں میں\nپیش کرتی ہے چشم تر میری\n\nقافلہ دیکھ کر مدینے کا\nاشک افشاں ہے چشم تر میری\n\nروضہ مصطفی پہ جا پہنچوں\nآہ جائے نہ بے اثر میری\n\nاس میں سرکار کا حوالہ ہے\nبات ہو کیوں نہ معتبر میری\n\nبیت جائے ثنائے خواجہ میں\nزندگی ہے جو مختصر میری\n\nمیں ہوں بیمار بارگاہِ رسول\nچھوڑ دے فکر چارہ گر میری\n\nپھر تو شہزادؔ بات بن جائے\nبات آقا سنیں اگر میری"
  },
  {
    "id": 99,
    "title": "اے مدینہ!",
    "description": "اے مدینہ! اے سرزمینِ ادب\nتجھ سے قائم ہے حسنِ ملکِ عرب\n\nنام تیرے ہیں سب حسین و جمیل\nتیرے آثار شاندار و عجب\n\nتجھ میں جلوہ نما ہیں سرورِ دیں\nتیری عظمت کا ہے یہی تو سبب\n\nارضِ طیبہ اے فرشِ عرش نما\nخلد سے مل رہا ہے تیرا حسب\n\nاے حریم نبی! اے عکس عدن\nسارے شہروں میں تو مجھے ہے احب\n\nراحت قلب و جاں ہے تیرا خیال\nیاد تیری ہے مجھ کو وجہ طرب\n\nاے مطیب! نظیف اے طابہ!\nمصدر صبح جاں تری ہر شب\n\nکھول دے مجھ پہ اپنے دروازے\nمیں ہوں بیمار اور تو ہے مطب\n\nاے دیارِ کرم مجھے بھی نواز\nغم لگاتا ہے بامِ جاں میں نقب\n\nتجھ سے شہزادؔ کو عقیدت ہے\nاس کے دامن میں ہے عمل نہ کسب"
  },
  {
    "id": 100,
    "title": "نعت شریف",
    "description": "پل بھر میں بار یاب حضور خدا میں تھی\nصلِّ علیٰ کی چاشنی شامل دُعا میں تھی\n\nاک سمت فیض وحی تھا ، اک سمت مصطفی\nدونوں جہاں کی روشنی غارِ حرا میں تھی\n\nباب حرم کے سامنے ساکت کھڑا رہا\nکب تاب مدعا طلبی مجھ گدا میں تھی\n\nدستِ سوال دستِ عطا میں بدل گیا\nتاثیر یہ حضور کی شانِ سخا میں تھی\n\nمحشر میں ہوں گے ان کی شفاعت سے فیضیاب\nحکمت یہی بس ایک ہماری خطا میں تھی\n\nپاتا ہوں اب بھی موجِ نفس میں وہی مہک\nخوشبو عجیب شہرِ نبی کی فضا میں تھی\n\nشہزادؔ جب جہان کو دیکھا بچشمِ دل\nہر چیز محو مدحت خیرالوریٰ میں تھی"
  },
  {
    "id": 101,
    "title": "نعت شریف",
    "description": "چھیڑتے اہلِ حقائق بھی فسانے اپنے\nکاش ہوتے درِ آقا پہ ٹھکانے اپنے\n\nچھوڑ کر پیرویٔ نقشِ کف پائے حضور\nاپنے تیروں سے لیے ہم نے نشانے اپنے\n\nکارواں ان کی محبت کا ہمیں لے بھی گیا\nڈھونڈتے ہی رہے اسباب بہانے اپنے\n\nایک اک پل ہو قیامت جو نہ ہو ان کی نظر\nان کی رحمت کا تسلسل ہیں زمانے اپنے\n\nسایہ گنبد خضریٰ ہو میّسر ہم کو\nپائیں تعبیر کبھی خواب سہانے اپنے\n\nذکر اوصاف پیمبر کا ہے شہزادؔ سبب\nداد جبریل سے پاتے ہیں ترانے اپنے"
  },
  {
    "id": 102,
    "title": "نعت شریف",
    "description": "جذب درُوں خلوص کے سانچے میں ڈھل ذرا\nاے دل حدِ حریم نبی ہے سنبھل ذرا\n\nمصداق یہ دیار بھی ’’لااُقْسِمُ‘‘ کا ہے\nاس راہ محترم پہ دبے پائوں چل ذرا\n\nآہستہ سانس لے یہ مقام بقیع ہے\nآرام عاشقاں میں نہ آئے خلل ذرا\n\nخیرات خلق مانگ خلیق عظیم سے\nاے ترش رُو مزاج کو اپنے بدل ذرا\n\nشاید لکھی ہو میرے مقدّر میں یہ زمیں\nرک جائو! اہل کارواں دوچار پل ذرا\n\nشہزادؔ ان کے حسن کرم نے بچا لیا\nآیا نہ کام حشر میں کوئی عمل ذرا"
  },
  {
    "id": 103,
    "title": "نعت شریف",
    "description": "گیا جب نور اسم احمدی ہونٹوں سے آنکھوں تک\nہوئی جلوئہ نما اک روشنی ہونٹوں سے آنکھوں تک\n\nتقاضائے ادب نے ارتقا بخشا تجسس کو\nتمنا دل میں تھی جو آ گئی ہونٹوں سے آنکھوں تک\n\nسکوں دیتی ہے یاد مونس بے چارہ گاں دل کو\nبسیرا جب کرے آزردگی ہونٹوں سے آنکھوں تک\n\nفراق خلد طیبہ میں ہوا کچھ اشکبار ایسے\nید قدرت کی دیکھی زرگری ہونٹوں سے آنکھوں تک\n\nنظر آیا ہر اک زائر لیے کشکول چشم و لب\nسمٹ آئی ہو جیسے زندگی ہونٹوں سے آنکھوں تک\n\nیہ ثمرہ ہے حضوری کے تصور کا کہ اب ہر دم\nمجھے محسوس ہوتی ہے نمی ہونٹوں سے آنکھوں تک\n\nتڑپتا ہے بہت شہزادؔ دل ہجر مدینہ میں\nمگر ہے رہگزر جذبات کی ہونٹوں سے آنکھوں تک"
  },
  {
    "id": 104,
    "title": "نعت شریف",
    "description": "آپ کے التفات کی صورت\nہم نے دیکھی نجات صورت\n\nثبت اس پر ہے نقشِ پائے نبی\nکیوں نہ نکھرے حیات کی صورت\n\nابتسام مہ عرب کے طفیل\nروشن اب تک ہے رات کی صورت\n\nہر تغیرّ دیار طیبہ میں\nدیکھتا ہے ثبات کی صورت\n\nمہر فاران کی شعاع سے ہے\nضوفشاں کائنات کی صورت\n\nآنکھ شہزادؔ چاہیے دل کی\nدیکھنی ہو جو نعت کی صورت"
  },
  {
    "id": 105,
    "title": "نعت شریف",
    "description": "طوفان حوادث میں ہوں تنہا مرے آقا\nجز آپ کے کوئی نہیں اپنا مرے آقا\n\nاس پر جو عنایات کا بادل کبھی برسے\nہو جائے خنک روح کا صحرا مرے آقا\n\nہیں آپ ہی اللہ کی ہر صفت کا مظہر\nلاثانی و بے ہمسر و یکتا مرے آقا\n\nاسرارِ حیات اس پہ کبھی کھل نہیں سکتے\nجو آپ کی عظمت نہیں سمجھا مرے آقا\n\nہوتا جو میسر مجھے وہ دور مقدّس\nسر آپ کے نعلین پہ رکھتا مرے آقا\n\nہوتا ہوں خجل کر کے حضوری کا تصور\nکس طرح کروں عرضِ تمناّ مرے آقا\n\nہو جائوں رہا قید زماں اور مکاں سے\nبن جائے مرا دل ہی مدینہ مرے آقا\n\nچلتے رہیں کونین میں خیرات کے دھارے\nجاری رہے الطاف کا دریا مرے آقا\n\nرکھتا ہے در پاک سے شہزادؔ بھی نسبت\nسائل کو عطا ہو کوئی ٹکڑا مرے آقا"
  },
  {
    "id": 106,
    "title": "نعت شریف",
    "description": "یہی نہیں کہ فقط اس زمیں پہ لہرائے\nعلم حضور کا عرش بریں پہ لہرائے\n\nانہی سے آس ہے بے کس کو چشم رحمت کی\nوہ جن کی ظلّ کرم عالمیں پہ لہرائے\n\nنزول وحی کے لمحات کہکشاں بن کر\nمرے نبی کی مقدّس جبیں پہ لہرائے\n\nعبیر و مشک سے میں بے نیاز ہو جائوں\nاگر وہ دامنِ اقدس کہیں پہ لہرائے\n\nجلی ہے نعت کی مشعل جو میرے آنگن میں\nچراغ لطف کی لو بھی یہیں پہ لہرائے\n\nہو جس مقام پر شہزادؔ تیرگی کا ورُود\nمہ منیر کا پر تو وہیں پہ لہرائے"
  },
  {
    "id": 107,
    "title": "نعت شریف",
    "description": "دیار مصطفوی کا جمال کیا کہنا\nبہر لحاظ ہے جو لازوال کیا کہنا\n\nفلاح کل کی ضمانت ہے پیروی جس کی\nوہ نقش پائے شہِ خوش خصال کیا کہنا\n\nدر نبی کے تصوّر میں سجدہ ریز رہی\nجبین عجز کا اوج کمال کیا کہنا\n\nوہ ، معجزات ہیں جس کی ہر اک ادا پہ نثار\nنہیں ہے دہر میں جس کی مثال کیا کہنا\n\nوفا کا لفظ ہوا اور معتبر جس سے\nمرے حضور کا عاشق بلال کیا کہنا\n\nادب ادب کی صدا دے رہی ہے ہر دھڑکن\nپلک پلک پہ دھرا ہے سوال کیا کہنا\n\nملی ہوئی ہے مرے دل سے سرحد طیبہ\nمرے شعور کا حسن خیال کیا کہنا\n\nاتار دیتا ہے شہزادؔ دل سے بوجھ کئی\nفراق مصطفوی کا ملال کیا کہنا"
  },
  {
    "id": 108,
    "title": "نعت شریف",
    "description": "بعد ہجرت کی سکونت اختیار آ کر یہاں\nآپ نے طیبہ کو بخشا افتخار آ کر یہاں\n\nشہر طیبہ کتنی تسکیں بخش ہے تیری فضا\nچین پاتے ہیں جہاں کے بے قرار آ کر یہاں\n\nکیا کشش ہے بارگاہِ سرورِ کونین میں\nسر جھکاتے ہیں فقیر و تاجدار آ کر یہاں\n\nمعجزہ یہ بھی ہے اس ذات ادب آموز کا\nسیکھتے ہیں تاجور بھی انکسار آ کر یہاں\n\nچوم کر گلزار طیبہ کی تر و تازہ ہوا\nاور بھی دلکش ہوئی فصلِ بہار آ کر یہاں\n\nجنت الفردوس جیسا ہے سماں ماحول میں\nختم ہو جاتا ہے سارا انتظار آ کر یہاں\n\nمرتبہ شہزادؔ ہو جاتا ہے زائر کا بلند\nکم نہیں ہوتی ہے عزت بار بار آ کر یہاں"
  },
  {
    "id": 109,
    "title": "نعت شریف",
    "description": "بنا کے سیرتِ اطہر کو رہنما ہم نے\nنشانِ منزل مقصود پا لیا ہم نے\n\nکبھی نصیب ہو آقا اسے بھی باب مراد\nہر ایک آہ کو پایا ہے نارسا ہم نے\n\nہوئی جو برسر پیکار گردشِ دوراں\nکیا حضور کی رحمت سے رابطہ ہم نے\n\nنگاہِ لطف کو مائل بہ لطف ہی پایا\nدرِ کریم پردی جب کبھی صدا ہم نے\n\nنقوشِ پائے رسالت مآب پر چلنا\nیہی فلاح کا پایا ہے راستہ ہم نے\n\nہر ایک جرم پر نادم ہیں یارسول اللہ!\nادب سے تھام کر دامن کو کہہ دیا ہم نے\n\nبہ مقتضائے عقیدت بصد خلوص و نیاز\nبلیٰ کے ساتھ ہی صلِّ علیٰ کہا ہم نے\n\nکہا حضور نے شہزادؔ لا شریک جسے\nصمیم قلب سے مانا اسے خدا ہم نے"
  },
  {
    "id": 110,
    "title": "نعت شریف",
    "description": "ظلمت میں جبکہ نور کو پیدا کیا گیا\nتاریکیوں کو دہر سے چلتا کیا گیا\n\nاوصاف ہر رسول کو خالق نے کچھ دیے\nشاہِ رُسل کو خلق میں یکتا کیا گیا\n\nرفعت کسی کے ذکر کو ایسی کہاں نصیب\nجیسے مرے حضور کا چرچا کیا گیا\n\nاے صاحب شفاعت کبریٰ ترے طفیل\nہم بے زروں سے خلد کا سودا کیا گیا\n\nتاحشر آفتاب نبوت کے فیض سے\nدھرتی کو رشک عالم بالا کیا گیا\n\nکیا عرض کر سکوں گا پیمبر کے روبرو\nگر نعت ہی کا مجھ سے تقاضا کیا گیا\n\nشہزادؔ گلستان مدینہ کی شکل میں\nکندہ زمیں پہ خلد کا نقشہ کیا گیا"
  },
  {
    "id": 111,
    "title": "نعت شریف",
    "description": "سائل نے لگائی ہے صدا اور طرح کی\nہو بھیک سخی آج عطا اور طرح کی\n\nبے مثل ہیں ہر ایک پیمبر کے خصائص\nہے آپ کی ہر ایک ادا اور طرح کی\n\nآ جائے دعائوں میں اگر تیرا حوالہ\nکرتا ہے عنایات خدا اور طرح کی\n\nسرکار بھی فرماتے ہیں لطف اور طرح کا\nہو جاتی ہے جب مجھ سے خطا اور طرح کی\n\nہے روز فزوں اوجِ کمالاتِ نبوّت\nہر آن ہے قامت پہ قبا اور طرح کی\n\nہو سایہ فگن مجھ پہ ترے ذکر کی چادر\nشہزادؔ کو مل جائے ردا اور طرح کی"
  },
  {
    "id": 112,
    "title": "نعت شریف",
    "description": "ہر ایک رنج و الم کی دوا میسر ہو\nتری گلی کی ہمیں بھی فضا میسر ہو\n\nبس ایک شعر ہو میری نجات کا باعث\nاگر مجھے بھی شعور ثناء میسر ہو\n\nیہ ان کی چشم عنایت سے کچھ بعید نہیں\nگناہگار کو قربِ خدا میسر ہو\n\nخفا رہے مرا مالک یہ ہو نہیں سکتا\nاگر حضور کی مجھ کو رضا میسر ہو\n\nحضور ایک اشارہ کریں جو ہلکا سا\nدل کثیف کو صدق و صفا میسر ہو\n\nاسے ملے گی ہر اک چیز آپ کے در سے\nاُمیدوار ہے سائل صدا میسر ہو\n\nکرم حضور کا شہزادؔ ہو تو گھر بیٹھے\nدرِ حضور کی ٹھنڈی ہوا میسر ہو"
  },
  {
    "id": 113,
    "title": "نعت شریف",
    "description": "عیاں قرآں کے حرفوں سے ترا اکرام ہے آقا\nتری ہر اک ادا پر مشتمل اسلام ہے آقا\n\nنبی’‘ ، صاحب’‘ ، عبد’‘ ، حریص’‘ ، حاشر ’‘، ذکر’‘\nفیوض و نور کا چشمہ ترا ہر نام ہے آقا\n\nترے شایان شاں ہے عبدہٗ کے لفظ کی حرمت\nفَاَوْحٰی کا فقط تیرے لیے پیغام ہے آقا\n\nچنا اپنے لیے تو نے رسول عبد کا منصب\nتحیر خیز یہ کیسا حسیں اقدام ہے آقا\n\nسلامت ہے جو ذوق بندگی تیری عنایت ہے\nسحر خیزی کا جذبہ تیرا فیض عام ہے آقا\n\nہے مرشد فقر والوں کا ترا سنگِ شکم بستہ\nتری خاک گزر اقطاب کا احرام ہے آقا\n\nاے اعزاز دے اپنی غلامی کی سند دے کر\nترا شہزادؔ بھی اک بندئہ بے دام ہے آقا"
  },
  {
    "id": 114,
    "title": "٭        پاکستان ٹیلی ویژن کی طرف سے ربیع الاول ۱۴۲۲ھ میں پیش کیے جانے والے خصوصی پروگرام ’’القابِ رسول‘‘ کے لئے لکھی اور پیش کی گئی۔",
    "description": "نعت شریف\nنجات شر سے ملی خیر کے قریب ہوا\n\nہزار شکر کہ وہ در مجھے نصیب ہوا\nزکوٰۃ دی جو فصاحت کی مصطفی نے اسے\n\nجو سنگ پارہ تھا وہ رشک صد خطیب ہوا\nکوئی خلیل ، مسیح و کلیم ہے کوئی\n\nخدا کا ایک ہی پیارا مگر حبیب ہوا\nہوا طلوع وہ سورج بشارتیں لے کر\n\nدیارِ جبر میں وہ عدل کا نقیب ہوا\nتجلیات کے دیار میں عکس ماہ مبیں\n\nنظر نواز یہ منظر بہت عجیب ہوا\nبہشت و عرش بھی تکتے ہیں رشک سے اس کو\n\nدرِ حضور پہ حاضر جو خوش نصیب ہوا\nبدل گیا ہے شفا میں ہر اک مرض شہزادؔ\n\nغم فراق مدینہ مرا طبیب ہ"
  },
  {
    "id": 115,
    "title": "نعت شریف",
    "description": "حرف میں ہے اثر تو اچھا ہے\nدرد دل میں ہے گر تو اچھا ہے\n\nآبرو ہے اسی میں عاصی کی\nتر رہے چشم تر تو اچھا ہے\n\nبارگاہِ شہ دو عالم میں\nعرض ہو مختصر تو اچھا ہے\n\nجانے آ جائیں کس گھڑی سرکار\nمیں رہوں منتظر تو اچھا ہے\n\nدل رہے ان کے در سے وابستہ\nہو نہ یہ در بدر تو اچھا ہے\n\nکیا خبر نعت کب عطا ہو جائے\nساتھ ہو آبِ زر تو اچھا ہے\n\nسبز گنبد ، سنہری جالی کو\nچوم ہی لے نظر تو اچھا ہے\n\nآ گیا ہے نظر دیار حبیب\nختم ہو اب سفر تو اچھا ہے\n\nان کے شہزادؔ زیر سایہ ہی\nزندگی ہو بسر تو اچھا ہے"
  },
  {
    "id": 116,
    "title": "نعت شریف",
    "description": "تاجدار حرم ! رحم فرمائیے\nاے سراپا کرم! رحم فرمائیے\n\nہم گنہگار ہیں ، ہم سیہ کار ہیں\nاے شفیعِ امم رحم فرمائیے\n\nسید و سرورِ تُرک و تاز و مغل\nاے امیرِ عجم رحم فرمائیے\n\nدست اغیار میں ہے کلیدِ حرم\nاے امینِ حرم رحم فرمائیے\n\nکعبہ پھر سے صلیبوں میں محصور ہے\nاے عَلِیْ اِلْھَمْ رحم فرمائیے\n\nبگڑا امت کے چہرے کا ہر نقش ہے\nحسن روئے ارم رحم فرمائیے\n\nسبز گنبد کی قربت عطا کیجیے\nاے مبارک قدم رحم فرمائیے\n\nدر سے شہزادؔ آقا نہ خالی پھرے\nاے قسیم نِعَمْ رحم فرمائیے"
  },
  {
    "id": 117,
    "title": "نعت شریف",
    "description": "دیار نبی کی فضائوں کی خیر\nمدینے کی ٹھنڈی ہوائوں کی خیر\n\nغنیمت ہے دنیا میں ان کا وجود\nدر مصطفی کے گدائوں کی خیر\n\nوسیلہ ہے جن کا تری ذات پاک\nلبوں پر سجی ان دعائوں کی خیر\n\nحفاظت کا حق نے کیا انتظام\nفرشتوں نے مانگی ادائوں کی خیر\n\nیہ دیکھا ہے تیری عدالت کا فیض\nخطا کار مانگیں سزائوں کی خیر\n\nیہ کہتے ہیں کوتاہ دامن فقیر\nسخی! ان مسلسل عطائوں کی خیر\n\nادب سے جھکی گردنوں کو سلام\nنگاہوں سے بہتی خطائوں کی خیر\n\nمواجہہ میں رہتی ہیں جو پست تر\nلرزتی ، سسکتی صدائوں کی خیر\n\nملا جن کو تیری رضا کا مقام\nزمانے کے ان رہنمائوں کی خیر\n\nمدینے کی گلیوں کے ذرّات میں\nچمکتی ہوئی کہکشائوں کی خیر\n\nسناتے ہیں شہزادؔ ذکرِ رسول\nشہِ دیں کے مدح سرائوں کی خیر"
  },
  {
    "id": 118,
    "title": "نعت شریف",
    "description": "نوازشات رسالت مآب کیا کہنا\nکھلا ہے لطف و عنایت کا باب کیا کہنا\n\nجبین و عارض خیرالوریٰ ، تعال اللہ\nکھلی ہوئی ہے خدا کی کتاب کیا کہنا\n\nملا ہے جس سے مسائل کا حل زمانے کو\nدیا حضور نے ایسا نصاب کیا کہنا\n\nکریم و طہٰ و یٰسٓ ، ابطحی و عظیم\nمرے رسول کا اک اک خطاب کیا کہنا\n\nخدا نے صورت ختم الرسل میں بھیج دیا\nہر اک سوال کا کامل جواب کیا کہنا\n\nلو روبرو ہیں مرے مصطفی کے جبرائیل\nیہ ہمنشینی بحر و حباب کیا کہنا\n\nبلال و بوذر و سلمان کی ہر ایک ادا\nوہ جانثاریٔ زید و خباب کیا کہنا\n\nدر حبیب کے ذروں میں غور سے دیکھو\nدمک رہے ہیں کئی آفتاب کیا کہنا\n\nمرے خیال میں شہزادؔ ہے دیار حبیب\nسجے ہیں آنکھ میں طیبہ کے خواب کیا کہنا"
  },
  {
    "id": 119,
    "title": "نعت شریف",
    "description": "خیال جنت طیبہ ہے اور میں تنہا\nتجلیاّت کی دنیا ہے اور میں تنہا\n\nحضور آپ ہی ڈھارس بندھائیے میری\nسفر کی رات ہے صحرا ہے اور میں تنہا\n\nمری حیات کا یاد نبی سے ربط رہے\nبڑا طویل یہ رستہ ہے اور میں تنہا\n\nعجیب لطف ہے دوری میں بھی حضوری کا\nجمال گنبد خضریٰ ہے اور میں تنہا\n\nاے چشم لطف و عنایت مری کفالت کر\nتفکرّات کا میلہ ہے اور میں تنہا\n\nمدد کو آئیے میری اے دستگیر جہاں\nمقابل ایک زمانہ ہے اور میں تنہا\n\nمجھے ثبات کی صورت دکھائیے آقا!\nتغیرات کا پہرا ہے اور میں تنہا\n\nکمک کو بھیجئے شہزادؔ کی سکون و سرور\nغم حیات کا کانٹا ہے اور میں تنہا"
  },
  {
    "id": 120,
    "title": "نعت شریف",
    "description": "بیاں کیا ہو حسن و جمال رسول\nنہیں انبیاء میں مثال رسول\n\nفروغ صداقت کا باعث ہوا\nزمانے میں صدق مقال رسول\n\nفرشتوں میں انسانیت کا وقار\nہے قائم بفیض کمال رسول\n\nمخالف پہ ہیبت ہے میلوں پرے\nتعال اللہ! رعب و جلال رسول\n\n{ OL 100 }\nفطوبیٰ لنا ، ثم طوبیٰ لنا\n\nکہ داریم نسبت بہ آل رسول\nبہاروں کے دن ہوں ، کہ فصل خزاں\n\nرہے ساتھ ہر دم خیال رسول\nدیار کرم میں بہ گوش خیال\n\nسنیں ہم اذان بلال رسول\nیہ منظر ہو شہزادؔ روز جزا\n\n’’من و دست و دامان آل رسول ا "
  },
  {
    "id": 121,
    "title": "نعت شریف",
    "description": "یاد حضور تازگی فکر بشر کی ہے\nوصل حبیب آرزو قلب ونظر کی ہے\n\nان کے لیے ہی جلوئہ خالق ہے آشکار\nان کے لیے ہی روشنی شمس و قمر کی ہے\n\nخادم ہے آسماں بھی اسی بارگاہ کا\nساری زمیں کنیز شہ بحر و بر کی ہے\n\nبے شک سکون بخش ہے کعبہ کی دید بھی\nکچھ کیفیت عجیب ہی آقا کے در کی ہے\n\nمجھ سا ضعیف اور یہ مدحت کے مرحلے\nمیری طرف نگاہ کسی دیدہ ور کی ہے\n\nبطحا کے تاج دار کی چوکھٹ پہ خم رہے\nعظمت اسی میں بندئہ عاجز کے سر کی ہے\n\nذرّہ ہے ایک اور ہزاروں تجلیات\nنورانیّت عجیب تری رہ گزر کی ہے\n\nجس کو کہ اختلاف ہو تیرے مزاج سے\nایسی بھی کوئی چال قضا و قدر کی ہے؟\n\nآتے تھے جس کی دید کو شہزادؔ جبرئیل\nگردش اسی کے واسطے شام و سحر کی ہے"
  },
  {
    "id": 122,
    "title": "نعت شریف",
    "description": "آئی ہے ہوا شہر پیمبر سے گزر کر\nیا حور چلی آتی ہے جنت سے اتر کر\n\nکھل جائے گی ذرّات مدینہ کی حقیقت\nاک آنکھ کو کر شمس ، تو اک آنکھ قمر کر\n\nآ پہنچا ہے اک بار تو اب لوٹ کے مت جا\nاب عمر اسی شہر منوّر میں بسر کر\n\nکیا چیز ہیں یہ پیرس و لندن کی فضائیں\nاک بار مری مان مدینے کا سفر کر\n\nشاید تری قسمت میں ہوں لمحات حضوری\nاس دیدئہ نمناک کو کچھ اور بھی تر کر\n\nاے یاد خدا! عشق نبی! ذکر مدینہ!\nسینے میں اتر ، روح میں آ ، قلب میں گھر کر\n\nرکھ اوڑھ کے ہر وقت ردا صلِّ علیٰ کی\nاے میری دعا خود کو شناسائے اثر کر\n\nمابین ہوں شہزادؔ میں اب بیم و رجا کے\nرکتا ہوں تو آداب سے چلتا ہوں تو ڈر کر"
  },
  {
    "id": 123,
    "title": "نعت شریف",
    "description": "ایسے ہو میری زیست کا ہر پل بسر حضور\nآنکھوں کے سامنے رہے طیبہ نگر حضور\n\nکیسے کروں میں آپ کے آگے کوئی سوال\nاٹھتی نہیں ہے شرم سے میری نظر حضور\n\nسائے میں اپنے لطف کے عاصی کو دیں پناہ\nبرہم ہے کچھ مزاج قضا و قدر حضور\n\nپھر ہے شب سیاہ کو تاروں کی احتیاج\nپھر سے جہاں میں بانٹیے شمس و قمر حضور\n\nدست کرم کے ہاتھ ہے دست تہی کی لاج\nیونہی نہ بیت جائیں یہ شام و سحر حضور\n\nمیرے بدن سے پھوٹنے لگتی ہے روشنی\nکرتا ہوں جب میں آپ کی جانب سفر حضور\n\nزائر دیار قدس کا جاتا ہے جس طرف\nرہتے ہیں ساتھ ساتھ یہ دیوار و در حضور\n\nمیری جبیں ہی لائق چوکھٹ نہ ہوسکی\nکرتے ہیں سجدہ آپ کو سنگ و شجر حضور\n\nدشت عرب کو آپ نے رشک چمن کیا\nہو جائے میری سمت بھی اب تو گزر حضور\n\nہوتا ہے اہل نعت میں شہزادؔ کا شمار\nکافی ہے مجھ کو عشق کا اتنا ثمر حضور"
  },
  {
    "id": 124,
    "title": "نعت شریف",
    "description": "ساری دنیا میں ہے شان سیّد سادات خوب\nحق نے محبوب دو عالم کی بنائی ذات خوب\n\nخواب میں بھی نعت ہی کہتا رہا ہوں آج میں\nیاد سرکار مدینہ میں کٹی ہے رات خوب\n\nحلم ، بندہ پروری ، اخلاص ، سچائی ، وفا\nاس مجسم حسن کی ہیں سب کی سب صفات خوب\n\nمہر و مہ تک ہو گئے جس کے اشارے سے گداز\nرشک دستِ دائودی ہے مصطفی کا ہاتھ خوب\n\nاللہ اللہ کیا زمیں ہے از مدینہ تا حطیم\nشہر مکہ اور منیٰ ، مزدلفہ و عرفات خوب\n\nاہل حج سے پوچھیے اک اک ادا کی کیفیات\nصفا و مروہ کی دوڑیں ، زم زم و میقات خوب\n\nہے عقیدہ عشق والوں کا ازل سے بس یہی\nآئیں جو محبوب کی جانب سے وہ آفات خوب\n\nآئینے شمس و قمر کے ، رشک افلاک و نجوم\nمیرے آقا کی گلی کے ہیں سبھی ذرّات خوب\n\nان کے اوصاف حمیدہ کا بیاں ممکن نہیں\nسرور کونین کی شہزادؔ ہے ہر بات خوب"
  },
  {
    "id": 125,
    "title": "نعت شریف",
    "description": "کونین کے سلطان ہیں سرکار مدینہ\nتسکین دل و جان ہیں سرکار مدینہ\n\nاللہ کا احسان ہیں سرکار مدینہ\nایماں ہے بدن جان ہیں سرکار مدینہ\n\nتکیہ ہے فقط آپ کے الطاف و کرم پر\nہم لوگ تو نادان ہیں سرکار مدینہ\n\nاللہ کے بعد آپ کا ہمسر نہیں کوئی\nکہنے کو تو انسان ہیں سرکار مدینہ\n\nہے آپ کی ہر ایک ادا مظہر فطرت\nچلتا ہوا قرآن ہیں سرکار مدینہ\n\nبے کس ہے جو لاچار ہے جس کا نہیں کوئی\nاس کا سر و سامان ہیں سرکار مدینہ\n\nشرمندہ یہی سوچ کے رہتا ہوں ہمیشہ\nشاہد میرے ہر آن ہیں سرکار مدینہ\n\nوابستہ ہوں شہزادؔ میں دربار نبی سے\nمیں دل ہوں تو ارمان ہیں سرکار مدینہ"
  },
  {
    "id": 126,
    "title": "نعت شریف",
    "description": "بے مثل ہے ہر وصف رسول عربی کا\nہو سکتا نہیں حسن بیاں میرے نبی کا\n\nچرچا ہے اسی نور مجسم کا عجم میں\nشیدا ہے عرب ہاشمی و مطلبی کا\n\nلیتا ہوں میں جب نام نبی اپنی زباں سے\nہوتا ہے گماں خود پہ مجھے بے ادبی کا\n\nاے شیریں دہن ، نوری بدن ، رحمت عالم\nہے تذکرہ حوروں میں تری بوالعجبی کا\n\nتڑپا ہوں بہت ہجر میں اے صاحب کوثر\nساماں ہو کوئی اب تو مری تشنہ لبی کا\n\nاے چارہ گر چارہ گراں! چارہ گری کر\nمعلوم نہیں ہوتا سبب بے سببی کا\n\nہو جائے مری روح پہ انوار کی بارش\nتکمیل کو پہنچے یہ سفر حق طلبی کا\n\nشہزادؔ تو ہے ہی ترے دربار کا شاعر\nدشمن بھی ہے مداح تری خوش لقبی کا"
  },
  {
    "id": 127,
    "title": "نعت شریف",
    "description": "’’تو کجامن کجا‘‘\nیہ میرے آقا کا لطف ہے کہ\n\nرواں ہے میرا قلم\nثناء کے رستے پہ\n\nعاجزی سے\nیہ ان کی رحمت کا ایک ادنیٰ سا\n\nمعجزہ ہے\nکہ مجھ سا بے بس ضعیف بندہ\n\nزبان مدحت میں کھولتا ہے\nیہ ان کی شفقت کہ\n\nنعت ذکر خفی کی صورت\nمرے رگ و پے میں\n\nرچ چکی "
  },
  {
    "id": 128,
    "title": "نعت شریف",
    "description": "یاد سرکار نے کیا لطف روا رکھا ہے\nاک مدینہ میرے سینے میں بسا رکھا ہے\n\nاہل عالم پہ کھلیں میرے معائب\nمیرے عصیاں کو درودوں نے چھپا رکھا ہے\n\nسیل آلام مجھے کب کا بہا لے جاتا\nمیری بگڑی کو شہِ دیں نے بنا رکھا ہے\n\nقمقمے مدحت سرکار کے روشن کرکے\nبزم افکار و تخیل کو سجا رکھا ہے\n\nروضۂ شہ کو خیالوں میں بسا کر ہم نے\nبام مژگاں پہ ستاروں کو ٹکا رکھا ہے\n\nناز کرتے ہیں سرعرش فرشتے اس پر\nجس کو سرکار نے قدموں میں بٹھا رکھا ہے\n\nجوش میں آئیں نہ کیوں بحر کرم کی موجیں\nشافع حشر نے ہاتھوں کو اٹھا رکھا ہے\n\nمیں یہ سوچوں گا مدینہ میں بہ فرط حیرت\nشاہ طیبہ نے مجھے پاس بلا رکھا ہے؟\n\nکتنا خوش بخت ہے شہزادؔ یہ لکڑی کا ستون\nجس کو سرکار نے سینے سے لگا رکھا ہے"
  },
  { "id": 129, "title": "تحیت", "description": "" }
]
