[
  {
    "id": 1,
    "title": "حمد باری تعالیٰ",
    "description": "ہونٹوں پہ مرے صبح و مسا حمد ہے تیری\nہر درد کی بے مثل دوا حمد ہے تیری\n\nکیا لفظ ہے الحمد لک الحمد الٰہی\nہر نعمت عظمیٰ کی جزا حمد ہے تیری\n\nتکبیر ہو تہلیل ہو تسبیح کہ تحمید\nلاریب یہ سب ذکر و ثنا حمد ہے تیری\n\nتو سرور کونین کا خالق ہے خدایا\nہر نعت نبی صلِّ علیٰ حمد ہے تیری\n\nکرتی ہیں ترا ذکر سمندر کی یہ لہریں\nگلشن میں عنادل کی صدا حمد ہے تیری\n\nکلیوں کی مہک باغ میں غنچے کا چٹکنا\nقمری کی سرِ شاخ نوا حمد ہے تیری\n\nمظہر ہیں ترے حسن کا بہتے ہوئے چشمے\nوادی کی سکوں بخش فضا حمد ہے تیری\n\nکرتی ہے ترا ذکر شب و روز کی گردش\nمہر و مہ و انجم کی ضیا حمد ہے تیری\n\nوالفجر ہو والشمس ہو والنّجم کہ اخلاص\nقرآن بھی اے ذات ورا حمد ہے تیری\n\nسینے میں دھڑکتا ہوا دل تیرا ثنا گو\nبندے کی بصد عجز دعا حمد ہے تیری\n\nباقی بھی تری ذات ہے قیوّم بھی تو ہے\nخوش بخت ہے جس لب پہ سدا حمد ہے تیری\n\nہر شعر تری حمد کا انعام ہے تیرا\nاک حمد کی جاں بخش جزا حمد ہے تیری\n\nشہزادؔ ترے نام کا ذاکر ہے ازل سے\nآئینہ الطاف و عطا حمد ہے تیری"
  },
  {
    "id": 2,
    "title": "حمد باری تعالیٰ",
    "description": "ذات قدیم صاحب ہر فخر و ناز ہے\nستاّر ہے صمد ہے وہی بے نیاز ہے\n\nرہتا ہے مہربان دو عالم پہ ہر گھڑی\nمیرا خدا کریم ہے ، بندہ نواز ہے\n\nجھکتے ہیں اس کے آگے ملک بھی رسول بھی\nسارا اسی کے واسطے عجز و نیاز ہے\n\nنغمہ سرائے حمد ہے بارش کی بوند بوند\nدستِ صبا میں اس کی عقیدت کا ساز ہے\n\nجلوہ گری اسی کی ہے نرگس کی آنکھ میں\nاس کے کرم سے کاکل سنبل دراز ہے\n\nوہ کھولتا ہے گنبد بے در میں کھڑکیاں\nدنیا میں اس کا لطف بلا امتیاز ہے\n\nکرتا ہے روز ایک نئی شان سے ظہور\nیہ اختلاف صبح و مسا اس کا راز ہے\n\nمعبود ہے مجید و معین و مغیث بھی\nمشکل کشا وہی ہے وہی کارساز ہے\n\nایاک نعبد کہیں ایاک نستعین\nمعراج بندگی کا ذریعہ نماز ہے\n\nلرزاں ہیں ارض و کوہ و فلک اس کے سامنے\nاللہ کا کلام بڑا جاں گداز ہے\n\nانوار اسم ذات کی تاثیر کے طفیل\nدل میں ہے کیف روح میں اک اہتزاز ہے\n\nجب موت ہے وسیلۂ دیدار ذات حق\nپھر آدمی کو موت سے کیوں احتراز ہے\n\nرہتے سدا ہیں اس کے خزانوں کے منہ کھلے\nہر لحظہ اس غنی کا در جود باز ہے\n\nپاتا ہے ذاتِ حق سے وہ توفیق نعت کی\nشہزادؔ اس کے فضل سے جو سرفراز ہے"
  },
  {
    "id": 3,
    "title": "حمد باری تعالیٰ",
    "description": "گر آنکھ سو بھی جائے تو کرتا ہے اپنا کام\nدل کو ہے اسم ذات سے کچھ ایسا التزام\n\nتسبیح خواں ہیں اس کے سمک تا سما سبھی\nہر دل میں اس کی یاد ہے ہر لب پہ اس کا نام\n\nقمری کے زمرے میں ہے تمجید کردگار\nکوئل کے لب پہ اس کا ترانہ ہے صبح و شام\n\nمسجودِ خشک و تر ہے وہی ذات لاشریک\nہے بحر و بر میں اس کی عبادت کا اہتمام\n\nدیتا ہوں اس کو آیۂ لا تقنطوا سے مات\nجب بھی مجھے ستائے ہے میرا خیال خام\n\nدر پیش آدمی کو ہے لغزش قدم قدم\nآتا ہے تھامنے کو کرم اس کا گام گام\n\nمبدا ہر ابتدا کا وہی ذات لایزال\nہر انتہا کا اس کی مشیّت پہ اختتام\n\nشہزادؔ جس کا حامی و ناصر ہو خود خدا\nرہتا نہیں وہ شخص زمانے میں بے مرام"
  },
  {
    "id": 4,
    "title": "حمد باری تعالیٰ",
    "description": "خدایا حاکم مطلق ہے تو ہر ایک عالم کا\nجھکا ہے سر تری سرکار میں ہر قیصر و جم کا\n\nگدائے بارگاہِ پاک ہوں ، مارا ہوا غم کا\nبھرم رہ جائے یا رحمن! میرے دیدئہ نم کا\n\nشبِ اسریٰ تری قدرت کے سب نے معجزے دیکھے\nستارہ بن کے ہر ذرہ زمیں کا عرش پر چمکا\n\nزمین و آسماں کا نور ہے تو خالق اکبر!\nتری عظمت کہ تو معبود ہے نورِ مجسم کا\n\nشرف ہر عبد کا ہے بندگی مولائے کل! تیری\nتری حمد و ثنا اعزاز ہے ہر ابن آدم کا\n\nقضا و قدر کی بنیاد ہے تیرے ارادوں پر\nنظام ہست و بود اظہار ہے اک امر محکم کا\n\nکھڑا خیمۂ افلاک حرف ’’کن‘‘ کی قوت سے\nیہ فرش خاک آئینہ ہے تدبیر منظم کا\n\nمدارِ زندگی ہے اک ترے ذکر مسلسل پر\nیہ دنیا چار دن کی ہے ، بھروسا کچھ نہیں دم کا\n\nمجھے شہزادؔ اس کے لطف کی امید رہتی ہے\nکہ میں بندئہ ناچیز اس رحمن و ارحم کا"
  },
  {
    "id": 5,
    "title": "حمد باری تعالیٰ",
    "description": "نفس امّارہ نے جب طوفاں کوئی برپا کیا\nرحمتِ غفاّر نے بڑھ کر اسے سیدھا کیا\n\nمالک کونین ہے وہ خالقِ ہر خشک و تر\nماہ و ماہی کو اسی خلاّق نے پیدا کیا\n\nہر گھڑی آفاق میں ہے لطف و رحمت کا ورود\nاس کے بے پایاں کرم نے خلق کو شیدا کیا\n\nاللہ اللہ پیکر خاکی کو یہ بخشا شرف\nاس نے آدم کو خلیفہ دہر میں اپنا کیا\n\nسورئہ والنجم کی آیات سے ہے یہ عیاں\nعرش پر دیدارِ حق آقا نے بے پردہ کیا\n\nدی شہادت خود خدا نے کہہ کے مازاغ البصر\nآپ بلوا کر نبی کو فائز ’’اَوحٰی‘‘ کیا\n\nرافع ذکرِ نبی ہے خود خدائے ذوالجلال\nمصطفی کے ذکر کو مولا نے خود اونچا کیا\n\nہوگی عالی شان اے شہزادؔ کس درجہ وہ ذات\nاپنے اک بندے کو جس نے خلق کا مولا کیا"
  },
  {
    "id": 6,
    "title": "حمدومناجات",
    "description": "(عربی سے ترجمہ)\nامام محمد بن ادریس الشافعیرحمتہ اللہ علیہ\n\nمرا دل اے مرے مولا ہے عاشق تیری رحمت کا\nوہ روز و شب ہوں یا عالم ہو خلوت اور جلوت کا\n\nجو کچی اور پکی نیند میں پہلو بدلتا ہوں\nتو تیری یاد کو روح و نفس کے بیچ پاتا ہوں\n\nترا عرفان میرے قلب پر احسان ہے تیرا\nکہ اے اللہ تو ہے نعمتوں اور پاکیوں والا\n\nمرے عصیاں اگرچہ سب کے سب تھے علم میں تیرے\nنہ رسوا مجھ کو فرمایا، سبب میرے گناہوں کے\n\nمجھے بھی صالحیں میں کر شمار اور مجھ پہ کر احساں\nنہ مجھ پر ڈال جب ہو امرِ دینی میں کوئی خلجاں\n\nیہاں بھی اور وہاں بھی میرے اوپر مہرباں رہنا\nبروز حشر ’’آیات عبس۱‘‘ میں جو ہے وہ کرنا"
  },
  {
    "id": 7,
    "title": "حمد باری تعالیٰ",
    "description": "صبر ، انکسار، شکر ، صداقت ، کرم ، سخا\nکرتی ہیں یہ صفات ہی بندے کو حق نما\n\nکرتا ہے رزق مسلم و منکر کو وہ عطا\nکس درجہ ساری خلق پہ ہے مہرباں خدا\n\nرہتے ہیں ذوالجلال کے جلووں میں گم سدا\nآئینۂ صفاتِ الٰہی ہیں اولیا\n\nسیراب ہیں لطائف خمسہ کی کھیتیاں\nہے نور بار عالمِ لاہوت کی گھٹا\n\nدربار ذوالجلال میں ہوتی ہے باریاب\nمظلوم کے لبوں سے نکلتی ہے جو دعا\n\nکرتا ہے وہ قدیر ہی ذرّے کو آفتاب\nصرصر کو لمحہ بھر میں بناتا ہے جو صبا\n\nمدّاح اس کے سرو و سمن شاخ و برگ و بار\nتسبیح گو ہیں اس کے سبھی ارض تا سما\n\nمولا کی بارگاہ سے ہوتی نہیں ہے ردّ\nبندہ کرے حضوری دل سے جو التجا\n\nشہزادؔ اس کی حمد کا یارا بھلا کسے\n’’لااُحصی‘‘ جس کی حمد میں کہتے ہیں مصطفی"
  },
  {
    "id": 8,
    "title": "حمد باری تعالیٰ",
    "description": "جو صحنِ جاں میں ہوائے حریم پاک چلے\nرہِ کرم پہ ہمیشہ یہ مشتِ خاک چلے\n\nفرشتے رحمتیں لے کر تری اترتے رہیں\nنوازشات کی یونہی جہاں میں ڈاک چلے\n\nمرے خدا مجھے اپنی پناہ میں رکھنا\nترے جلال کی آندھی جو ہولناک چلے\n\nکریم تیرے کرم کا مجھے سہارا ہے\nیہ نفس جب بھی چلے چال خوفناک چلے\n\nترے جلال کا تھا عکس ان کے لہجے میں\nترے شہید بٹھا کر جہاں پہ دھاک چلے\n\nخدا کی رحمتیں بھی ہم رکاب تھیں شہزادؔ\n’’جو سوئے عرش معلیٰ رسولِ پاک چلے‘‘"
  },
  {
    "id": 9,
    "title": "حمد باری تعالیٰ",
    "description": "وہ صاحب کن ، مالک کل ، خالقِ انوار\nوہ قادر مطلق ہے ہر اک چیز کا مختار\n\nرحمن و رحیم اور ہے سبحان و صمد بھی\nقہار ہے جبار ہے ستار ہے غفار\n\nپروان چڑھاتا ہے وہ دانے کو زمیں میں\nاور اس کو بناتا ہے وہی نخل ثمر بار\n\nتسبیح میں مشغول ہیں اس کی مہ و ماہی\nالحمد کا قائل ہے وہی حمد کا حق دار\n\nہر عکس ہے آئینۂ اوصافِ مصور\nیہ ارض و فلک صنعتِ باری کا ہیں شہکار\n\nخلاّقِ دو عالم کی تجلیّ کا ہیں پر تو\nمچھلی ہو سمندر میں کہ ہو مہرِ ضیا بار\n\nہے معجزئہ حسن ہر اک منظر فطرت\nتفسیر ہیں جنت کی چمن ، چشمہ و کہسار\n\nآباد ہر اک دشت میں حیرت کا جہاں ہے\nاسرار و معارف کا دبستاں ہے چمن زار\n\nاک واسطہ ہے بندہ و معبود کے مابین\nوہ باعث کن منبع و سرچشمۂ انوار\n\nہیں نغمہ گر حمد و ثنا بحر کی موجیں\nاور وجد کے عالم میں گل و غنچہ و اشجار\n\nمعراج ہے شہزادؔ یہی میرے ہنر کی\nہوں واصفِ خلاّق جہاں ، ناعتِ سرکار"
  },
  {
    "id": 10,
    "title": "حمد باری تعالیٰ",
    "description": "وہی لوگ لائق رشک ہیں جو یہ کام خیر سے کر گئے\nوہ جوعازمین حرم ہوئے وہ جو اپنے مولا کے گھر گئے\n\nجو نگاہِ لطف و کرم ہوئی سبھی گرد روح کی چھٹ گئی\nلیا اسمِ ذات عظیم جب تو خمار سارے اتر گئے\n\nدیا لطف خوب صیام نے مجھے یوں نوازا قیام نے\nتہہِ جسم جتنے نقوش تھے اسی روشنی سے نکھر گئے\n\nہے صدا کلام قدیم کی کہ چھڑا ہے نغمۂ دائودی\nاسی سیل نور سے نفس کے سبھی تار و پود بکھر گئے\n\nوہ قسم خدا کی شہید ہیں وہ قریبِ رب مجید ہیں\nجو رہِ وفا پہ چلے سدا جو خدا کے نام پہ مر گئے\n\nہے خدا کا حکم ادب سے آ وہاں سر جھکا کے تو رہ کھڑا\n’’وہ جہاں جہاں بھی ٹھہر گئے وہ جہاں جہاں سے گزر گئے‘‘\n\nجو ہیں جان و دل سے محمدی وہی اولیاء ہیں مجدّدی\nجو خدا کے سامنے جھک گئے جو خدا کے غیض سے ڈر گئے"
  },
  {
    "id": 11,
    "title": "حمد باری تعالیٰ",
    "description": "گئے گزروں کو آخر بندگی کرنے کا ڈھب آیا\n’’گنہگاروں کے ہونٹوں پر درود پاک جب آیا‘‘\n\nحصارِ نورِ اسم ذات جس دل کو ہوا حاصل\nقریب اس دل کے کوئی خطرئہ ابلیس کب آیا\n\nکوئی قرآن کی آیت ہو یا ارشادِ قدسی ہو\nزبان مصطفی سے ہو کے ہی فرمانِ رب آیا\n\nقیامت تک ہے دنیا میں یہی اللہ کی رسی\nلیے قرآن جگ میں اک نرالی تاب و تب آیا\n\nکہیں ’’والنجّم‘‘ کی صورت کہیں ’’والطاّرق‘‘ کہہ کر\nقسم فرمائی اس محبوب کی جو وقت شب آیا\n\nنہ خالی لوٹ کر جائے در الطاف سے تیرے\nترا بندہ ترے در پر الٰہی جاں بلب آیا\n\nسر بزمِ جناں حمد و ثنا کے لے کے نذرانے\nکہا احباب نے وہ دیکھئے شہزادؔ اب آیا"
  },
  {
    "id": 12,
    "title": "حمد باری تعالیٰ",
    "description": "کہاں کے یہ زبان و لب مرا رنگِ ثنا کیا ہے\nیہ حسنِ صوت یہ طرز بیاں ، فکرِ رسا کیا ہے\n\nجمال خالق یکتا کا مظہر ہیں سبھی منظر\n’’یہ کلیاں ، پھول ، غنچے ، رنگ و بو ، موجِ صبا کیا ہے‘‘\n\nزمین و آسماں ، یہ بحر و بر ، مہر و مہ و انجم\nبس ان کو دیکھ لو اور جان لو شانِ خدا کیا ہے\n\nعنایت ہے تری فیضان ہے جود و کرم تیرا\nمرے دامن میں میرا اے مرے ربِّ عُلا کیا ہے؟\n\nخدا کے نام پر جس نے فدا کی زندگی اپنی\nکھلا اس بندئہ حق پر فنا کیا ہے ، بقا کیا ہے\n\nتشکرّ ، انکساری ، عاجزی ، گریہ ، پشیمانی\nنہیں ہے بندگی تو پھر مناجات و دعا کیا ہے\n\nیہ ابھرا مطلعٔ باطن سے کس کے نام کا سورج\nیہ کس کے فیضِ وحدت نے بھلایا ماسوا کیا ہے\n\nیہ میرے حجرئہ قلب حزیں میں کون رہتا ہے\nدلِ شہزادؔ سے جو اٹھ رہی ہے یہ صدا کیا ہے"
  },
  {
    "id": 13,
    "title": "حمد باری تعالیٰ",
    "description": "اک عہد بے مثال ہے اِیَّاکَ نَعْبُدُ\nتمجید ذوالجلال ہے اِیَّاکَ نَعْبُدُ\n\nاِیَّاکَ نَسْتَعِیْن ہے مقصودِ اہل دل\nمنشورِ اہلِ حال ہے اِیَّاکَ نَعْبُدُ\n\nدیباچۂ کتاب الٰہی ہے فاتحہ\nاور مرکزی خیال ہے اِیَّاکَ نَعْبُدُ\n\nوحی الٰہ بھی ہے یہ قولِ ثقیل بھی\nپیغامِ لازوال ہے اِیَّاکَ نَعْبُدُ\n\nاس سے عیاں قرینۂ اظہارِ بندگی\nتکمیلِ حال و قال ہے اِیَّاکَ نَعْبُدُ\n\nمنزل بھی راستہ بھی عقیدہ بھی ذکر بھی\nہر طور نیک فال ہے اِیَّاکَ نَعْبُدُ\n\nتقریب وصلِ عابد و معبود ہے نماز\nکیفیتِ وصال ہے اِیَّاکَ نَعْبُدُ\n\nدنیا و آخرت میں مسلمان کے لیے\nتمہیدِ ہر کمال ہے اِیَّاکَ نَعْبُدُ\n\nپوشیدہ ان حروف میں ہے روح بندگی\nقرآن کا جمال ہے اِیَّاکَ نَعْبُدُ\n\nہے سرمدی سرود یہ فرمان لَمْ یَزِلْ\nبرتر زِ ماہ و سال ہے اِیَّاکَ نَعْبُدُ\n\nجاتا ہے جو صفات سے موصوف کی طرف\nوہ جادئہ وصال ہے اِیَّاکَ نَعْبُدُ\n\nورد زبانِ بوذر و سلمان و مرتضیٰ\nذوقِ دلِ بلال ہے اِیَّاکَ نَعْبُدُ\n\nبندہ ہوا ہے فائزِ معراج بندگی\nکیا خوب اشتغال ہے اِیَّاکَ نَعْبُدُ\n\nنسخہ یہ ہے حصول فیوض و فلاح کا\nسرکوب ہر وبال ہے اِیَّاکَ نَعْبُدُ\n\nدل سے نکالتا ہے غم روزگار کو\nہاں دافعِ ملال ہے اِیَّاکَ نَعْبُدُ\n\nالحمد کے بیاں سے والاالضالین تک\nاک نقطۂ کمال ہے اِیَّاکَ نَعْبُدُ\n\nشہزادؔ کو نصیب ہو مولا وہ بندگی\nجس بندگی پہ دال ہے اِیَّاکَ نَعْبُدُ"
  },
  {
    "id": 14,
    "title": "حمد باری تعالیٰ",
    "description": "قرآن کی زبان میں ہوں محو گفتگو اِیَّاکَ نَعْبُدُ\nگویا ہوئے ہیں عابد و معبود روبرو اِیَّاکَ نَعْبُدُ\n\nحاضر ہوں دست بستہ تری بارگاہ میں لے لے پناہ میں\nآیا ہوں کرکے آج میں اشکوں سے پھر وضو اِیَّاکَ نَعْبُدُ\n\nسب رحم کرنے والوں سے بڑھ کر ہے تو رحیم اے قادرِ کریم\nبھر دے مئے فیوض سے میرا بھی اب سبو اِیَّاکَ نَعْبُدُ\n\nتجھ کو ہے میرے باطنی احوال کی خبر اے خالق بصر\nتجھ پر عیاں خلوص مرا میری جستجو اِیَّاکَ نَعْبُدُ\n\nدرکار پھر ہے روح کو تطہیر کا عمل اے رب لم یزل\nپھر قلب کو عطا ہو وہی ذوق آرزو اِیَّاکَ نَعْبُدُ\n\nدشت و چمن میں تیری ہی قدرت کے رنگ ہیں سب لوگ دنگ ہیں\nجاری ہے ہر گھڑی تری رحمت کی آ بجو اِیَّاکَ نَعْبُدُ\n\nکیسا یہ اسم ذات کے حرفوں میں نور ہے کیف و سرور ہے\nمستی میںجھوم جائے ہے ہر موجۂ لہو اِیَّاکَ نَعْبُدُ\n\nسجدے کو بے قرار تھی شہزادؔ کی جبیں اے اصل ہر حسیں\nجونہی سنا تھا امر ترا اس نے ’’اسجدوا‘‘ اِیَّاکَ نَعْبُدُ"
  },
  {
    "id": 15,
    "title": "حمد باری تعالیٰ",
    "description": "تو خالقِ عظیم ہے اِیَّاکَ نَسْتَعِیْنُ\nتو قادر و کریم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nہم غرق معصیت ہیں مگر اے غفور تو\nہر حال میں رحیم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nتو مبدی و معید ہے قیوّم و ذوالجلال\nسبحان ہے علیم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nفانی ہر ایک چیز ہے اس کائنات کی\nتو باقی و قدیم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nفریاد رس ہے آدم و نوح و خلیل کا\nتو مرجعِ کلیم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nتیرا جمال غنچہ و گل سے ہے ضوفشاں\nتو باری و کلیم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nانعام جن پہ تو نے کیا ان کا راستہ\nبس راہِ مستقیم ہے اِیَّاکَ نَسْتَعِیْنُ\n\nشہزادؔ کو حضور کے صدقے میں ہو نصیب\nجو جنتِ نعیم ہے اِیَّاکَ نَسْتَعِیْنُ"
  },
  {
    "id": 16,
    "title": "حمد باری تعالیٰ",
    "description": "کتاب حکمت و دانش کی ابتدا ادراک\nخدائے لوح و قلم کا کرم عطا ادراک\n\nمیانِ عابد و معبود رابطے کی سبیل\nحصولِ فیضِ الٰہی کا واسطہ ادراک\n\nہنر دیا ہے اسی نے قلم چلانے کا\nاسی کا فضل ہیں علم ، آگہی ، نوا ، ادراک\n\nدل بشر پہ وہ کرتا ہے منکشف اسرار\nہے اس کے لطف و نوازش کا سلسلہ ادراک\n\nشہِ رسل کی حقیقت سے آشنا ہے وہی\nاور اس کی ذات کا رکھتے ہیں مصطفی ادراک\n\nزمین روح پہ برسا کے بارشِ الہام\nمجھے بھی بخش دے اپنا مرے خدا ادراک\n\nفضائے حمد میں شہزادؔ جب بھی سانس لیا\nتجلّیات سے معمور ہو گیا ادراک"
  },
  {
    "id": 17,
    "title": "حمد باری تعالیٰ",
    "description": "صبح دم جب کسی طائر کی صدا آتی ہے\nلب پہ بے ساختہ بس حمد خدا آتی ہے\n\nپھرنے لگتے ہیں مری آنکھ میں میزاب و حطیم\nیاد جب صحن مقدس کی فضا آتی ہے\n\nکوئی فن اور ہنر پاس نہیں ہے میرے\nتیرے محبوب کی بس حمد و ثنا آتی ہے\n\nمشکلیں جب کہیں آتی ہیں سر راہِ حیات\nدستگیری کو وہیں تیری عطا آتی ہے\n\nامت خیر مجسم کو بھی ہو خیر نصیب\nہر گھڑی لب پہ یہی ایک دعا آتی ہے\n\nساتھ لے آتی ہے محراب حرم کی خوشبو\nجب مدینے سے کوئی موج صبا آتی ہے\n\nخواہشِ نفس کا شہزادؔ چھٹے دل سے غبار\nتب کہیں جا کے سمجھ شانِ خدا آتی ہے"
  },
  {
    "id": 18,
    "title": "حمد باری تعالیٰ",
    "description": "بخش مولا مرے دل کو بھی وہی سوز و گداز\nجس خشیت سے مشرف تھے کبھی اہل حجاز\n\nجس کی ہر ضرب میں ہوتا ہے نہاں نغمۂ حق\nاسی مضراب کا طالب ہے مری روح کا ساز\n\nذوق سجدہ بھی عطا ہو مری پیشانی کو\nتیری محراب میں خم ہو یہ مرے بندہ نواز\n\nمانگتا ہوں ترے دربار سے مولا میں بھی\nجو دمکتا ہے جبینوں میں وہی عجز و نیاز\n\nدامن شافع محشر ہے مرے ہاتھوں میں\nمغفرت کو میری کافی ہے یہی ایک جواز\n\nیہ بھی تیری ہی عنایات کا اک پہلو ہے\n’’دل کے پردوں میں مچلتی ہے تمنائے حجاز‘‘\n\nتیری توفیق سے اٹھتے ہیں خودی کے پردے\nتیری تائید سے ہوتے ہیں عیاں ذات کے راز\n\nیہ سمجھنا ہو تو پتوں کی لکیریں دیکھو\nکیسے جاتی ہے حقیقت کی طرف راہِ مجاز\n\nمجھ سے عاصی کو بھی محبوب سے نسبت بخشی\nبس اسی ایک نوازش پہ ہے شہزادؔ کو ناز"
  },
  {
    "id": 19,
    "title": "حمد باری تعالیٰ",
    "description": "دلِ تیرہ کو چمکائوں مجھے توفیق دے مولا\nتجھے میں یاد کر پائوں مجھے توفیق دے مولا\n\nمری سانسیں ترے اسمِ گرامی سے معطر ہوں\nمشامِ جاں کو مہکائوں مجھے توفیق دے مولا\n\nفساد و شر سے میں فرش زمیں کو صاف کر ڈالوں\nہمیشہ امن پھیلائوں مجھے توفیق دے مولا\n\nمرے قول و عمل سے کوئی دل زخمی نہ ہو یا رب\nسراپا خیر بن جائوں مجھے توفیق دے مولا\n\nسلیقہ دے مرے مالک مجھے حسن تکلم کا\nزباں سے پھول برسائوں مجھے توفیق دے مولا\n\nکہوں حق بات میں دربار میں سلطانِ جابر کے\nمیں ہر باطل سے ٹکرائوں مجھے توفیق دے مولا\n\nمرا دشمن بھی میری راہ میں کانٹے بچھائے تو\nمیں اس پر پھول برسائوں مجھے توفیق دے مولا\n\nتعلق مستقل ہو جائے یوں ارضِ مدینہ سے\nترے گھر بار بار آئوں مجھے توفیق دے مولا\n\nتری تائید کا ہر وقت ہو سر پر مرے سایہ\nمیں مشکل میں نہ گھبرائوں مجھے توفیق دے مولا\n\nیہاں بھی لوگ پہچانیں مجھے تیرے حوالے سے\nوہاں بھی تیرا کہلائوں مجھے توفیق دے مولا\n\nتری حمد و ثنا شہزادؔ کے قلب و زباں پر ہو\nمیں تیرے گیت بس گائوں مجھے توفیق دے مولا"
  },
  {
    "id": 20,
    "title": "حمد باری تعالیٰ",
    "description": "ہر وقت رہے دل میں تری یاد الٰہی\nیہ شہر ہمیشہ رہے آباد الٰہی\n\nمغلوب نہ ہو جائوں کہیں نفس کے ہاتھوں\nہر حال میں درکار ہے امداد الٰہی\n\nدل میں ہے ترے دین کی خدمت کی تمنا\nمقصود نہیں مسندِ ارشاد الٰہی\n\nبس لاج سرِ حشر گنہگار کی رکھنا\nہو جائے نہ محنت کہیں برباد الٰہی\n\nمیرے کسی دشمن کو بھی تکلیف نہ پہنچے\nمیرے سبھی احباب رہیں شاد الٰہی\n\nہر شعر سے مطلوب فقط تیری رضا ہو\nمٹ جائے دلوں سے ہوس داد الٰہی\n\nآباء کو مرے بخش دے اے بخشنے والے\nقائم رہے دیں پر مری اولاد الٰہی\n\nہے خوار و زبوں سرورِ کونین کی اُمت\nفریاد ہے فریاد ہے فریاد الٰہی\n\nتو ارض و سمٰوٰت کا خالق ہے خدایا\nیہ دشت و جبل ہیں تری ایجاد الٰہی\n\nتخلیق تو تو نے ہی کئے ہیں یہ عناصر\nوہ آب ہو یا خاک ہو یا باد الٰہی\n\nتو نے ہی بنایا اسے فِیْ اَحْسَنْ تقویم\nانساں تو ہے مجموعۂ اضداد الٰہی\n\nکھاتے ہیں ترا رزق سبھی کافر و مسلم\nتو مالک کل اجودِ اجواد الٰہی\n\nحق تیری عبادت کا ادا ہو نہیں سکتا\nجتنی بھی عبادت کرے شہزادؔ الٰہی"
  },
  {
    "id": 21,
    "title": "حمد باری تعالیٰ",
    "description": "مرا سرمایۂ ہستی تری حمد و ثنا مولا\nتری توفیق سے پایا یہ گنج بے بہا مولا\n\nتو لامحدود میں محدود کیا تعریف ہو مجھ سے\nنہ تیری ابتدا مولا نہ تیری انتہا مولا\n\nدل بے تاب کی تسکیں ہے تیری یاد میں یا رب\nترے تذکار کی لذت ہے کتنی جاں فزا مولا\n\nمیں کیسے مان لوں رسوا کیا جائے گا محشر میں\nترے محبوب کا جو شخص ہو مدحت سرا مولا\n\nجزا کے دن تو اس خوش بخت کو کتنا نوازے گا\nتری خاطر خفا سارے جہاں سے جو رہا مولا\n\nازل سے کر رہے تھے جستجو تیری جہاں والے\nبتایا ہے ترے محبوب نے تیرا پتا مولا\n\nتری توحید پر اہل جہاں ایمان لے آئے\nتری برہان بن کر آ گئے جب مصطفی مولا\n\nتری صنعت کا ہیں شہکار یہ مہر و مہ و انجم\nتری قدرت کے ہیں عکاّس یہ ارض و سما مولا\n\nطواف کعبۂ اقدس کی پھر توفیق دے مجھ کو\nحریم جاں میں بھی اک دلنشیں کعبہ بنا مولا\n\nکرم شہزادؔ پر فرما بھی دے اے قادِر مطلق\nکھڑا ہے ہاتھ پھیلائے ترے در پر گدا مولا"
  },
  {
    "id": 22,
    "title": "حمد باری تعالیٰ",
    "description": "گو جدا ہاتھ سے قلم نہ ہوا\nتیرا اک وصف بھی رقم نہ ہوا\n\nکون سی شب تھی فضل سے خالی\nکون سے دن ترا کرم نہ ہوا\n\nیہ بھی تیری ہی مہربانی ہے\nمیں جو مشغول کیف و کم نہ ہوا\n\nسر وہ کس کام کا بھلا یا رب\nتیری دہلیز پر جو خم نہ ہوا\n\nجب سے بخشی ہے بندگی تو نے\nدل کبھی مائل حشم نہ ہوا\n\nجب سے ’’لَاتَقْنَطُوْ‘‘ کہا تو نے\nکوئی دکھ درد رنج غم نہ ہوا\n\nمیں مدینے میں مر تو سکتا ہوں\nگو وہاں پر مرا جنم نہ ہوا\n\nاس کو بھی اپنا گھر دکھا مولا\nجو کبھی مائل حرم نہ ہوا\n\nگو کہ ہوں لاالٰہ کا قائل\nمجھ سے اک بت بھی منہدم نہ ہوا\n\nاپنی خواہش کا میں پجاری ہوں\nمجھ سے تسخیر یہ صنم نہ ہوا\n\nدرج شہزادؔ جو ہے قرآں میں\nکوئی بھی امر کالعدم نہ ہوا"
  },
  {
    "id": 23,
    "title": "حمد باری تعالیٰ",
    "description": "میٹھی نیند سلاتا ہے تو\nدن کو ہمیں جگاتا ہے تو\n\nچیر کے سینہ ظلمت شب کا\nنیا سویرا لاتا ہے تو\n\nاپنی حمد کے نغمے مولا\nخود ہی ہمیں سناتا ہے تو\n\nاپنا ہر دم آپ تعارف\nبندوں سے کرواتا ہے تو\n\nپھر بھی تو بے رنگ ہے مولا\nگو سب رنگ بناتا ہے تو\n\nاپنی جانب آنے والے\nرستے سب سمجھاتا ہے تو\n\nکس حسن تدبیر سے یا رب\nکائنات چلاتا ہے تو\n\nگلشن گلشن پھول کھلا کر\nروئے ارض سجاتا ہے تو\n\nتو رحمن رحیم خدایا\nمشکل میں کام آتا ہے تو\n\nتو دیتا ہے سب کو روزی\nسب منگتے ہیں داتا ہے تو\n\nتیرے نام کا ورد رکھے جو\nاس کی شان بڑھاتا ہے تو\n\nجل تھل ہو جاتی ہے دھرتی\nبارش جب برساتا ہے تو\n\nہوتی ہے جس وقت ضرورت\nمیرا رزق بڑھاتا ہے تو\n\nپیاس لگے جب صحرائوں کو\nپانی انہیں پلاتا ہے تو\n\nتیرا در میں کیسے چھوڑوں\nمیرے من کو بھاتا ہے تو\n\nتجھ سے ہے ایماں کی حرارت\nجذبوں کو گرماتا ہے تو\n\nکسی کسی کو پاس بلا کر\nاپنا آپ دکھاتا ہے تو\n\nتو ہے ہفت افلاک کا خالق\nسورج شرق سے لاتا ہے تو\n\nہو شہزادؔ پہ فضل الٰہی\nاَرْحَم خود کہلاتا ہے تو"
  },
  {
    "id": 24,
    "title": "حمد باری تعالیٰ",
    "description": "رُوبرو ہے حرم تیری توفیق سے\nدر پہ حاضر ہیں ہم تیری توفیق سے\n\nلائقِ بارگاہِ کرم ہم نہ تھے\nہو گیا ہے کرم تیری توفیق سے\n\nدُھل گئے سب گناہوں کے د فتر یہاں\nہو گئی آنکھ نم تیری توفیق سے\n\nملتزم سے لپٹنے کی تھی آرزو\nرہ گیا ہے بھرم تیری توفیق سے\n\nپاس آئے نہیں دل کو بھائے نہیں\nاہل جاہ و حشم تیری توفیق سے\n\nتیرے دامانِ رحمت سے لپٹے ہیں ہم\nتیرے فضل و کرم تیری توفیق سے\n\nعشق ہے سرزمینِ عرب سے ہمیں\nگو ہیں اہل عجم تیری توفیق سے\n\nمجھ گنہگار کے ناتواں ہاتھ میں\nآج ہے مُلْتَزِمْ تیری توفیق سے\n\nقید خواہش سے تو نے کیا ہے رہا\nٹوٹے دل کے صنم تیری توفیق سے\n\nسب مسافر سفر کی تھکن بھول کر\nہو گئے تازہ دم تیری توفیق سے\n\nبوسۂ سنگ اسود کی تاثیر نے\nسب بھلائے ہیں غم تیری توفیق سے\n\nمیں کھڑا ہوں مقام براہیم پر\nہو کے ملت میں ضم تیری توفیق سے\n\nسعی کرتے ہوئے دل سے جاتا رہا\nخطرئہ بیش و کم تیری توفیق سے\n\nروح گویا حرم کی فضائوں میں ہے\nہے یہ نعمت بہم تیری توفیق سے\n\nآب زمزم کا ساغر لیا ہاتھ میں\nبھول کر جامِ جم تیری توفیق سے\n\nآئے بیٹھے ہیں اہل نظر دید کو\nمیں ہوا محترم تیری توفیق سے\n\nجاں سے جاتی ہے گردِ حرم گھوم کر\nفکرِ بود و عدم تیری توفیق سے\n\nمیں نے قربان خود کو منیٰ میں کیا\nمٹ گئے سب الم تیری توفیق سے\n\nتو نے بخشا ہے شہزادؔ کو یہ ہنر\nچل رہا ہے قلم تیری توفیق سے"
  },
  {
    "id": 25,
    "title": "حمد باری تعالیٰ",
    "description": "سوزِ حفیظؔ دے مجھے ذوق ندیمؔ دے\nفکرِ رسا نواز دے قلبِ سلیم دے\n\nخیرات من لدن کی مجھے اے علیم دے\nحینِ حیات یوں مجھے خلدِ نعیم دے\n\nتو ذائقہ چکھا مجھے اپنی صفات کا\nاپنے کرم سے کچھ تو مجھے بھی کریم دے\n\nمجھ کو بھی شہرِ علم کی خیرات ہو نصیب\nمولا مجھے بھی فہمِ الف لام میم دے\n\nہو جائے لطف خاص ظلوم و جہول پر\nاس بے ہنر کو جوہر نطقِ کلیم دے\n\nرب جہاں سناؔئی و عطارؔ کے طفیل\nجینے کے واسطے کوئی مقصد عظیم دے\n\nہر قلب کو نصیب ہو ذوق دل بلال\nبوذر کا جس میں رنگ ہو ایسی گلیم دے\n\nکس درجہ مہربان ہے انسانیت پہ تو\nجذبہ یہ آدمی کو بھی ربِّ رحیم دے\n\nہم سانس لے رہے ہیں فضائے کثیف میں\nباغ حبیب کی ہمیں مولا شمیم دے\n\nیہ آخری دہائی ہے ماہ صیام کی\nپیغامِ رُستگاریِ نارِ جحیم دے\n\nتیرے نبی کی نعت کے ہمراہ اے جلیل\nلکھتا رہوں میں حمد یہ عزمِ صمیم دے\n\nشہزادؔ کے لیے یہ اثاثہ ہے بے بہا\nحکمت کے مجھ کو لعل و گہر اے حکیم دے"
  },
  {
    "id": 26,
    "title": "حمد باری تعالیٰ",
    "description": "صل علیٰ کا ذکر ہے حمد و ثنا کے بعد\n’’اک مصطفی کا نام ہے نامِ خدا کے بعد‘‘\n\nہو گا نصیب خُلد میں روزِ جزا کے بعد\nملتا ہے جو سرور خدا کی رضا کے بعد\n\nکرتا ہے التفات وہ لطفِ مزید سے\nعرضی جو بھیجتا ہوں نئی ہر دعا کے بعد\n\nسنتا ہے سب کی عرض سمیع و بصیر خود\nگو سیلِ التجا ہے ہر اک التجا کے بعد\n\nجائے گا اس کے پاس جو توبہ کیے بغیر\nہوگا بری عذاب سے لیکن سزا کے بعد\n\nتواب ہے وہ ذات غفور و رحیم ہے\nبخشش کی ہے امید اسی سے خطا کے بعد\n\nکعبہ کے اردگرد فضائے مطاف میں\nرحمت کا سلسلہ تھا کرم کی ہوا کے بعد\n\nوقت اجل بھی حمد کی توفیق ہو مجھے\nمدح نبی ہو لب پہ ثنائے خدا کے بعد\n\nشہزادؔ کر وسیلۂ صدّیق اختیار\nپہلے امام تو ہیں وہی مصطفی کے بعد"
  },
  {
    "id": 27,
    "title": "حمد باری تعالیٰ",
    "description": "خدا گر نہ توفیق دے بندگی کی\nنہیں پھر ضرورت ہمیں زندگی کی\n\nوہ کیا آشنا ہو گا عرفان حق سے\nنہیں جس نے لذت چکھی بے خودی کی\n\nکہا حق نے محبوب ہے بس وہ میرا\nکرے گا اطاعت جو میرے نبی کی\n\nجہاں بھر میں ہے دربدر قوم مسلم\nالٰہی ہیں تصویر ہم بے بسی کی\n\nمیسر ہو اب فتحِ باب ہدایت\nنہیں کوئی حد اپنی بے رہروی کی\n\nخدایا! یہاں خضر و مہدی کئی ہیں\nفزوں تر ہے لیکن روش گمرہی کی\n\nکھلے پھر سے مولا چمن آرزو کا\nچلیں پھر ہوائیں یہاں آشتی کی\n\nسحر دم جو تجھ سے کریں التجائیں\nہوں مقبول یا رب دعائیں سبھی کی\n\nخدا جس کا شہزادؔ ہو آپ ہادی\nنہیں اس کو حاجت کسی رہبری کی"
  },
  {
    "id": 28,
    "title": "حمد باری تعالیٰ",
    "description": "خدایا رحم فرما سیدِّ کونین کا صدقہ\nہماری جھولیاں بھر سیدِّ دارین کا صدقہ\n\nعطا ہو سائلوں کو بارگاہِ پاک سے کچھ تو\nرفیقِ غار یعنی ثانیِ اثنین کا صدقہ\n\nجلالت بخش دے فاروق اعظم کے وسیلے سے\nسخاوت کر عطا عثمانِ ذوالنورین کا صدقہ\n\nعلوم حیدر کرّار سے حصہ ملے ہم کو\nعلی کے نام سے پہلے ہے جو اُس عین کا صدقہ\n\nکروں خدمت میں تیرے دین کی دن رات یا مولا\nیہ ہمت دے رسولُ اللہ کی نعلین کا صدقہ\n\nبفیض سیّدہ زہرا حیا و شرم دے ہم کو\nحمیّت ہو عطا اس قوم کو حسنین کا صدقہ\n\nمرا سینہ بھی نور حکمت و عرفان سے بھر دے\nالٰہی اہل بیتِ مصطفی سبطین کا صدقہ\n\nبچا راہِ صفا کی مشکلوں سے اور خطروں سے\nالٰہی غوثِ اعظم سیّدِ ثقلین کا صدقہ\n\nبفیض نقشبنداں نقشبندیّت پہ رکھ قائم\nمرے ہادی و مرشد اور نور عین کا صدقہ\n\nرہے شہزادؔ کی نسبت سدا شیخ مجدّد سے\nالٰہی مطمئن دل کے سکون و چین کا صدقہ"
  },
  {
    "id": 29,
    "title": "قرآن کی شان",
    "description": "حمدِ رب ہے مصطفی کی شان ہے قرآن میں\nدین کی تعلیم ہے ایمان ہے قرآن میں\n\nاِس کو مولا نے کہا ہے آپ فرقان حمید\nاُس کی یکتائی کی ہر برہان ہے قرآن میں\n\nنور کا منبع ہے یہ، حکمت کا بحرِ بے کنار\nروشنی ہے علم ہے عرفان ہے قرآن میں\n\nتزکیہ و صبر ، تسلیم و رضا کا درس ہے\nاک نظامِ عدل ہے ، احسان ہے قرآن میں\n\nولولہ انگیز ہیں آیات اس منشور کی\nفرد کے ہر درد کا درمان ہے قرآن میں\n\nزندہ کر دیتا ہے یہ اقوامِ مردہ کے ضمیر\nقادر و قیوّم کا فیضان ہے قرآن میں\n\nجس میں پوشیدہ ہیں الہام و فراست کے گہر\nحکمت و اسرار کی وہ کان ہے قرآن میں\n\nاس سے بڑھ کر اور کیا اعزاز ہو انسان کا\nخود مخاطب عبد سے رحمان ہے قرآن میں\n\nہے یہی شہزادؔ رب کی آخری زندہ کتاب\nریب سے خالی ہے جو فرمان ہے قرآن میں"
  },
  {
    "id": 30,
    "title": "شان قرآن",
    "description": "حکمتیں ہیں نور ہے اسرار ہیں قرآن میں\nذاتِ ربِّ عرش کے انوار ہیں قرآن میں\n\nرہنما و محسنِ انسانیت ہے یہ کتاب\nکامیابی کے سبھی اطوار ہیں قرآن میں\n\nزندگی میں بندگی کے رنگ بھر دیتا ہے یہ\nارفع و اعلیٰ سبھی اقدار ہیں قرآن میں\n\nناسخ و منسوخ ہیں کچھ محکم و متشا بھات\nگھاٹیاں کچھ راستے خم دار ہیں قرآن میں\n\nہے پیامِ زندگی یہ مردہ قوموں کے لیے\nروح پرور ، تازہ تر افکار ہیں قرآن میں\n\nدیکھتے ہیں صفحہ در صفحہ انہیں اہل نظر\nجلوہ فرما ہر جگہ سرکار ہیں قرآن میں\n\nمصدر و مہبط ہیں وہ وحی خدا کا اس لیے\nصاحب قرآن کے تذکار ہیں قرآن میں\n\nزمزمہ تسبیح کا ، نغمہ کہیں تہلیل کا\nجانفزا و دلنشیں اذکار ہیں قرآن میں\n\nقل ھواللہ احد ہے اس کی وحدت کا بیاں\nکبریائی کے کئی آثار ہیں قرآن میں\n\nسورئہ رحمان کی آیات میں جلوہ نما\nاس کی قدرت کے حسیں شہکار ہیں قرآن میں\n\nاکبر و اصغر ہو کوئی یا ہو کوئی خشک و تر\nگلشن و صحرا و نور و نار ہیں قرآن میں\n\nماضی و حال اور مستقبل کی ہے اس میں خبر\nجلوہ گر شہزادؔ سب ادوار ہیں قرآن میں"
  },
  {
    "id": 31,
    "title": "شان بیت اللہ کی",
    "description": "یاد آتی ہے مجھے ہر آن بیت اللہ کی\nہے نرالی ہی جہاں میں شان بیت اللہ کی\n\nروح کو سرشار کر دیتا ہے کعبے کا طواف\nبارشِ انوار ہے پہچان بیت اللہ کی\n\nعالم لاہوت تک ہے اس کی ہیبت کا اثر\nکرتے ہیں تکریم عالمیان بیت اللہ کی\n\nمصحفِ لاریب میں تاریخ ہے اس کی رقم\nکہہ رہا ہے داستاں قرآن بیت اللہ کی\n\nابرہہ کو عبدِ مطلب نے دیا تھا یہ جواب\nہے حفاظت کے لیے رحمان بیت اللہ کی\n\nاس کے معماروں میں شامل ہیں براہیم و ذبیح\nکیوں نہ پھر مضبوط ہو بنیان بیت اللہ کی\n\nروشنی تقویٰ کی اس کے دل کو ہوتی ہے نصیب\nکرتا ہے تعظیم جو انسان بیت اللہ کی\n\nحق نے نور مصطفی سے کر دیا روشن اسے\nہو گئی تھی جب فضا ویران بیت اللہ کی\n\nدید کو شہزادؔ کا دل ہو رہا ہے بے قرار\nہو زیارت ربِّ انس و جان! بیت اللہ کی"
  },
  {
    "id": 32,
    "title": "نعت رسول مقبول ا",
    "description": "نعت شریف\nبھلا کیسے ہو ہم سے حق ادا توصیف احمد کا\n\nسبق پڑھتے ہیں اس مکتب میں ہم تاحال ابجد کا\nنظر صدّیق کی حسنِ بیاں ہو امِ معبد کا\n\nتو شاید کچھ بیاں ہو پائے ان کے قامت و قد کا\nجسے حاصل ہوا اک ذرہ بھی عشق محمد کا\n\nوہ مشتِ خاک ہے مصداق بنیان مشیّد کا\nہر اک خوبی جہاں میں معتبر ہے ان کی نسبت سے\n\nانہیں سے فرق ہے تاحشر قائم نیک اور بد کا\nخدائے وحدہٗ نے کر دیا ہے لاشریک ان کو\n\nاسی کو علم ہے ان کے کمال اوج کی حد کا\nخدا کی رحمتیں بڑھ کر مرے لب چوم لیتی ہیں\n\nزباں پہ میری جس دم نام آتا ہے محمد کا\nخدا کے فضل سے مختار ہیں وہ حل و حرمت کے\n\nانہیں کو علم ہے قرآن کے منشا و مقصد کا\nفضیلت کی بنا تقویٰ پہ رکھی ہے شہ دیں نے\n\nکسی پہلو سے کم رتبہ نہیں احمر سے اسود کا\nریاض خلد ہو عرش معلی ہو کہ بیت اللہ\n\nہے بالاتر مقام ان سے مرے آقا کے مرقدکا\nہیں جس کے سائے میں جبریل قمری وار نغمہ گر\n\nنہیں ہے گلشن ہستی میں کوئی سرو اس قد کا\nسنا کوئی حکایت ہم کو بھی چشم فلک اس کی\n\nمدینہ میں ہوا تھا واقعہ جب ان کی آمد کا\nتعارف کے لیے شہزادؔ عمر خضر بھی کم ہے\n\nاگر ہو تذکرہ صرف ان کے اک تملیذِ ارشد "
  },
  {
    "id": 33,
    "title": "نعت شریف",
    "description": "خدا حضور کا قرآں مرے حضور کا ہے\nتمام عالمِ امکاں مرے حضور کا ہے\n\nکرم ہے سرورِ دیں کا ہر ایک امت پر\nہر اک رسول پر احساں مرے حضور کا ہے\n\nنوازشات ہیں عالم پہ ان کی ہر لحظہ\nہر آن فیض فراواں مرے حضور کا ہے\n\nنگاہ رشک سے تکتے ہیں اس کو قدسی بھی\nجو خوش نصیب کہ مہماں مرے حضور کا ہے\n\nکیے ہوئے ہیں گوارا ہمیں جو ارض و سما\nیہ سارا فیض میں قرباں مرے حضور کا ہے\n\nیہ خَلق و اَمر کا سب اہتمام ان کے لیے\nبہشت و عرش کا ساماں مرے حضور کا ہے\n\nنہیں ہے ان کی شریعت میں جبر کا پہلو\nتمام دین ہی آساں مرے حضور کا ہے\n\nسنائی حشر سے پہلے ’’انالھا‘‘ کی نوید\nیہ کس کمال کا فرماں مرے حضور کا ہے\n\nیہ کس کا نام ہے گونجا خدا کے نام کے ساتھ\nمرے حضور کا ہاں ہاں مرے حضور کا ہے\n\nجو درمیان ہے شہزادؔ بیت و منبر کے\nبہشت کا وہ گلستاں مرے حضور کا ہے"
  },
  {
    "id": 34,
    "title": "نعت شریف",
    "description": "مجھ سے پھر عرض مدعا نہ ہوا\nنعت کہنے کا حوصلہ نہ ہوا\n\nجیسے ہیں مصطفی کریم مرے\nایسا تو کوئی دوسرا نہ ہوا\n\nجس کے نقش قدم پہ خضر چلے\nایسا تو کوئی مقتدا نہ ہوا\n\nکوئی خورشید ہو کہ ماہ جبیں\nسامنے آپ کے کھڑا نہ ہوا\n\nجس کو نسبت ہے آپ کے در سے\nوہ مَرا تو مگر فنا نہ ہوا\n\nکیا تعلق خدا کے ساتھ اسے\nصدق دل سے جو آپ کا نہ ہوا\n\nنعت شہزادؔ عرض کی تو مگر\nان کی مدحت کا حق ادا نہ ہوا"
  },
  {
    "id": 35,
    "title": "نعت شریف",
    "description": "ایماں ہے بادباں تو ستارا ہے ان کا نام\nدنیا کے اس بھنور میں کنارا ہے ان کا نام\n\nمعمور کر دیا اسے انوار حمد سے\nخالق نے کیا ہی خوب سنوارا ہے ان کا نام\n\nوہ شخص سب کے دل میں اُترتا چلا گیا\nجس نے بھی اپنے دل میں اتارا ہے ان کا نام\n\nاز فرش تابہ عرش ہے صلِّ علیٰ کی گونج\nوردِ زباں ہمارا تمہارا ہے ان کا نام\n\nایوانِ لا اِلٰہ کا اک معتمد ستون\nشرعِ مبیں کی آنکھ کا تارا ہے ان کا نام\n\nکھولا یہ راز اسم گرامی کی میم نے\nتحمیدِ لم یزل کا اشارا ہے ان کا نام\n\nلوح و قلم کو اسم گرامی سے ہے شرف\nتقدیر کی جبیں کا ستارا ہے ان کا نام\n\nہے اصلِ حمد و حامد و محمود ایک ہی\nکس کس طرح سے حق نے ابھارا ہے ان کا نام\n\nاس نام ہی سے ارض و سما میں ہے روشنی\nلاریب روشنی کا منارا ہے ان کا نام\n\nمومن کا دل حریم مدینہ سے کم نہیں\nمومن کے دل میں انجمن آرا ہے ان کا نام\n\nقرباں کر رہا ہے وہ جاں ان کے نام پر\nجس جس کو اپنی جان سے پیارا ہے ان کا نام\n\nشہزادؔ میرے نطق کی معراج ہو گئی\nمیں نے زباں سے جونہی پکارا ہے ان کا نام"
  },
  {
    "id": 36,
    "title": "نعت شریف",
    "description": "مجھ سے عاصی پہ رحمت کی حد ہو گئی\nنعت محبوب ذاتِ صمد ہو گئی\n\nمل گیا اتباع نبی کا ثمر\nلو مری بندگی مستند ہو گئی\n\nمصطفی کی عنایت سے دل کی کلی\nیوں کھلی کہ گلِ سرسَبدْ ہو گئی\n\nروز محشر شفاعت کا دفتر کھلا\nفردِ عصیاں مری مسترد ہو گئی\n\nہم کہاں کے بھلا لائق خلد تھے\n’’نعتِ محبوب داور سند ہو گئی‘‘\n\nپھر سے ’’تقویمِ احسن‘‘ عطا ہو ہمیں\nزیست آئینہ ’’فِیْ کَبَد‘‘ ہو گئی\n\nجا بجا ان کی شانیں ہیں قرآن میں\nکوئی شد ہو گئی کوئی مدّ ہو گئی\n\nنعت گوئی کی نعمت سے ہوں بہرہ ور\nاب یہ نعمت بھی وجہ حسد ہو گئی\n\nجب سے مدح پیمبر کا خوگر ہوا\nہر عزازیل کو مجھ سے کد ہو گئی\n\nایک لشکر حوادث کا تھا سامنے\nان کی رحمت سے حاصل رسد ہوگئی\n\nمستنیر ان سے صبحِ ازل کی جبیں\nضوفشاں ان سے شامِ ابد ہو گئی\n\nاہل جنت کہیں گے یہ سرکار سے\nآج بے کس نوازی کی حد ہوگئی\n\nایسی توحید سمجھائی سرکار نے\nہر طرف ’’الاحد الاحد‘‘ ہو گئی\n\nتھا جو روشن چراغ رخِ مصطفی\nرشکِ مہتاب کنج لحد ہو گئی\n\nیہ بھی فیضان ہے شافع حشر کا\nخلد مطلوبِ ہر نیک و بد ہو گئی\n\nہم جہنم میں شہزادؔ گرنے کو تھے\nحائل ان کی شفاعت کی سد ہو گئی"
  },
  {
    "id": 37,
    "title": "نعت شریف",
    "description": "بہ ہر نفس شہ دیں پر ہزار بار درود\nخدا کے ذات پیمبر پہ بے شمار درود\n\nعجیب شان سے ہوتا ہے لطف بار درود\nپڑھا کرے جو کبھی کوئی بے قرار درود\n\nدلوں کو پاک یہ کرتا ہے ہر کدورت سے\nمحبتوں کی دکھاتا ہے رہگزار درود\n\nبلندیاں بھی یہ دیتا ہے زیر دستوں کو\nمٹے ہوئوں کو بناتا ہے نام دار درود\n\nیہ بندگی کو سجھاتا ہے نت نئے آہنگ\nرخ عروس عبادت کا ہے نکھار درود\n\nخدا کی رحمتیں اس پر اترتی رہتی ہیں\nجو بھیجتا ہے محمد پہ بار بار درود\n\nدھلے ہوئے ہوں جو کوثر میں وہ صلوٰۃ و ثنا\nڈھلے بہشت میں جو ہوں وہ طرح دار درود\n\nکہو ادب سے حضور آپ پر صلوٰۃ و سلام\nکبھی جو بھیجنا چاہو بہ اختصار درود\n\nصلاۃ بھیجے گا اس پر مرا خدا دس بار\nجو ان کی ذات پہ بھیجے گا ایک بار درود\n\nنماز میں بھی وہ کہتے ہیں ’’السلاّمُ علیک‘‘\nاذاں کے ساتھ بھی پڑھتے ہیں حق شعار درود\n\nچھلک رہا ہے مرے آنسوئوں سے رنگ قبول\n’’مری دُعا کے گلے میں اثر کا ہار درود‘‘\n\nحریم قدس میں پہنچے نہ کیوں مری آواز\n’’مری دعا کے گلے میں اثر کا ہار درود‘‘\n\nعطا ہوا جو مجھے صاحب درود کا قرب\nبروز حشر بنا وجہِ افتخار درود\n\nجو تیری شان کے لائق ہو اے خدائے عظیم\nتو ان پہ بھیج ہمیشہ وہ شان دار درود\n\nبچائے رکھتا ہے شہزادؔ ہر مصیبت سے\nدرود خواں کے لیے ہے حصیں حصار درود"
  },
  {
    "id": 38,
    "title": "نعت شریف",
    "description": "آرزوئے دیدئہ موسیٰ کو یوں پورا کیا\nعرش پر دیدارِ حق آقا نے بے پردہ کیا\n\nدوسرا ان جیسا کوئی پھر نہیں پیدا کیا\nخلق میں خلاّق نے سرکار کو یکتا کیا\n\nعالم بالا سے گزرے جب شہ دیں بے حجاب\nروئے تابان نبی کو عرش بھی دیکھا کیا\n\nکہکشائوں کو ملی حسن کف پا کی زکوٰۃ\nنور کو بھی مستنیر اس نور نے ایسا کیا\n\nکیا تھا گر کچھ اور رہتے ساتھ تا قصرِ دنیٰ\nطائر سدرہ نشیں یہ کیا شب اسریٰ کیا\n\nپیکر آدم میں تھا نور محمد جلوہ گر\nسب فرشتوں نے انہی کے نور کو سجدہ کیا\n\nصاحب ایماں نے جانا ’’ایکم مثلی‘‘ کو حق\nدشمنِ ایماں انہیں خود سا بشر سمجھا کیا\n\nدل کے گلشن میں اتر آئی بہارِ ہشت خلد\nکشت جاں پر آپ کا ابرِ کرم برسا کیا\n\nکس قدر لگتی ہے دلکش حضرت حسّاں کی بات\nآپ سا خوش رو کسی ماں نے نہیں پیدا کیا\n\nآپ کی خلقت کو رکھا رب نے ہر خامی سے پاک\nگویا خالق نے بھی جیسا آپ نے چاہا کیا\n\nآج پھر یاد آئے ہیں اہل جوار ذی سلم\nآج خوب آنسو بہائے اور جی ہلکا کیا\n\nیاد طیبہ سے ملا شہزادؔ کچھ دل کو سکوں\nنعت کے اشعار نے سینہ مرا ٹھنڈا کیا"
  },
  {
    "id": 39,
    "title": "نعت شریف",
    "description": "ملائوں کیا میں کسی سے نظر مدینے میں\nجھکا ہے بار ندامت سے سر مدینے میں\n\nمیں صبح و شام زیارت کو جائوں روضے کی\nالٰہی! کاش ہو میرا بھی گھر مدینے میں\n\nسوائے ’’لا‘‘ کے سبھی کچھ جہاں سے ملتا ہے\nکھلا ہوا ہے کرم کا وہ دَر مدینے میں\n\nمیں دیکھتا تھا مناظر حریم طیبہ کے\nتھی ساتھ ساتھ مری چشمِ تر مدینے میں\n\nجمالِ نورِ مجسمّ کو دیکھنے کے لیے\nاتر کے آ گئے شمس و قمر مدینے میں\n\nبہشت آپ ہے مشتاق جن کے جلوئوں کی\nچھپے ہوئے ہیں وہ لعل و گہر مدینے میں\n\nچمک اٹھے سبھی دیوار و در بقول انس\nجب آئے خیر سے خیرالبشر مدینے میں\n\nجو جارہی ہے گلستانِ خلد کو سیدھی\nے اس کمال کی اک رہ گزر مدینے میں\n\nبفیضِ کیفِ مسلسل کبھی یہ لگتا ہے\nتمام عمر ہوئی ہے بسر مدینے میں\n\nدعائیں ہم نے جو شہزادؔ رب سے مانگی تھیں\nوہ ہو گئی ہیں سبھی بارور مدینے میں"
  },
  {
    "id": 40,
    "title": "نعت شریف",
    "description": "جو ہو صدق طلب سلطان بحر و بر سے ملتا ہے\nسکونِ دل ، قرار جاں نبی کے در سے ملتا ہے\n\nمدینہ میں ہے جلوہ گر مدینہ علم و حکمت کا\nنشانِ جادئہ بخشش اسی رہبر سے ملتا ہے\n\nخدا کی دوستی مشروط ہے ان کی اطاعت سے\nپتا اللہ کا بس مصطفی کے گھر سے ملتا ہے\n\nنوازا ہے خدا نے سب رسولوں کو فضائل سے\nکسی کا مرتبہ بھی میرے پیغمبر سے ملتا ہے؟\n\nشہادت سورئہ احزاب میں ہے اس عقیدے کی\nقرار زندگانی لطفِ پیغمبر سے ملتا ہے\n\nنہیں ہے کام توصیف نبی میں زور بازو کا\nیہ توشہ بس عطائے خالق اکبر سے ملتا ہے\n\nقلم سجدہ کناں رہتا ہے جو محراب مدحت میں\nاسے فیض ثنا جبریل کے شہپر سے ملتا ہے\n\nخذف ریزے ہوئے تسبیح خواں ان کی توجہ سے\nجواب اس ڈھنگ سے سرکار کو کنکر سے ملتا ہے\n\nتصور میں ترے بھی ہم نشیں شاید ہیں وہ گلیاں\nتری آنکھوں کا نقشہ میری چشمِ تر سے ملتا ہے\n\nغم ہستی سے میں شہزادؔ جب بے تاب ہوتا ہوں\nمجھے اک حوصلہ سا گنبدِ اخضرسے ملتا ہے"
  },
  {
    "id": 41,
    "title": "نعت شریف",
    "description": "کیا بتائے بشر آپ کا مرتبہ جانتا ہے خدا ہی مقام آپ کا\nآپ کا عشق ایمان کی جان ہے روح دین متیں احترام آپ کا\n\nآپ خلقت میں لاریب ہیں اولیں آپ بعثت میں ہیں آخر آخریں\nکون جانے بھلا ابتدا آپ کی کون جانے بھلا اختتام آپ کا\n\nمعرکہ ہے صلیب و علم کا بپا اہل اسلام باہم ہوئے بے وفا\nکاش پھر کوئی رومی عجم سے اٹھے کاش پھر آئے کوئی غلام آپ کا\n\nیا نبی اس طرف پھر ہو چشم کرم ساری امت کا رہ جائے آقا! بھرم\nدستِ اغیار میں ہے کلید حرم نرغۂ کفر میں ہے نظام آپ کا\n\nآپ کو انبیاء کی قیادت ملی آپ کو اصفیاء کی سیادت ملی\n’’سارے نبیوں میں اونچا مقام آپ کا سب پہ لازم ہوا احترام آپ کا‘‘\n\nآپ سے نور تھا ظلمتِ دہر میں آپ سے نور ہے ظلمت دہر میں\nکام آیا تھا پہلے بھی نام آپ کا کام دے گا ہمیں اب بھی نام آپ کا\n\nآپ کا ذکر شہزادؔ کی نظم میں آپ کا ذکر شہزادؔ کی نثر میں\nاس عنایت کا ہو شکر کیسے ادا تذکرہ لب پر ہے صبح و شام آپ کا"
  },
  {
    "id": 42,
    "title": "نعت شریف",
    "description": "خیرالوریٰ کہوں انہیں شمس الضّحیٰ کہوں\nصدر العلیٰ کہوں کبھی بدرالدجیٰ کہوں\n\nکچھ کر کے اقتباس کلام مجید سے\nطہٰ کہوں ، نذیر کہوں، مصطفی کہوں\n\nزینت فزائے مسند محمود ہیں حضور\nایوان حشر کا انہیں صدر العلیٰ کہوں\n\nجن کی کرن سے صبح ازل کو ملی ضیاء\nان کو شب الست کا بدرالدجیٰ کہوں\n\nاس درجہ نور باریاں ہوتی ہیں روح میں\nجس درجہ اہتمام سے صلِّ علیٰ کہوں\n\nجی چاہتا ہے پھر ہو ’’بلی ‘‘ کا معاملہ\nپھر سے بلی کے ساتھ میں صل علیٰ کہوں\n\nمیرا درود اور ہے اس کا درود اور\nکیسے بھلا میں خود کو شریکِ خدا کہوں\n\nوہ جن کا ذکر خیر کیا تھا مسیح نے\nاللہ کے خلیل کی ان کو دعا کہوں\n\nآنکھوں میں ہیں مناظرِ فردوس گام گام\nارض حرم کو ساحلِ موج بقا کہوں\n\nشہزادؔ بھیجتا ہے خدا جس پہ خود درود\nاس ذات کو بزرگ میں بعد از خدا کہوں"
  },
  {
    "id": 43,
    "title": "نعت شریف",
    "description": "صحرا میں گل سبز دمکتا نظر آیا\nوہ دیکھئے وہ گنبدِ خضرا نظر آیا\n\nگلزار مدینہ کے ہراک غنچہ و گل میں\nپنہاں مجھے فردوس کا نقشہ نظر آیا\n\nسرکار دو عالم کی عنایت سے عطا سے\nبگڑا ہوا ہر کام سنورتا نظر آیا\n\nانوار سے معمور ہے وہ خاک ابھی تک\nہر ذرّہ سے خورشید ابھرتا نظر آیا\n\nمانند شب قدر ہے طیبہ کی ہر اک شب\nہر صبح کا چہرہ تر و تازہ نظر آیا\n\nکہتے ہیں جسے مسندِ محمود کا وارث\nمحشر میں شفاعت کو وہ تنہا نظر آیا\n\nجب دیکھا جدھر دیکھا دیار شہِ دیں میں\nہر سمت وہی نور سراپا نظر آیا\n\nشہزادؔ مدینہ کے مناظر میں مجھے تو\nعکسِ شہِ کونین جھلکتا نظر آیا"
  },
  {
    "id": 44,
    "title": "نعت شریف",
    "description": "مائل بہ کرم رہتے ہیں سرکار ہمیشہ\nیونہی نہیں آ جاتے گنہگار ہمیشہ\n\nارمان شفاعت لئے سرکار کے درپر\nآتے ہیں شفاعت کے طلب گار ہمیشہ\n\nسرمایۂ آدم ہے تری ذاتِ گرامی\nہیں زیر قدم ثابت و سیّار ہمیشہ\n\nتاحشر ہے اب تیرے لیے مسندِ ارشاد\nلو دیتے رہیں گے ترے افکار ہمیشہ\n\nبخشی ہے ترے رب نے ترے ذکر کو رفعت\nہوتے ہی رہیں گے ترے تذکار ہمیشہ\n\nخلاّقِ دو عالم بھی ترے ساتھ ہے ہر دم\nجبریل بھی ہیں تیرے طرف دار ہمیشہ\n\nہر نقش کفِ پا ہے ترا رہبر کامل\nہیں اہلِ نظر اس کے طلبگار ہمیشہ\n\nقرآن کی تفسیر فرامین ہیں تیرے\nہے تازہ شریعت کا چمن زار ہمیشہ\n\nہروصف ترا مظہر اخلاق الٰہی\nہر حرف ترا زندہ و ضوبار ہمیشہ\n\nمحبوب ہے تو باقی وحیِّ ابدی کا\nتابندہ رہیں گے ترے انوار ہمیشہ\n\nہر دور میں مقبول و مسلمّ رہی آقا\nدنیا میں تری خوبیِ کردار ہمیشہ\n\nپھٹکے نہ کبھی پاس مرے گردشِ دوراں\nمیں نعت کہوں اے شہ ابرار ہمیشہ\n\nرکھا ہے قدم تو نے جہاں فرشِ زمیں پر\nدیکھا ہے وہاں نور کا مینار ہمیشہ\n\nہے جس میں جڑا ختم نبوّت کا نگینہ\nسر پر ہے فضیلت کی وہ دستار ہمیشہ\n\nوالشمس ہے اے شمس ترا روئے فروزاں\nوالفجر ترے حسن کا اظہار ہمیشہ\n\nسرکار نے جو صبح و مسا خود بھی پڑھے ہیں\nرکھ وردِ زباں بس وہی اذکار ہمیشہ\n\nدیتا رہے خوشبو جو ترا اسم گرامی\nمہکا رہے شہزادؔ کا گھر بار ہمیشہ"
  },
  {
    "id": 45,
    "title": "نعت شریف",
    "description": "کب تک رہیں گے ایسے سنین و شہور اور\nتابِ فراق مجھ کو نہیں ہے حضور اور\n\nفرمائیے حضور! حضوری کی کچھ سبیل\nدیتا نہیں ہے ساتھ دلِ ناصبور اور\n\nآیا ہی چاہتا ہے حضوری کا اذن بھی\nرہ لے ریاضِ خلد سے کچھ روز دور اور\n\nہوں گے حضور تخت شفاعت پہ جلوہ گر\nمنظر ہمیں دکھائے گا یوم النشور اور\n\nتاباں ضیائے نعت سے رہتا ہے میرا دل\nاے ابرِ نور بار مجھے بخش نور اور\n\nحمد خدا نے روح کو دی تازگی نئی\nنعتِ نبی سے دل کو ملا اک سرور اور\n\nعہد رواں حضور ہے محتاج التفات\nدرکار ہے بشر کو ابھی کچھ شعور اور\n\nآتا ہے جب خیال کف پائے مصطفی\nشہزادؔ صحنِ جاں میں اترتا ہے نور اور"
  },
  {
    "id": 46,
    "title": "نعت شریف",
    "description": "اک عالم سرور میں باچشم تر ملے\nروضے کے سامنے جو کھڑے دیدہ ور ملے\n\nممکن نہیں کہ پھر وہ کبھی در بدر ملے\nباب السلاّم پر جو کھڑا بخت ور ملے\n\nمعبود مصطفی کا کرے شکر صبح و شام\nتوصیفِ مصطفی کا جسے کچھ ہنر ملے\n\nاکثر درِ نبی پہ بصد عجز و انکسار\nدستِ طلب دراز کیے تاجور ملے\n\nکاستہ بدست آپ کی چوکھٹ پہ ہوں کھڑا\nخیرات اب مجھے بھی مرے چارہ گر ملے\n\nانوارِ مصطفی سے ہوئے بہرہ یاب سب\nجتنے رُسل حضور سے افلاک پر مِلے\n\nمحشر میں انبیاء بھی پکاریں گے دیکھنا\n’’بندہ نواز صدقۂ لطفِ نظر ملے‘‘\n\nچلتا نہیں وہ جادئہ اہل فرنگ پر\nسلطانِ انبیاء کی جسے رہگزر ملے\n\nشہزادؔ زندگی میں مجھے خُلد ہو نصیب\nسرکار کی گلی میں اگر مجھ کو گھر ملے"
  },
  {
    "id": 47,
    "title": "نعت شریف",
    "description": "ختم الرسل ہیں سارے زمانوں کے مقتدا\nخوش بخت ہیں جو آپ کی کرتے ہیں اقتدا\n\nصلِّ علیٰ کا ورد ہے ہر درد کی دوا\nمدح و ثنائے رحمتِ عالم میں ہے شفا\n\nبندے ہیں ہم وہ خواجۂ کل خواجگان ہیں\nہیں سب کے آپ مُرشد و ہادی و رہنما\n\nخلاّقِ ہر جہان کا شہکار ہیں حضور\nآئینہ جمالِ الٰہی ہیں مصطفی\n\nاحوال وہ بیان ہوں لفظوں میں کس طرح\nحاضر درِ حضور پہ ہوتے ہیں جب گدا\n\nمیں ان کا مدح خواں ہوں نکیرین بس کرو\nرکھتا ہوں مصطفی سے محبت میں باخدا\n\nبے حد گراں تھا داورِ محشر کا سامنا\nآقا نے مجھ کو دامنِ رحمت میں لے لیا\n\nشہزادؔ تو نے حمد کے اشعار تو کہے\nاب اس زمین میں ہی نئی نعت اِک سنا"
  },
  {
    "id": 48,
    "title": "نعت شریف",
    "description": "لیے دلوں میں تمنائے ارض پاک چلے\nحرم کی سمت مسافر بصد تپاک چلے\n\nبذوق و شوق و حضوری و انہماک چلے\n’’جو سوئے عرش معلیٰ رسول پاک چلے‘‘\n\nحروف نعت کا ممنون میں رہوں گا سدا\nجو قلب و روح کو فرما کے تابناک چلے\n\nجہاں کی خاک سے ہو کہکشاں بھی شرمندہ\nوہاں پر مہر و نجوم و قمر کی خاک چلے\n\nکمال شوق سے آئے تھے جو سلامی کو\nدر نبی سے پلٹ کر وہ سینہ چاک چلے\n\nشفیع حشر کے جلوئوں کو دیکھنے کے لیے\nمسافرانِ لحد ہو کے گھر سے پاک چلے\n\nعجیب شان سے شہزادؔ ان کے در کے گدا\nبٹھا کے سارے زمانے پہ اپنی دھاک چلے"
  },
  {
    "id": 49,
    "title": "نعت شریف",
    "description": "وہی لمحے حاصل زندگی ہیں جو اُن کے در پہ گزر گئے\nمرے ریگ زارِ وجود کو گل و یاسمیں سے جو بھر گئے\n\nمیں چلا جو اسوئہ پاک پر مرے مصطفی ہوئے راہبر\nمجھے بندگی کی سند ملی مرے سارے کام سنور گئے\n\nیہ کمال ہے شہ دین کا دیا درس صدق و یقین کا\nجو اٹے تھے کفر کی دھند سے وہ نقوش سارے نکھر گئے\n\nیہ جو نور ہے شب قدر کا یہ ہے فیض سیِّد بدر کا\nاسے طاق رات میں ڈھونڈنے کا حضور حکم ہیں کر گئے\n\nملے بندگی کے وہیں نشاں بنی سجدہ گاہ وہاں وہاں\n’’وہ جہاں جہاں بھی ٹھہر گئے وہ جہاں جہاں سے گزر گئے‘‘\n\nہیں قسیم رحمتِ رب وہی سبھی رحمتوں کا سبب وہی\nشہ دوسرا ہی کے جود سے جوتہی تھے ظرف وہ بھر گئے\n\nبخدا وہ اہل نصیب ہیں شہ انس و جاں کے قریب ہیں\nوہ جو اتباع رسول میں غم دو جہاں سے گزر گئے"
  },
  {
    "id": 50,
    "title": "نعت شریف",
    "description": "جہاں کو کفر کی ظلمت سے کرنے پاک جب آیا\nعجب منظر تھا دنیا میں شہِ لولاک جب آیا\n\nنوازا اس کو بھی پیراہنِ الطاف و رحمت سے\nدر سرکار پر کوئی گریباں چاک جب آیا\n\nچلی بادِ بہاری کھل گئے جنت کے دروازے\n’’گنہگاروں کے ہونٹوں پر درودِ پاک جب آیا‘‘\n\nاسے سرشار کر ڈالا مسلسل جُود و بخشش سے\nکوئی عاصی بھی لے کر دیدئہ نمناک جب آیا\n\nصدائے ’’مارَمَیْتَ اِذْ رَمَیْتَ‘‘ گونج کر آئی\nحبیب حق لیے ہاتھوں میں مشت خاک جب آیا\n\nربیعہ اسلمی کو آپ نے جنت عطا کر دی\nلیے بہرِ وضو وہ کوزہ و مسواک جب آیا\n\nبہار جاودانی آ گئی گلزار عالم میں\nزبانِ خلق پر اسمِ شہِ لولاک جب آیا\n\nپگھل کر ہو گیا دل موم آنکھیں چار ہوتے ہی\nچلا بزم رسالت میں کوئی سفاک جب آیا\n\nخدا نے لے لیا بدبخت کو اپنی حراست میں\nشہِ کونین کی حد میں کوئی بے باک جب آیا\n\nفرشتوں کی زباں پر زمزمے مدح و ثنا کے تھے\nخداکا آخری مرسل سرِ افلاک جب آیا\n\nہمیں ثابت قدم شہزادؔ رکھا ان کی نسبت نے\nکوئی مغرب زدہ ہم پر بٹھانے دھاک جب آیا"
  },
  {
    "id": 51,
    "title": "نعت شریف",
    "description": "نگاہ زائرِ طیبہ میں گنبد، سبز سر چمکا\nسرِ شاخِ نہالِ دل عقیدت کا ثمر چمکا\n\nمظاہر تھے کمالات شہ کونین کے سارے\nدم عیسیٰ ہوا ظاہر ، ید بیضا اگر چمکا\n\nجدا کر کے دکھایا آپ نے حق اور باطل کو\nہر اک فرمان تابندہ میانِ خیر و شر چمکا\n\nنرالی شان سے ان کے کفِ پا نے ضیا بخشی\nبہر پہلو ابو ایوب انصاری کا گھر چمکا\n\nمری جانب نگاہ التفات آقا نے فرمائی\nستارہ میری قسمت کا سرِ مژگانِ تر چمکا\n\nچمک اٹھے تصور میں حروف اسم محمد کے\nپھر ان کے نور کی برسات سے دل کا نگر چمکا\n\nشب معراج نے اک معجزہ یوں بھی دکھایا ہے\n’’ستارہ بن کے ہر ذرّہ زمیں کا عرش پر چمکا‘‘\n\nحریم ذات میں صلِّ علیٰ کی روشنی پھیلی\nمرے دل میں دیا یادِ نبی کا رات بھر چمکا\n\nنہ چمکا ہے نہ چمکے گا کوئی شہزادؔ اس دھج سے\nجہاں میں آمنہ کا جس طرح نورِ نظر چمکا"
  },
  {
    "id": 52,
    "title": "نعت شریف",
    "description": "ادھر اسم گرامی لب پہ ہے فخرِ دو عالم کا\nادھر افلاک پر ہے زمزمہ صلِّ وسلم کا\n\nمجھ ایسے کو بھی ٹھہرایا ہے مورد لطفِ پیہم کا\nبھرم رکھا شہِ خوباں نے میرے دیدئہ نم کا\n\nشفا بخشی ، دیا ہے کام زخم دل کو مرہم کا\nعجب اعجاز ہے صلِّ علیٰ ذکر معظم کا\n\nاثر ہے کل جہاں میں اسوئہ نور مجسم کا\nہے شہرہ چار سو سرکار کے خلقِ مکرّم کا\n\nیہ اک انداز تھا خیرالوریٰ کے خیر مقدم کا\nزمینِ شور سے جاری ہوا چشمہ جو زمزم کا\n\nسعادت دیکھئے میری میں ان کا نام لیوا ہوں\nپھریرا عرش پر لہرا رہا ہے جن کے پرچم کا\n\nخدا کی بارگاہ خاص تک ان کی رسائی ہے\nوسیلہ ہیں وہی موسیٰ و عیسیٰ اور آدم کا\n\nقیامت تک وہی ہیں پیشوا و رہنما سب کے\nلقب بخشا خدا نے آپ کو نور مجسم کا\n\nخدا کی دوستی مشروط ہے ان کی اطاعت سے\nوہ بندہ کیا ہے جو تابع نہیں فرمانِ محکم کا\n\nیہ اک اعزاز ہے شہزادؔ بھاری سب فضائل پر\nکہ میں ہوں امتی اللہ کے محبوب اعظم کا"
  },
  {
    "id": 53,
    "title": "نعت شریف",
    "description": "رسائی بارگاہِ پاک میں جس دم ہوئی اپنی\nمقدر اوج پر تھا کیفیت تھی دیدنی اپنی\n\nحضور خواجۂ طیبہ ہوئی پھر حاضری اپنی\nخدا کے فضل سے کچھ رنگ لائی بندگی اپنی\n\nدل و روح و بدن تھے سامنے سرکار کے حاضر\nحقیقت اس گھڑی مجھ پر حقیقت میں کھلی اپنی\n\nیہ ان کے التفات بے کراں کا اک بہانہ ہے\nعزیز از جان مجھ کو اس لیے ہے بے کسی اپنی\n\nفضیلت آپ کی بعداز خدا سب پر مسلّم ہے\nجتائی ہی نہیں لیکن کسی پر برتری اپنی\n\nگرایا اس نے جب مجھ کو شہِ والا کی چوکھٹ پر\nفقط اس دن مجھے اچھی لگی یہ بے خودی اپنی\n\nچھٹی ظلمت اجالا ہو گیا سارے زمانے میں\nعرب کے چاند نے پھیلائی جس دم روشنی اپنی\n\nکمائی ہے یہی شہزادؔ عمر چند روزہ کی\nکٹی ہے مدحِ محبوب خدا میں زندگی اپنی"
  },
  {
    "id": 54,
    "title": "نعت شریف",
    "description": "رسول پاک سے سن عظمتِ حمد خدا کیا ہے\nخدا سے پوچھ شان و شوکت صلِّ علیٰ کیا ہے\n\nدیا پیغام یہ بدر و احد کے جاں نثاروں نے\nکسی کو کیا خبر قدر محمد مصطفی کیا ہے\n\nجناب سرور دیں کے تبسم کا تسلسل ہیں\n’’یہ کلیاں، پھول، غنچے، رنگ و بو موج صبا کیا ہے‘‘\n\nپناہِ عاصیاں ہے ان کا دامانِ شفاعت بھی\nبروزِ حشر یہ کھل جائے گا لطف و عطا کیا ہے\n\nیہ ان کی رحمۃ للعالمینی ہی کے جلوے ہیں\nجو پوچھو عاصیوں پر یہ کرم کا سلسلہ کیا ہے\n\nدرود خالق اکبر ہے مدّاحی محمد کی\nثنائے مصطفی کر بندئہ حق سوچتا کیا ہے\n\nمیں ان کے ذکر سے شہزادؔ اپنا قد بڑھاتا ہوں\nمری اوقات کیا ورنہ ، مرا حرفِ ثنا کیا ہے"
  },
  {
    "id": 55,
    "title": "نعت شریف",
    "description": "اس محبوب کا صدقہ میری مان ہوا\nتجھ پر نافذ ہے جس کا فرمان ہوا\n\nطیبہ میں اک نعت ہدیّہ لیتی جا\nکر دے مجھ پر اتنا تو احسان ہوا\n\nتو نے حرا میں وہ منظر بھی دیکھا تھا\nاترا تھا قرآن پہ جب قرآن ہوا\n\nکر معمور دل و جاں کو اس خوشبو سے\nلا طیبہ سے کچھ عطر و لوبان ہوا\n\nتو جالی کے اس جانب بھی جاتی ہے\nجس جانب ہے مولا کی برہان ہوا\n\nمیرے بھی ممدوح وہی ہیں تیرے بھی\nاور وہی ہیں ممدوح رحمن ہوا\n\nتو نے تو سرکار کے لب بھی چومے ہیں\nمیں تیری خوش بختی پر قربان ہوا\n\nساتھ رہی ہے اسریٰ و معراج میں تو\nپائے ہیں کیا کیا روح و ریحان ہوا\n\nتو گوش سرکار تلک پہنچاتی تھی\nنعت پڑھا کرتے تھے جب حسان ہوا\n\nتو محظوظ ہوئی ہے ان کی سانسوں سے\nرب نے تجھ کو بخشی کیسی شان ہوا\n\nتو بھی شامل تھی سرکار کی طینت میں\nتجھ پہ فدا ہو جائے میری جان ہوا\n\nمیں بھی تیرے ساتھ مدینے جا پہنچوں\nہے کوئی ہم راہی کا امکان ہوا\n\nآتی ہے شہزادؔ ریاض الجنّت سے\nتازہ تر کرنے میرا ایمان ہوا"
  },
  {
    "id": 56,
    "title": "نعت شریف",
    "description": "خود سنور جائیں گے حالات مدینے چلئے\nآپ بن جائے گی ہر بات مدینے چلئے\n\nرشکِ صد خلد ہے گلزار حریمِ طیبہ\nہیں وہاں نور کے باغات مدینے چلئے\n\nبارشِ نور برستی ہے گلی کوچوں میں\nدن کے جیسی ہے وہاں رات مدینے چلئے\n\nچھوڑئیے چھوڑئیے دنیا کے یہ جھنجٹ سارے\nآئیے آئیے حضرات مدینے چلئے\n\nدل میں رکھیے نہ کوئی زادِ سفر کا کھٹکا\nاک سے اک ہے وہاں سوغات مدینے چلئے\n\nحاصل عمر ہیں گھڑیاں جو وہاں پر گزریں\nقیمتی ہیں وہی لمحات مدینے چلئے\n\nقدسیوں کا وہاں رہتا ہے ہمیشہ مجمع\nہیں ہمہ رنگ فیوضات مدینے چلئے\n\nقاسم نعمتِ باری ہیں کرم پر مائل\nبٹ رہی ہے وہاں خیرات مدینے چلئے\n\nان کے دربار سے جاتا نہیں منگتا خالی\nہے رواں بحرِ عنایات مدینے چلئے\n\nراہِ طیبہ میں ہیں جتنے بھی دیار و امصار\nہیں وہ جنت کے مضافات مدینے چلئے\n\nجن کے سینے میں ہے تاریخِ رسالت پنہاں\nدیکھنے ہوں جو کمالات مدینے چلئے\n\nالجھنیں حل درِ سرکار پہ جا کر ہوں گی\nگر بدلنے ہیں خیالات مدینے چلئے\n\nصبح کی سانس معطر ہے مہک سے ان کی\nشام پر بھی ہیں عنایات مدینے چلئے\n\nکھینچتا ہے دل مومن کو اُحد کا منظر\nیاد آ جاتے ہیں غزوات مدینے چلئے\n\nجابجا ہیں وہاں آثار و مظاہر ان کے\nہر قدم پر ہیں کرامات مدینے چلئے\n\nکہہ رہی ہیں وہ ہوائیں بھی انہی کے قصے\nسن ہی لیجے وہ حکایات مدینے چلئے\n\nخواہشیں دہر کی چھوڑیں گی نہ دامن ہرگز\nتوڑیے اب یہ روایات مدینے چلئے\n\nپائوں شہزادؔ طبیعت پہ میں کیسے قابو\nہے تقاضا یہی دن رات مدینے چلئے"
  },
  {
    "id": 57,
    "title": "نعت شریف",
    "description": "محبوب ربِّ عرش ہے ، میر حجاز ہے\nنسبت سے جس کی نوعِ بشر سرفراز ہے\n\nعقدہ کھلا یہ رحمت عالم کو دیکھ کر\nفضل خدا کا سلسلہ کتنا دراز ہے\n\nیونہی نہیں رحیم کہا خود کریم نے\nمیرا نبی کریم ہے بندہ نواز ہے\n\n’’تِلکَ الرُّسُل‘‘ سے اور بھی کچھ ہو گیا عیاں\nپیغمبروں میں آپ کا جو امتیاز ہے\n\nجو کچھ ورائے عقل ہے قرآن پاک میں\nمابین مصطفی و خدا ایک راز ہے\n\nامت پہ چل گیا ہے عزازیل کا فسوں\nآقا یہ قوم در پئے تحریص و آز ہے\n\nاسریٰ کی شب گیا تھا جو تا رفعت دنیٰ\nبس ایک لامکاں کا وہی شاہباز ہے\n\nلہجے کو ان کے نام نے بخشی ہے اک مٹھاس\nدل میں انہی کے ذکر سے سوز و گداز ہے\n\nمعبود نے اسی کو فقط ’’عبدہ‘‘ کہا\nجس پر سلام بھیجنا روح نماز ہے\n\nشہزادؔ بس یہی ہے تعارف مرا کہ میں\nبندہ ہوں ان کی نسبتِ عالی پہ ناز ہے"
  },
  {
    "id": 58,
    "title": "نعت شریف",
    "description": "ہو کیسے حق ادا پھر ہم سے ان کی نعت و مدحت کا\nاَلم نشرح ہے سر آغاز جن کی شانِ رفعت کا\n\nنہیں کوئی کنارا رحمتِ آقا کی وسعت کا\nپھریرا عرش پر لہرا رہا ہے ان کی عظمت کا\n\nاِدھر بھی سرور دیں کوئی چھینٹا ابر رحمت کا\nکہ ابتر ہو رہا ہے حال اب تو ساری امت کا\n\nکھلا توحید کا روشن دریچہ شرک خانے میں\nیہ ایک اعجاز ہی تھا سرورِ عالم کی دعوت کا\n\nرسول ہاشمی کے امتی انمول ہوتے ہیں\nکسی کو کیا پتا ان موتیوں کی قدر و قیمت کا\n\nسوائے کوچۂ سرکار کے بک جائیں ناممکن\nاگر اندازہ ہو جائے ہمیں خود اپنی قیمت کا\n\nکہا اللہ نے قرآں میں ختم المرسلیں ان کو\n’’عقیدہ اس لیے رکھتے ہیں ہم ختم نبوت کا‘‘\n\nشہ کونین نے فرما دیا ہے ’’لانبی بعدی‘‘\n’’عقیدہ اس لیے رکھتے ہیں ہم ختم نبوت کا‘‘\n\nکسی کذاب کو جرأت نہ ہو پھر ایسے دعوے کی\n’’عقیدہ اس لیے رکھتے ہیں ہم ختم نبوت کا‘‘\n\nکسی کاذب سے کوئی معجزہ مانگے تو کافر ہے\nیہ فتویٰ ہے بہت مشہور سلطانِ فقاہت کا\n\nنیا کوئی نبی شہزادؔ ہو اب غیرممکن ہے\nرسولِ آخریں پر ختم ہے منصب رسالت کا"
  },
  {
    "id": 59,
    "title": "نعت شریف",
    "description": "سرور کون و مکاں سیّد ذیشان عرب\nباعثِ ارض و سما روحِ عجم جانِ عرب\n\nرونق بزمِ جہاں شمع شبستانِ عرب\nثانی باغ جناں حسنِ گلستانِ عرب\n\nگلشنِ روح پہ چھا جاتی ہے شادابی سی\nیاد آ جاتے ہیں جس دم گل و ریحانِ عرب\n\nتابع حکم شہِ دیں ہیں عجم کے دفتر\nدستِ محبوب خدا میں ہے قلمدانِ عرب\n\nذرّے ذرّے میں چمکتے ہیں یہاں ماہ و نجوم\nجادئہ عرشِ معلیٰ ہے خیابانِ عرب\n\nجب کھلا باب عنایات نبوت اس میں\nآسماں گیر ہوئی وسعتِ دامانِ عرب\n\nسنتِ سرورِ دیں صاحب ایماں کا وقار\nیعنی دستار کہ ہے زینتِ مردانِ عرب\n\nحامل وحی خداوند فرشتوں کا امام\n’’طائر سدرہ نشیں مرغِ سلیمانِ عرب‘‘\n\nبست و دو سال زیارت کو مسلسل آیا\n’’طائرِ سدرہ نشیں مرغ سلیمانِ عرب‘‘\n\nمجھ کو شہزادؔ کمک روحِ رضا سے پہنچی\nورنہ ہوتی نہ رقم مدحتِ سلطانِ عرب"
  },
  {
    "id": 60,
    "title": "نعت شریف",
    "description": "خلوص ، امن ، اخوت ، حیا وفا ادراک\nجہاں میں بانٹنے آئے تھے مصطفی ادراک\n\nضیائے سیرت انور سے ضوفشاں ہے حیات\nنقوش پائے نبی سے ہمیں ملا ادراک\n\nگزر گئے ہیں جہاں سے بھی تاج دار شعور\nبکھر گیا اسی رستے پہ جا بجا ادراک\n\nبلال و بوذر و سلمان بنتے جاتے ہیں\nدرِ حبیب سے ہوتا ہے جب عطا ادراک\n\nجبیں تمدّن و تہذیب کی چمکنے لگی\nعجیب شان سے جلوہ نما ہوا ادراک\n\nجو زیب چشم بصیرت ہو خاک راہ حجاز\nتو قلب و ذہن میں ہوتا ہے رونما ادراک\n\nترے حبیب کی مدحت کا حق ادا ہو پائے\nمجھے نصیب ہو اتنا تو اے خدا ادراک\n\nمرے نبی کا طریقہ ہے علم کی تقسیم\nمرے حضور کی سنت ہے بانٹنا ادراک\n\nاگر نصیب ہو دریائے مِنْ لَّدُنْ کی نمی\nخدا کے فضل سے ہوتا نہیں فنا ادراک\n\nمرے کفیل و مربی ہیں مصطفی شہزادؔ\nمجھے یقین ہے ہوگا فزوں مرا ادراک"
  },
  {
    "id": 61,
    "title": "نعت شریف",
    "description": "باران کرم مجھ پہ بھی برسائے مدینہ\nاے کاش مرے دل میں سما جائے مدینہ\n\nہے نقش مرے دل پہ ہر اک منظر طیبہ\nپھرتے ہیں میری آنکھ میں گلہائے مدینہ\n\nسب رنج بھلا دیتی ہے آغوش احد کی\nہے راحت جاں کوہِ دلآرائے مدینہ\n\nپنہاں ہیں تری خاک میں ایمان کے موتی\nتو رُوکشِ فردوس ہے صحرائے مدینہ\n\nبخشش کی سند ہے در سرکار سے نسبت\nجنت کی ضمانت ہے تولائے مدینہ\n\nکب دیکھئے ہم پر ہو عنایت کی نظر پھر\n’’کب دیکھئے بر آئے تمنائے مدینہ‘‘\n\nہر شخص میں انصار مدینہ کی جھلک ہے\nاک عالم ایثار ہے دنیائے مدینہ\n\nجو لطف کہ شہزادؔ شہیدیؔ پہ ہوا تھا\nوہ لطف کبھی مجھ پہ بھی فرمائے مدینہ"
  },
  {
    "id": 62,
    "title": "نعت شریف",
    "description": "یاد جب خلوتِ خورشیدِ حرا آتی ہے\nگوشۂ قلب سے اقراء کی صدا آتی ہے\n\nمسجد نعت میں جب سجدہ کناں ہونا ہو\nکام اس وقت مرے فکرِ رسا آتی ہے\n\nروح کا رزق اترتا ہے فلک سے جب بھی\nمیرے حصے میں شہِ دیں کی ثنا آتی ہے\n\nیاس کو پاس پھٹکنے نہیں دینا ہر گز\nدل کی بستی مرے آقا کو بسا آتی ہے\n\nروح کے دشت کو گلزار بنانے کے لیے\nصبح دم جنت طیبہ سے ہوا آتی ہے\n\nنسبت سرور کونین پہ ہے فخر مگر\nاپنے اعمال کو دیکھوں تو حیا آتی ہے\n\nگلشن جاں میں مہکتے ہیں درودوں کے گلاب\n’’جب مدینے سے کوئی موجِ صبا آتی ہے‘‘\n\nکعبۃ اللہ کے شہزادؔ ہر اک گوشے سے\n’’وَرَفَعْنَا لَکَ ذِکْرَکْ‘‘ کی صدا آتی ہے"
  },
  {
    "id": 63,
    "title": "نعت شریف",
    "description": "کوئی خوش بخت مرے شہر سے جب جائے حجاز\nیاد رہ رہ کے مجھے آئے ہے صحرائے حجاز\n\nاک تعلق ہے اسے فخر بنی ہاشم سے\nناز کیوں کر نہ کرے بخت پہ لیلائے حجاز\n\nایسا انفاس شہِ دیں نے نوازا ہے اسے\nرشکِ صد طور ہوئی وادی سینائے حجاز\n\nحظ اٹھا پائے گا وہ کوثر و تسنیم سے کیا\nچکھ نہ پایا جو یہاں بادئہ مینائے حجاز\n\nسجدہ کرتے ہیں وہاں جا کے مقدّر والے\nبخت ور ہوتے ہیں بس ناسیہ فرسائے حجاز\n\nرنگ توحید کا روحوں پہ وہاں چڑھتا ہے\nروپ بندوں کو نیا دیتی ہے دنیائے حجاز\n\nکیا لبھا پائے ہمیں پیرس و لندن کی کشش\n’’دل کے پردوں میں مچلتی ہے تمنائے حجاز‘‘\n\nبخدا طیبہ و بطحا کا شرف ہے ان سے\nنقشِ پائے شہِ دیں مرتبہ افزائے حجاز\n\nخود شفا آئے مریضوں کی بلائیں لینے\nنبض پر ہاتھ ہی رکھ دے جو مسیحائے حجاز\n\nاپنی آغوشِ میں لے لے اسے وقت رخصت\nلطف شہزادؔ پہ کچھ خاص جو فرمائے حجاز"
  },
  {
    "id": 64,
    "title": "نعت شریف",
    "description": "منگتے کا بھرم رکھنا سرکار کی سنت ہے\nسائل کی صدا سننا سرکار کی سنت ہے\n\nپرسش کے لیے جانا دکھ درد کے ماروں کی\nلاچار کے کام آنا سرکار کی سنت ہے\n\nتنہائی میں چھپ چھپ کر غیروں کے لیے رونا\nاپنوں کے ستم سہنا سرکار کی سنت ہے\n\nمخلوق سے پیش آنا ہر حال میں شفقت سے\nبندوں کا بھلا کرنا سرکار کی سنت ہے\n\nتعلیم شہِ دیں ہے ، تکریم بنی آدم\nتعلیم کو پھیلانا سرکار کی سنت ہے\n\nشیطاں کا طریقہ ہے سفاکی و خوں ریزی\nدشمن کو اماں دینا سرکار کی سنت ہے\n\nمشکل ہو بھلے جتنی ، حالات ہوں کیسے ہی\nحق بات سدا کہنا سرکار کی سنت ہے\n\nبیعت نہ کبھی کرنا فرعون زمانہ کی\nایمان پہ ڈٹ جانا سرکار کی سنت ہے\n\nکچھ وقت عبادت میں راتوں کو بسر کرنا\nآرام بھی فرمانا سرکار کی سنت ہے\n\nجس ذات نے بخشی ہیں شہزادؔ ہمیں سانسیں\nاس ذات کا دم بھرنا سرکار کی سنت ہے"
  },
  {
    "id": 65,
    "title": "نعت شریف",
    "description": "ابر کرم کچھ ایسا برسا تری گلی میں\nخالی رہا نہ کوئی منگتا تری گلی میں\n\nاٹکے ہوئے ہیں آنسو پلکوں پہ کس ادب سے\nآہوں میں ڈھل گیا ہے گریہ تری گلی میں\n\nسب زائروں کی خاطر ہے مژدئہ شفاعت\nیہ چیز ہے تو بس ہے تنہا تری گلی میں\n\nدیتی ہے پیار اتنا یہ سرزمین اقدس\nہر شخص لگ رہا ہے اپنا تری گلی میں\n\nملتی ہے سر بلندی سر کو یہاں جھکا کر\nدیکھا ہے ہم نے سجدہ تری گلی میں\n\nسورج میں اک جھجک سی وقت طلوع دیکھی\nمہتاب کو بھی گُم سُم پایا تری گلی میں\n\nہر شے میں ہم نے دیکھے حسنِ ازل کے جلوے\nاک چیز بھی نہیں ہے بے جا تری گلی میں\n\nپاس ادب سے دھڑکن دل میں سمٹ رہی ہے\nکچھ سہل تو نہیں ہے رہنا تری گلی میں\n\nشہزادؔ اس کرم کا گو اہل تو نہیں ہے\nاے کاش اور کچھ دن رہتا تری گلی میں"
  },
  {
    "id": 66,
    "title": "نعت شریف",
    "description": "جو اہل قرب ہیں کب آنکھ بھر کے دیکھتے ہیں\nرُخِ نبی کو وہ جاں سے گزر کے دیکھتے ہیں\n\nدکھائی دیتا ہے دھندلا سا گنبدِ اخضر\nجو آئینے میں کبھی چشم تر کے دیکھتے ہیں\n\nچلو چلو کریں سجدہ ریاض جنت میں\nنصیب ہم بھی ذرا اپنے سر کے دیکھتے ہیں\n\nاگر ہے مسئلہ ناموس مصطفی کا تو پھر\nہتھیلیوں پہ سروں کو بھی دھر کے دیکھتے ہیں\n\nفنا پذیر لگا ان کو رعب قصرِ شہی\nسدا جو روزن و در اُن کے گھر کے دیکھتے ہیں\n\nرخ حبیب تو شہزادؔ پھر ہے روئے حبیب\nادب شناس تو جالی کو ڈر کے دیکھتے ہیں"
  },
  {
    "id": 67,
    "title": "نعت شریف",
    "description": "اللہ نے یوں شان بڑھائی ترے در کی\nتعظیم خود انساں کو سکھائی ترے در کی\n\nہر لمحہ مجھے رہتا ہے احساسِ حضوری\nتصویر جو سینے میں سجائی ترے در کی\n\nطاری تھا مری روح پہ معراج کا عالم\nجالی جو مرے ہاتھ میں آئی ترے در کی\n\nتھا پاس ترے ذوق طہارت کا خدا کو\nسونپی جو فرشتوں کو صفائی ترے در کی\n\nاے رحمت عالم ہو کوئی وصل کا ساماں\nہے شاق بہت دل پہ جدائی ترے در کی\n\nلیتے ہیں فرشتے بھی یہاں سانس ادب سے\nوہ دھاک ترے رب نے بٹھائی ترے در کی\n\nپابندِ ادب ہیں یہاں صدّیق و عمر بھی\nتکریم وہ قرآں نے بتائی ترے در کی\n\nآیا مری سانسوں کو مہکنے کا سلیقہ\nخوشبو جو دل و جاں میں بسائی ترے در کی\n\nتوقیر ترے شہر کی مطلوب تھی رب کو\nقرآں میں قسم اس لیے کھائی ترے در کی\n\nکر آئوں چمن زار مدینہ کی زیارت\nہو پھر سے مقدر میں رسائی ترے در کی\n\nاس ہاتھ میں قدرت کا بھی کچھ ہاتھ تو ہوگا\nجس ہاتھ نے بنیاد اٹھائی ترے در کی\n\nاک بحر امڈنے لگا الطاف و عطا کا\nسائل نے جو زنجیر ہلائی ترے در کی\n\nاس قوم کو آیا نہیں جینے کا قرینہ\nجس قوم کو تعلیم نہ بھائی ترے در کی\n\nانسان کو احسان ترے یاد رہیں گے\nتاعمر نہ بھولے گی ، بھلائی ترے در کی\n\nشہزادؔ کے ہونٹوں پہ رہے نعت کا نغمہ\nآنکھوں میں رہے جلوہ نمائی ترے درکی"
  },
  {
    "id": 68,
    "title": "نعت شریف",
    "description": "مہکتا گلستان مدینے کی گلیاں\nہیں جنت بداماں مدینے کی گلیاں\n\nبہر سو ہیں شمع رسالت کی کرنیں\nفروزاں فروزاں مدینے کی گلیاں\n\nشہِ دوسرا ہیں یہاں جلوہ فرما\nنہ ہوں کیوں نمایاں مدینے کی گلیاں\n\nمنور ہیں مکّہ کے بازار کیسے\nہیں کتنی درخشاں مدینے کی گلیاں\n\nعقیدت کی دنیا ہے آباد ان سے\nمحبت کا عنواں مدینے کی گلیاں\n\nنگاہوں کی ٹھنڈک ہے گنبد کا جلوہ\nسکون دل و جاں مدینے کی گلیاں\n\nیہیں پر گنہگار پاتے ہیں تسکیں\nہیں بخشش کا ساماں مدینے کی گلیاں\n\nخدا کی عنایت ہے بطحا کی وادی\nنبی کا ہیں احساں مدینے کی گلیاں\n\nدلاتی ہیں رحمت کی امید سب کو\nبھلاتی ہیں عصیاں مدینے کی گلیاں\n\nہیں مرغوبِ اہل نظر مدتوں سے\nشبستاں شبستاں مدینے کی گلیاں\n\nتلاشِ نگاہِ طلب ان کا روضہ\nمرے دل کا ارماں مدینے کی گلیاں\n\nدکھاتی ہیں شہزادؔ اہل جہاں کو\nرہ علم و عرفاں مدینے کی گلیاں"
  },
  {
    "id": 69,
    "title": "نعت شریف",
    "description": "ہر اک خوبی اسے زیبا جو ہے تعریف کے لائق\nاسی کا نام ہے اعلیٰ اسی کی شان ہے فائق\n\nدرودِ سرمدی ہر وقت ہو سرکارِ والا پر\nتحیّت کی گھٹا برسے حبیب ربِّ اعلیٰ پر\n\nہر عظمت اس جہاں میں ان کے تلوے چومنے آئی\nوہ خوبی بن گئی میرے نبی کو جو ادا بھائی\n\nانہیں اچھی لگی جو بھی وہی عادت بھلائی ہے\nجو ان سے ہو گئی منسوب وہ خصلت اچھائی ہے\n\nشرف لوح و قلم کا بڑھ گیا اسم گرامی سے\nضیاء عرش معلیٰ کو ملی ماہِ تہامی سے\n\nشہ دیں کا نہیں جبریل کا سدرہ نشیمن ہے\nنہیں مطلوب قوسین آپ کا تو رب سے بندھن ہے\n\nملی آدم کو راحت اپنے نورالعین سے مل کر\nرُسل مسرور تھے اپنے دلوں کے چین سے مل کر\n\nخدا بھی ہو گیا خوش سیّدِ کونین سے مل کر\nمکمل دائرہ ہوتا ہے بس قوسین سے مل کر\n\nشفیع عاصیاں کا ذکر ہے رافع وبائوں کا\nطبیب دو جہاں کا نام ہے دافع بلائوں کا\n\nعقیدے کی مرے اسلاف بھی تصویب کرتے ہیں\nمری تصدیق خود اوراق ’’نشر الطیب‘‘ کرتے ہیں\n\nزیارت سے نبی کی نوریوں کو بھی قرار آیا\nفضائے عالم بالا پہ جیسے اک نکھار آیا\n\nوہ ذات وحدہٗ کا مصطفی کو عبدہٗ کہنا\nعجب تھا عابد و معبود کا وہ قبلہ رُو رہنا\n\nہوئے ہیں منکشف اسرار یہ اہل حقائق پر\nخدا کے کس قدر انعام ہیں خیرالخلائق پر\n\nگدائے بارگاہِ فخر موجودات ہیں سارے\nمعارف سرور دارین کی خیرات ہیں سارے\n\nحقیقت میں مقام خواجۂ کل خواجگاں کیا ہے\nخدا ہی جانتا ہے عظمتِ شاہ شہاں کیا ہے\n\nنہیں یہ جنس جو بدلے میں مال و زر کے ملتی ہے\nغذا شہزادؔ روحوں کو نبی کے در سے ملتی ہے"
  },
  {
    "id": 70,
    "title": "نعت شریف",
    "description": "دل کی بستی بسائی تری نعت نے\nبات بگڑی بنائی تری نعت نے\n\nتیری مدحت نے مجھ کو کیا محترم\nمیری عزت بڑھائی تری نعت نے\n\nجادئہ بندگی پرکیا گام زن\nحمد مجھ کو سُجھائی تری نعت نے\n\nمحو کرکے مری سب زیاں کاریاں\nدی مجھے ہر بھلائی تری نعت نے\n\nمیرے باطن کی تاریکیاں چھٹ گئیں\nشمع مدحت جلائی تری نعت نے\n\nمیں ہوں ممنون آقا تری نعت کا\nمیری قسمت جگائی تری نعت نے\n\nپھر کسی مشورے کی نہ حاجت رہی\nبات ایسی سنائی تری نعت نے\n\nبحر خواہش میں بس ڈوبتے ڈوبتے\nکشتی جاں بچائی تری نعت نے\n\nتیرے مولا سے لے کر مجھے بخش دی\nتیری مدح سرائی تری نعت نے\n\nاس طرح اپنے اندر فنا کر لیا\nمجھ کو ہر شے بھلائی تری نعت نے\n\nمجھ کو آغوش رحمت میں یوں لے لیا\nہر تمنا بھلائی تری نعت نے\n\nدیکھ کر نوریوں کو بھی رشک آ گیا\nایسی محفل سجائی تری نعت نے\n\nنعت سے مجھ پہ میری حقیقت کھلی\nکی مری رونمائی تری نعت نے\n\nبات کرنے کا مجھ کو سلیقہ نہ تھا\nبات کرنا سکھائی تری نعت نے\n\nہم بھی ہو آئے جنت کے باغات سے\nدی ہمیں یہ رسائی تری نعت نے\n\nوصل کی لذتوں سے کیا آشنا\nدور کی ہر جدائی تری نعت نے\n\nفکر عقبیٰ سے مجھ کو بری کر دیا\nدے کے ذوق گدائی تری نعت نے\n\nگرد حرص و ہوس کی چھٹی روح سے\nکی دلوں کی صفائی تری نعت نے\n\nمجھ کو حاصل ہے تائید روح امیں\nکی یہ عقدہ کشائی تری نعت نے\n\nاس عنایت پہ شہزادؔ ممنون ہے\nکی مری ہم نوائی تری نعت نے"
  },
  {
    "id": 71,
    "title": "نعت شریف",
    "description": "آپ کے ہو کے یا نبی ہم لوگ\nکیوں ہیں اخلاق سے تہی ہم لوگ\n\nآپ کے نام کا ادب ہے بہت\nنعت پڑھتے ہیں آپ کی ہم لوگ\n\nقلب میں احترام ہے بے حد\nآپ کے ہیں غلام بھی ہم لوگ\n\nیانبی رحم کیجیے ہم پر\nآپ ہی کے ہیں امتی ہم لوگ\n\nآپ سے عشق ہے حضور مگر\nہیں تمدن میں مغربی ہم لوگ\n\nآپ کی راہ سے ہٹے تو ہوئے\nنفس و شیطاں کے مقتدی ہم لوگ\n\nکفر دنیا پہ پھر مسلط ہے\nہیں اسیرانِ بے بسی ہم لوگ\n\nدر بدر ہو گئے زمانے میں\nہو کے محروم رہبری ہم لوگ\n\nمکتبِ علم و فن کے آپ رئیس\nہیں مگر اس کے مبتدی ہم لوگ\n\nنسبتِ شہرِ علم کے باوصف\nہیں فقیرانِ آگہی ہم لوگ\n\nجب تھی ہمراہ سنتوں کی ضیا\nظلمتوں میں تھے روشنی ہم لوگ\n\nپھر بھی شہزادؔ ہے امید کرم\nگو کہ ہیں صیدِ گمرہی ہم لوگ"
  },
  {
    "id": 72,
    "title": "نعت شریف",
    "description": "کس طرح نہ ہو منبعِ انوار عمامہ\nپہنے ہوئے ہیں سیّدِ ابرار عمامہ\n\nثابت ہے روایات صحیحہ سے یہ دعویٰ\nہے تاجِ نبی سنتِ سرکار عمامہ\n\nسجتا رہا جو سرور کونین کے سر پر\nوہ رحمت عالم کا طرح دار عمامہ\n\nشملے کی ہر اک تار میں رقصاں ہیں ستارے\nاللہ رے زیبا و ضیا بار عمامہ\n\nدر ہائے سیادت سے مرصع ہے ہر اک بل\nہے سارے عماموں کا یہ سردار عمامہ\n\nہے جس میں جڑا ختم نبوّت کا نگینہ\nسرکار کے سر پر ہے وہ شہکار عمامہ\n\nجبریل اُتر آتے تھے سدرہ سے زمیں پر\nدیتا جو کبھی دعوتِ دیدار عمامہ\n\nایمان کا اظہار ہے سرکار کی الفت\nسرکار سے الفت کا ہے اظہار عمامہ\n\nآتی ہیں سلامی کو فرشتوں کی قطاریں\nنکلیں جو پہن کر شہِ ابرار عمامہ\n\nدستار کی مانند جو روضے پہ سجا ہے\nکاشانہ اقدس کا ہے شہکار عمامہ\n\nہے اس کو سر سرور کونین سے نسبت\nکیوں کر نہ ہو پھر نور کا مینار عمامہ\n\nہے قول شہ ارض و سما فَاتَّبَعُوْنِیْ\nاس واسطے مومن کو ہے درکار عمامہ\n\nسرکار نے جو غزوئہ خیبر میں نوازا\nتھا زیبِ سرِ حیدرِ کرّار عمامہ\n\nسنت کے محافظ تھے سب اصحاب پیمبر\nرکھتے تھے مہاجر ہوں کہ انصار عمامہ\n\nتھی بدر میں دستار فرشتوں کے سروں پر\nباندھے ہوئے آئے تھے مددگار عمامہ\n\nشملے میں نہاں پشت پناہی کی ادا ہے\nہے ظلِّ ید ایزدِ غفاّر عمامہ\n\nاس پر ہے سجا نقشۂ نعلین مبارک\nکام آیا ہے مشکل میں کئی بار عمامہ\n\nسوراخ ہیں آقا کئی دامان طلب میں\nپھیلائے ہوئے ہوں سر دربار عمامہ\n\nسجدے کی جو اس در پہ نہیں سر کو اجازت\nہے سجدئہ بے سر کو بھی طیاّر عمامہ\n\nچوموں کبھی اس کو تو کبھی سر پہ سجائوں\nہے میرے لیے آپ کی پیزار عمامہ\n\nپگڑی نہ اچھل جائے کہیں اہل حرم کی\nآقا ہے توجہ کا طلبگار عمامہ\n\nشہزادؔ یہ سرکارِ مدینہ کا کرم ہے\nباندھے ہوئے ہے مجھ سا گنہگار عمامہ"
  },
  {
    "id": 73,
    "title": "نعت شریف",
    "description": "نانا کو کریں پیش جو حسنین عمامہ\nکیسے نہ ہو پھر قرۃ عینین عمامہ\n\nمکہ میں دیا آپ نے جب فتح کا خطبہ\nباندھے ہوئے تھے سرورِ کونین عمامہ\n\nجبریل بھی حیرت سے تکا کرتے تھے ان کو\nجب سر پر سجاتے شہِ دارین عمامہ\n\nرفعت یہ ملی صاحب معراج کے صدقے\nپہنچا تھا سرِ عرش یہ اک رَین عمامہ\n\nہر وقت مجھے رہتا ہے احساس حضوری\nہونے نہیں دیتا مجھے بے چین عمامہ\n\nشہزادؔ میں کیسے نہ انہیں سر پہ سجائوں\nمیرا تو ہیں سرکار کے نعلین عمامہ"
  },
  {
    "id": 74,
    "title": "نعت شریف",
    "description": "حیات بے ثابت کو خدا اگر دوام دے\nمجھے تو بس غلامی در شہِ انام دے\n\nاک آرزو سی ہے دبی دلِ نیاز مند میں\nاُنیس و بو تراب سا مجھے بھی کوئی نام دے\n\nمیں ایک نعت لکھ سکوں، کعب بن زُہیر سی\nمجھے قدیر و مقتدر قدرتِ کلام دے\n\nکہاں چلی گئی ہے تو ہوائے شہر مصطفی\nمرے دل حزیں کو بھی سکون کا پیام دے\n\nہماری سرزمین بھی ترس گئی ہے امن کو\nہمیں بھی خالق جہاں عمر سا اک امام دے\n\nمرے نبی سا سرپرست دے ہر اک غلام کو\nبلال سا ہر ایک سرپرست کو غلام دے\n\nعقیق سے بھی خوب تر نفس مثلِ آب زر\nثنائے نور کے لیے حروفِ نور فام دے\n\nازالہ ذکرِ مصطفی سے میں کروں خطائوں کا\nمیںخود سے لڑ سکوں مجھے وہ ذوقِ انتقام دے\n\nترس گئے ہیں امن کو ہم امن کے پیام بر\nہماری سمت بھی نظر ، ہمیں بھی اب سلام دے\n\nمجددّؔی میں امتی ہوں شہریار علم کا\nمیں کیسے مان لوں اگر کوئی دلیل خام دے"
  },
  {
    "id": 75,
    "title": "نعت شریف",
    "description": "تنویرِ سخن نیرّ تابانِ رسالت\nتابانی فن نیر تابانِ رسالت\n\nفریاد کناں ہے شبِ عصیاں کی سیاہی\n’’ہاں ایک کرن ، نیر تابانِ رسالت‘‘\n\nکرنے کو فدا آپ کی عزت پہ ملے ہیں\nیہ جان و بدن نیر تابان رسالت\n\nاک نعت لکھوں آپ کی میں خون جگر سے\nہے دل میں لگن نیر تابان رسالت\n\nپڑھتے ہیں درود آپ کو دیتے ہیں دعائیں\nیہ سرو و سمن نیر تابان رسالت\n\nکھلتے ہوئے پڑھتے ہیں سبق صلِّ علیٰ کا\nگل ہائے چمن نیر تابانِ رسالت\n\nلکھتے ہی ثنا دور نکل جاتے ہیں دل سے\nسب رنج و محن نیر تابانِ رسالت\n\nکرتے ہیں ہمیشہ شب بدعت کا ازالہ\nانوارِ سنن ، نیر تابانِ رسالت\n\nبے تاب فدا ہونے کو رہتے ہیں ہمیشہ\nسب اہل سنن نیر تابانِ رسالت\n\nپڑھتا ہی رہے نعت کا شہزادؔ وظیفہ\nہے ایک ہی دھن نیر تابان رسالت"
  },
  {
    "id": 76,
    "title": "نعت شریف",
    "description": "اللہ نے کر دی ہے بیاں شانِ رسالت\nقرآن کی آیات ہیں شایانِ رسالت\n\nدل جب سے ہے وابستۂ دامانِ رسالت\nحاصل ہے مسلسل مجھے فیضانِ رسالت\n\nہر گوشۂ پر نور ہے فردوس بداماں\nیہ عرش معلیٰ ہے کہ ایوانِ رسالت\n\nسجدے کو مچلتا ہے بہرگام یہاں دل\nہے کعبۂ عشاق خیابانِ رسالت\n\nسرکار نے فرمایا اسے پاک بتوں سے\nپہنچا تو ہے کعبے کو بھی فیضان رسالت\n\nحرف آئے تو کیسے کوئی سرکار پہ آئے\nہے ذاتِ احد آپ نگہبانِ رسالت\n\nآیاتِ الٰہی کے ہیں سرکار مفسر\nاللہ کا فرمان ہے فرمان رسالت\n\nاس منصب عالی پہ انہیں فخر نہیں ہے\nہیں سرورِ دیں ، سیّد و سلطان رسالت\n\nسایہ سرِ ناعت پہ ہے جبریل کے پر کا\nمولا کی اماں میں ہے ثنا خوانِ رسالت\n\nہو جائے ثمر بار مرا نخلِ تمنا\nبرسے جو کبھی قلب پہ بارانِ رسالت\n\nحسنین جو ہیں سیدّہ زہرا کے دُلارے\nدنیا میں ہیں دونوں گل و ریحانِ رسالت\n\nبے تاب چٹکنے کو ہے غنچہ مرے دل کا\nہاں ایک کرن نیرّ تابانِ رسالت\n\nہونٹوں پہ نئی نعت کے اشعار سجائے\nہے زمزمہ خواں بلبلِ بستانِ رسالت\n\nہیں عالم حیرت میں اولوالعزم پیمبر\nخالق نے بنائی ہے عجب شانِ رسالت\n\nقرآن میں خالق نے قسم کھائی ہے اس کی\nایمان کی جاں یونہی نہیں جانِ رسالت\n\nاس در کے جو اکرام کا قائل ہی نہیں ہے\nلو بن کے کھڑا ہے وہی دربانِ رسالت\n\nیہ گلشن بے خار ہے محفوظ خزاں سے\nشہکار ہے فطرت کا گلستانِ رسالت\n\nموقوف ہے اس بات پہ انساں کی ترقی\nانسان کو کس درجہ ہے عرفانِ رسالت\n\nانسان کو سرکار نے انسان بنایا\nانسان پہ کیا کم ہے یہ احسانِ رسالت\n\nشہزادؔ یہ اعزاز کوئی کم تو نہیں ہے\nمجھ ایسا گنہگار ہو مہمانِ رسالت"
  },
  {
    "id": 77,
    "title": "نعت شریف",
    "description": "جمال سرورِ دیں کا کہاں سے لائوں پیمانہ\nکہ جبرائیل بھی شمع رسالت کا ہے پروانہ\n\nمرے آقا مرے احوال پر بھی رحم فرمانا\nخصائل آپ کو خالق نے بخشے ہیں کریمانہ\n\nشہنشاہ دو عالم کی گلی کا ہے عجب منظر\nیہاں ہر ایک دیوانہ نظر آتا ہے فرزانہ\n\nفرازِ عرش سے ہر دم نئے انوار اترتے ہیں\nشہِ کونین کے روضے کا عالم ہے جداگانہ\n\nخدا کے نور نے جلوہ نمائی کی ہے اس دھج سے\n’’کہ سینہ ارض طیبہ کا بنا رشک پری خانہ‘‘\n\nبسے انوار خورشید حرم اِس شان سے اس میں\n’’کہ سینہ ارض طیبہ کا بنا رشک پری خانہ‘‘\n\nبھٹکتے آدمی کو دے دیا کردار کا جوہر\nسجایا پیکر اخلاق نے یوں دل کا ویرانہ\n\nنگاہِ لطف پھر ہو رحمۃ للعالمیں اس پر\nہوئے جاتے ہیں پھر انسان کے تیور بہیمانہ\n\nرہی اس کو ہمیشہ کدّ شہ دیں گے غلاموں سے\nروش ابلیس نے سرکار سے رکھی حریفانہ\n\nجہاں روح و بدن کے گھائو سارے بھرتے جاتے ہیں\nمدینہ میں طبیب حق نے کھولا وہ شفاخانہ\n\nثنا خوان شہ دیں کی بڑی توقیر ہے لوگو\nخدا کا فضل ہے اتنی بڑی توفیق مل جانا\n\nوہ اپنے مدح گُستر کے لیے ان کا دعا کرنا\nوہ اپنے شاعر دربار کا اکرام فرمانا\n\nمجھے روح القدس اپنے قریں محسوس ہوتے ہیں\nکبھی جب یاد آ جاتی ہے ان کی داد شاہانہ\n\nثنا خوانِ شہ دیں کے لیے بے حد ضروری ہے\nادب ، صدق و وفا، حسن عمل ، سیرت شریفانہ\n\nمرے آقا ہی زیب مسندِ محمود جب ہوں گے\nتو پھر کیا عرصۂ محشر سے اے شہزادؔ گھبرانا"
  },
  {
    "id": 78,
    "title": "نعت شریف",
    "description": "ان پر درود بھیجئے حمدِ خدا کے بعد\nپڑھئے نبی کی نعت خدا کی ثنا کے بعد\n\nیہ بات مانتے ہیں خلیل و کلیم بھی\nخیرالوریٰ کی شان ہے ذوالکبریا کے بعد\n\nتاج سر وظائف و اذکار ہے درود\nباقی ہر ایک ورد ہے صلِّ علیٰ کے بعد\n\nبعد از خدا بزرگ ہیں وہ قصہ مختصر\n’’اک مصطفی کا نام ہے نامِ خدا کے بعد‘‘\n\nکچھ بھی نہ تھا خدا کے سوا کائنات میں\nعالم تمام خلق ہوا مصطفی کے بعد\n\nسرکار سے ہیں عالم امکاں کی رونقیں\nہر واقعہ ہوا ہے شہِ دوسرا کے بعد\n\nہمسائیگی ملے شہِ دارالسلام کی\nکیا اور مانگتا میں بھلا اس دعا کے بعد\n\nسرشار کر دیا اسے رحمت پناہ نے\nپہنچا درِ حضور پہ جو بھی خطا کے بعد\n\nشہزادؔ کو بھی ہے اسی چادر کی جستجو\nپائی تھی کعب نے جو حصولِ رضا کے بعد"
  },
  {
    "id": 79,
    "title": "نعت شریف",
    "description": "ذکر شہ انام ہے نامِ خدا کے بعد\nیہ ورد صبح و شام ہے نامِ خدا کے بعد\n\nپہلے اسی کا ذکر ہے ہر کار خیر سے\nسرکار پر سلام ہے نامِ خدا کے بعد\n\nتحریر ہے جو نور کے حرفوں سے عرش پر\n’’اک مصطفی کا نام ہے نامِ خدا کے بعد‘‘\n\nحمد خدا کے بعد ہے مولائے کل کی نعت\nمدحت کا اہتمام ہے نامِ خدا کے بعد\n\nہیں حرز جاں درود و تحیّت کے زمزمے\nجچتا یہی کلام ہے نامِ خدا کے بعد\n\nہر دم نیا مراقبہ محراب نعت میں\nا پنا تو بس یہ کام ہے نامِ خدا کے بعد\n\nپڑھتا ہوں ان کے اسم گرامی پہ میں درود\nپونجی یہی تمام ہے نامِ خدا کے بعد\n\nقطعہ ہو یا رباعی ، قصیدہ ہو یا غزل\nمدح نبی مدام ہے نامِ خدا کے بعد\n\nاس نام سے ہے بزمِ عناصر کی ابتدا\nاس پر ہی اختتام ہے نامِ خدا کے بعد\n\nاس نام سے ہے خیمۂ گردوں تنا ہوا\nاس نام کو دوام ہے نامِ خدا کے بعد\n\nیہ بات ہر کتاب مقدس میں ہے لکھی\nسرکار کا مقام ہے نامِ خدا کے بعد\n\nلوح مبیں پہ نام ہے سرکار کی رقم\nیہ نام ہی امام ہے نامِ خدا کے بعد\n\nشہزادؔ میرے آقا و مولا کے نام کا\nکس درجہ احترام ہے نامِ خدا کے بعد\n\nنعت شریف\nجیسے خدا کی ذات سے ہیں ٗمصطفی قریب\n\nایسے نہ لا یزال کے کوئی ہوا قریب\nجو جتنا بارگاہ نبی سے رہا قریب\n\nاتنا ہی ذوالجلال کے ہوتا گیا قریب\nکرتا ہے طے وہ قرب الٰہی کی منزلیں\n\nکرتے ہیں جب کسی کو حبیب خدا قریب\nوہ خوش نصیب کون ہے ازغار تا مزار\n\nہرحال میں حضور نے جس کو رکھا قریب\nدنیا کو رنگ و نور سے معمور کر گیا\n\nاس پیکر جمال کے جو بھی رہا قریب\nمضموں ملا یہ سورئہ احزاب سے مجھے\n\nمومن کی جاں سے بھی ہیں شہ انبیاء قریب\nپابند قرب و بُعد نہیں ان کی بارگاہ\n\nیہ ان کا مسئلہ ہی نہیں دور یا قریب\nذکر نبی کو جو بھی بنائے گا حرز جاں\n\nاس کو رکھیں گے حشر میں خیرالوریٰ قریب\nآقا نے اپنی ذات مقدّس کا جُز کہا\n\nکس درجہ تھیں حضور کے خیر النساء قریب\nہوتی ہے سہل اسوئہ اقدس کی پیروی\n\nرکھتا ہوں نقشِ پائے نبی کو سدا قریب\nشہزادؔ زندگی میں مزے لوں بہشت کے\n\nدو چار دن جو رکھ لیں شہِ دوسرا قر"
  },
  {
    "id": 80,
    "title": "نعت شریف",
    "description": "یہی میرا وظیفہ ہے ، یہی میری عبادت ہے\nمیں اہل نعت میں سے ہوں ، میسر یہ سعادت ہے\n\nزمانے بھر کی مہمانی کو وا بابِ عنایت ہے\nہیں جس کے ریزہ چیں سلطاں ، یہ ایسا خوانِ نعمت ہے\n\nسنو! تقویم عشق مصطفی پر جس کی خلقت ہے\nاسے جینے کی حاجت ہے ، نہ مرنے کی ضرورت ہے\n\nقدم فرما ہوئے ہیں رحمۃ للعالمیں e جس جا\nوہاں کا ذرہ ذرہ آج تک خورشید سیرت ہے\n\nنہ ہو پابوسیٔ مولائے عالمe سے جو بہرہ مند\nوہ دنیا کوئی دنیا ہے وہ جنت کوئی جنت ہے\n\nمراگریہ بھی اک فیضان ہے اس ابرِ رحمت کا\nکہ چشم تر میں جو بھی قطرہ ہے ، دریا بضاعت ہے\n\nمحمدe کے غلاموں ، جانثاروں ، فیض یابوں میں\nہر اک شاہِ ولایت ہے ، ہر اک میرِ امامت ہے\n\nکہا جبریل نے اپنے مراتب کو بیاں کر کے\nیہ سب حضرت تمہاری مہربانی ہے ، عنایت ہے\n\nیہی احساس رکھتا ہے تروتازہ مجھے ہر دم\nمیں کس کا امتی ہوں اور میری کس سے نسبت ہے\n\nہمیشہ سے رہے ہیں متفق اہل نظر اس پر\n’’یہ دنیا ایک صحرا ہے ، مدینہ باغ جنت ہے‘‘\n\nدیار قدس میں شہزادؔ تھا امسال بھی حاضر\nہوا پھر سے کرم بے حد ، شہ طیبہ کی شفقت ہے"
  },
  {
    "id": 81,
    "title": "نعت شریف",
    "description": "زہے مقدر ہمیں بھی نسبت ہے بارگاہِ شہ شہاں ا سے\nغبار کو بھی تو کچھ علاقہ ہوا ہی کرتا ہے کارواں سے\n\nہر ایک تشبیہ سے مبرّا ، ورا ہے بے شک وہ ہر مکاں سے\n’’ملا خدا بھی اگر کسی کو ، ملا محمدا کے آستاں سے‘‘\n\nجہانِ فانی میں آ رہے ہم ہجوم ارواح سے نکل کر\nتمنا ان کی لیے پھرے ہے ، یہاں وہاں سے ، وہاں یہاں سے\n\nمرا حوالہ یہاں بھی ان کی عنایتیں ہیں ، نوازشیں ہیں\nخدا نے چاہا تو جانا جائوں گا حشر میں بھی اِسی نشاں سے\n\nثنائے خواجہ کی کیف افزا فضا میں لیتا ہوں سانس جب میں\nاترنے لگتا ہے قلبِ مضطر پہ اک سکینہ سا آسماں سے\n\nمقام محمود پر قیامت کے روز ہوں گے حضورا فائز\nانہی کی مدحت سنائی دے گی ہر ایک لب سے ، ہر اک زباں سے\n\nبرستا جائے گا ابر بخشش باذن مولا وہاں وہاں پر\nگزرتے جائیں گے سرور دیں بروز محشر جہاں جہاں سے\n\nوہ دیکھ شہزادؔ ان کا روضہ ریاض جنت سے متصل ہے\nبہشت بھی فیض پا رہی ہے شہ مدینہ کے گلستاں سے"
  },
  {
    "id": 82,
    "title": "نعت شریف",
    "description": "شکر ہو سکتا نہیں اس پر خدائے پاک کا\nنعت گو اس نے کیا مجھ کو شہِ لولاک کا\n\nمرتکب ہے جو بھی ایذائے رسول پاک کا\nہے جہنم مستقر ایسے ہر اک بے باک کا\n\nاشک مشغولِ دعا ہیں جالیوں کے روبرو\nبخت جاگ اٹھا ہے میرے دیدئہ نمناک کا\n\nجو تھے محروم بصیرت ، ہو گئے اہل نظر\nسرمہ آنکھوں میں لگا کر اس گلی کی خاک کا\n\nنوع انساں تھی تباہی کے کنارے پر ، کہ بس\n’’ہاتھ آیا دامنِ رحمت شہِ لولاک کا‘‘\n\nمجھ پہ ہوتی ہے نچھاور خود بہار ہشت خلد\nغنچہ دل میں جب چٹکتا ہے درود پاک کا\n\nاس کی امت پر بھی کھول ابوابِ رحمت اے کریم!\nجس کی خاطر وا کیا تھا تو نے ، در افلاک کا\n\nیہ بھی تھا سرکارِ والا کے خصائص میں سے ایک\nدور ہی سے دشمن پر بیٹھ جانا دھاک کا\n\nکس ادب سے چومتی ہو گی لب و دندان کو\nمرتبہ اعلیٰ ہے کتنا آپ کی مسواک کا\n\nدھو کے پیتے تھے قمیص پاک کا پانی مریض\nمعجزہ مشہور ہے سرکارا کی پوشاک کا\n\nمیں کہ اک موج غبار کاروان نعت ہوں\nہے کرم شہزادؔ یہ بھی اس خس و خاشاک کا"
  },
  {
    "id": 83,
    "title": "نعت شریف",
    "description": "مجھے فیضان صبح و شام آتا ہے محمد کا\nزباں پر میری جس دم نام آتا ہے محمد کا\n\nمصائب دنیوی ہوں یا مراحل قبر و محشر کے\nوسیلہ بے کسوں کے کام آتا ہے محمد کا\n\nمسافر جادئہ سیرت کے رکھ ملحوظ یہ نکتہ\nمدینہ راہ میں ہر گام آتا ہے محمد کا\n\nسناتا ہے جب آ کر ذکر طیبہ کا کوئی زائر\nتو لگتا ہے کہ بس پیغام آتا ہے محمد کا\n\nقصیدہ جب بھی دربار نبی میں نذر کرتا ہوں\nنیا ہر بار اک انعام آتا ہے محمد کا\n\nفلاح و فوز کے حق دار ہیں دنیا و عقبیٰ میں\nبجا لانا جنہیں اکرام آتا ہے محمد کا\n\nپکاریں اہل جنت جب پڑے مجھ پر نظر ان کی\nوہ دیکھو بندئہ بے دام آتا ہے محمد کا\n\nمجھے شہزادؔ ان کی تشنگی پہ رشک آتا ہے\nبجھانے پیاس جن کی جام آتا ہے محمد کا"
  },
  {
    "id": 84,
    "title": "نعت شریف",
    "description": "دو عالم کی زینت رسالت کسی کی\nخدا کی عنایت رسالت کسی کی\n\nکمال بدایت رسالت کسی کی\nجمال نہایت رسالت کسی کی\n\nفروغ شریعت رسالت کسی کی\nہے روح طریقت رسالت کسی کی\n\nکرم کی روایت رسالت کسی کی\nسراسر ہے رحمت رسالت کسی کی\n\nرسل آئے آدم سے تا ابن مریم\nکہ تھی غرض و غایت رسالت کسی کی\n\nازل تا ابد جلوہ گر اب رہے گی\nبصد شان و شوکت رسالت کسی کی\n\nہوئی ضوفشاں عرصۂ تیرگی میں\nبصدق و امانت رسالت کسی کی\n\nقلم لم یزل کی بنائی گئی ہے\nبرائے اطاعت رسالت کسی کی\n\nرسل مقتدی ہوں گے روز قیامت\nکرے گی قیادت رسالت کسی کی\n\nنہ کیوں دو جہاں پھر کریں استفادہ\nدو جگ میں ہے رحمت رسالت کسی کی\n\nجو رسوائے عالم تھے اب محترم ہیں\nہے وجہِ کرامت رسالت کسی کی\n\nہماری شفاعت کو شہزادؔ ہو گی\nبروز قیامت رسالت کسی کی"
  },
  {
    "id": 85,
    "title": "نعت شریف",
    "description": "خدا کا تقرب ہے قربت کسی کی\nکہ ہے اصل ایمان الفت کسی کی\n\nکلام الٰہی کی آیات بن کر\nہوئی جلوہ فرما فضیلت کسی کی\n\nنمازی صلوٰۃ و ثنا پڑھ رہے ہیں\nادا ہو رہی ہے عبادت کسی کی\n\nسبھی انبیاء و رسل محترم ہیں\nمسلّم ہے سب پر قیادت کسی کی\n\nہے سب اہل ایماں کا پختہ عقیدہ\nہمیں کام دے گی شفاعت کسی کی\n\nبہرحال دامان سائل کو بھرنا\nہمیشہ رہی ہے روایت کسی کی\n\nخدا کی قسم نعت بھی خوب شے ہے\nکسی کی نجات اور مدحت کسی کی\n\nعجب دلکشی ہے مدیحِ نبی میں\nکسی کی ثنا اور سعادت کسی کی\n\nکسی کے کرم پر لگی ہیں یہ آنکھیں\nنوازے گی آخر عنایت کسی کی\n\nہمارے فضائل بھی قرآن میں ہیں\nکہ آخر کو ہم بھی ہیں امت کسی کی\n\nہمارا بھی شہزادؔ ہے کوئی وارث\nہے حاصل ہمیں بھی حمایت کسی کی"
  },
  {
    "id": 86,
    "title": "نعت شریف",
    "description": "ہر عقیدت پہ مقدّم ہے عقیدت اپنی\nفیض سرکارِ دو عالم ہے عقیدت اپنی\n\nدل تصور میں مدینے کے سفر پر مائل\nساتھ باعزم مصمم ہے عقیدت اپنی\n\nمستقل ربط ہے بارانِ کرم سے ہم کو\nموسم زرد میں رم جھم ہے عقیدت اپنی\n\nفرد اعمال میں مرقوم ہیں نعتیں ان کی\nلفظ در لفظ مجسم ہے عقیدت اپنی\n\nالتفات شہ کونین میسر ہے ہمیں\nایک سرشاری پیہم ہے عقیدت اپنی\n\nبے خودی میں بھی رہا صحو کا عالم طاری\nتابش نور مجسم ہے عقیدت اپنی\n\nاک تسلسل ہے تحیات و ثنا کا ہر پل\nمحو تسلیم دما دم ہے عقیدت اپنی\n\nطے کیے ایسے محبت کے مدارج ہم نے\nرب کے محبوب سے محکم ہے عقیدت اپنی\n\nجب سے وابستۂ دامان کرم ہوں شہزادؔ\nبے نیازِ الم و غم ہے عقیدت اپنی"
  },
  {
    "id": 87,
    "title": "نعت شریف",
    "description": "رسول ہر دو عالم کا ہے یہ فرمان ’’لا تَغْضِب‘‘\nیہ فرمانِ نبی ہے صاحب ایمان ’’لا تَغْضِب‘‘\n\nنصیحت کے لیے جب کی گزارش اک صحابی نے\nکہا سرکار نے ہر بار اے انسان ’’لا تَغْضِب‘‘\n\nخطا سے در گزر کرنا بہت محبوب ہے رب کو\nکسی حالت میں بھی اے بندئہ رحمان ’’لا تَغْضِب‘‘\n\nخدا کو ہے بہت ہی پیار غصہ پینے والوں سے\nبڑی ’’والکاظمین الغیظ‘‘ کی ہے شان ’’لا تَغْضِب‘‘\n\nشہ کونین کی سیرت کا ہے اک دلنشیں پہلو\nکرو تم دشمنوں کے ساتھ بھی احسان ’’لا تَغْضِب‘‘\n\nشعار انبیاء و اصفیاء ہے درگزر کرنا\nیہی ہے شیوئہ اہل رہ عرفان ’’لا تَغْضِب‘‘\n\nچلو یہ باہمی بے زاریاں سب ختم کر ڈالیں\nفنا ہو جائیں گے اک دن یہ مال و جان ’’لا تَغْضِب‘‘\n\nترا سب سے بڑا دشمن ہے تیرے ساتھ ہر لمحہ\nکہیں چنگاریاں بھڑکا نہ دے شیطان ’’لا تَغْضِب‘‘\n\nجسے قابو ہو اپنے نفس پر غصے کی حالت میں\nہے طاقتور حقیقت میں وہی انسان ’’لا تَغْضِب‘‘\n\nتکبرّ بندئہ ناچیز کو زیبا نہیں ہرگز\nانا کو چھوڑ دے اے پیکرِ ایقان ’’لا تَغْضِب‘‘\n\nخدائے قاہر و جبار کی بھی ہے رضا اس میں\nجسے سب مانتے ہیں تو بھی اس کی مان ’’لا تَغْضِب‘‘\n\nخدا نے بھی کیا غصے پہ اپنے فضل کو غالب\nوہ بے شک ہے حلیم و غافر و سبحان ’’لا تَغْضِب‘‘\n\nمری اس بات پر شہزادؔ ہے ’’ماینطق‘‘ شاہد\nحدیثِ سرور دیں ہی تو ہے قرآن ’’لا تَغْضِب‘‘"
  },
  {
    "id": 88,
    "title": "مدینے کی کھجوریں",
    "description": "آتی ہیں بہت یاد مدینے کی کھجوریں\nہیں رزقِ خداداد مدینے کی کھجوریں\n\nہمراہ یہ لے آتی ہیں زمزم کے کٹورے\nکر دیتی ہیں دل شاد مدینے کی کھجوریں\n\nگزری تھی جو حجاج پہ دوران زیارت\nکہتی ہیں وہ روداد مدینے کی کھجوریں\n\nجو باغ کہ سیراب نہ ہوتا ہو کسی سے\nکر دیتی ہیں آباد مدینے کی کھجوریں\n\nاللہ کے محبوب سے نسبت جو ہے ان کو\nپاتی ہیں بہت داد مدینے کی کھجوریں\n\nکرتی ہیں کرم زائر طیبہ پہ خصوصی\nبن جاتی ہیں ہم زاد مدینے کی کھجوریں\n\nیہ جذبۂ ایمان کو دیتی ہیں حرارت\nہیں دافعِ الحاد مدینے کی کھجوریں\n\nجب بھوک ستاتی ہے مسافر کو سفر میں\nفرماتی ہیں امداد مدینے کی کھجوریں\n\nہر آن تصور میں ہیں زمزم کے کٹورے\nآنکھوں میں ہیں آباد مدینے کی کھجوریں\n\nسرکار کے فیضان سے معمور ہیں ریشے\nہیں پیکرِ ارشاد مدینے کی کھجوریں\n\nاللہ رہے وہ عنبر و عجوہ کی حلاوت\nکیا خوب ہیں شہزادؔ مدینے کی کھجوریں"
  },
  {
    "id": 89,
    "title": "قطعات",
    "description": "کبھی تبت یدا کا تازیانہ تا و تب آیا\nکہیں ما اغنیٰ عنہٗ مالہٗ اور مَاکَسَبْ آیا\n\nتری ناموس کا خود قادر مطلق محافظ ہے\nحمایت میں تری یا مصطفی قرآن سب آیا"
  },
  {
    "id": 90,
    "title": "اگر توبہ پہ ہے مائل طبیعت",
    "description": "وضو کر لیجیے پہلے دعا سے\nنہیں ہے آنکھ میں پانی تو کر لیں\n\nتیمم خاکِ پائے مصطفی "
  },
  {
    "id": 91,
    "title": "قطعات",
    "description": "حاصل عمر ہے بشر کے لیے\nسرور دیں کی ذات کا ادراک\n\nنعت میں نعت ہی کا ہو مضموں\nاس کو کہتے ہیں نعت کا ادراک"
  },
  {
    "id": 92,
    "title": "غرّنی رحمۃ ربیّ",
    "description": "کر دیا غافل تجھے کس نے خدا کی ذات سے\nمجھ سے پوچھا ایک دن یہ آیۂ قرآن نے\n\nجھوم کر شہزادؔ میں نے یوں دیا اس کا جواب\nکر دیا بے باک مجھ کو رحمت رحمن نے"
  },
  {
    "id": 93,
    "title": "تبصرہ",
    "description": "شہزادؔ مجدّدی کی نعت کے کئی پہلو ہیں۔ ان کے ہاں نعتیہ موضوعات کا بڑا تنوع ہے۔ جذبات و احساسات اور نظریات کو بیان کرنے کے الگ الگ انداز ہیں۔ موصوف دیار مصطفیا جانے اور وہاں زیست کرنے کے جذبات اور خواہشات کو جس طرح بیان کرتے ہیں اور پھر جس طرح دورانِ حاضری درودیوار حبیب کبریا کی بات کرتے ہیں۔ اس سے ان کا عشق اور عقیدت واضح جھلکتی نظر آتی ہے۔ شہزادؔ مجدّدی فن نعت گوئی کو سعادت بھی سمجھتے ہیں اور پھر اس سعادت اورعطا پر فخر بھی کرتے ہیں۔ اس فخر کا اظہار وہ جس انداز سے کرتے ہیں قاری خود اس انداز میں کیف و سرشاری محسوس کرنے لگتا ہے۔\nشہزادؔ مجدّدی کے ہاں نعت میں غزل کا رنگ بھی نمایاں ہے اور خوبصورت الفاظ کا استعمال بھی جوکہ آپ کی نعت کو فنی حوالے سے حسین ترین بنا رہا ہے۔\n\nآپ نے نعت لکھتے ہوئے عقل و شعور کے سارے در وا کیے ہوتے ہیں کہ بات کہیں مقام مصطفیا سے پیچھے نہ رہ جائے۔ شہزادؔ کی حمد و مناجات میں جو دعائیں اور التجائیں ہیں وہ بھی درحبیب خدا پہ زیست کرنے اور نعت رسول مصطفیالکھنے اور پڑھنے کی ہیں۔ ان کی نعت سے مکمل وابستگی ہی ہے جوکہ ان کی نعت کو زندہ رکھے ہوئے ہے کیوں کہ ان کے ہاں روایتی اور مصنوعی خیال نہیں ہیں۔ ہر خیال میں سچائی اور رعنائی ہے۔ عشق اور محبت ہے اور وہ اس فن نعت کو زندگی تصور کرتے ہوئے کہتے ہیں۔\n؎مرا آغاز اور انجام ہے شہزادؔ نعت ان کی\n\nہوا ہے کام اک مجھ سے یہی مقدور بھر افضل\n؎روح کا رزق اترتا ہے فلک سے جب بھی\n\nمیرے حصے میں شہ دیں کی ثنا آتی ہے\nشہزادؔ مجدّدی فن نعت میں اور حمدنگاری کے راستے میں عشق کو ہی رہبر و مرشد اور روشنی و نور سمجھتے ہیں کیوں کہ اس کے علاوہ نہ تو نعت لکھی جاتی ہے اور نہ ہی زندگی بسر ہوتی ہے۔ انہوں نے اپنی حمد و نعت میں فلسفہ عشق کو بڑے خوبصورت پیرائے میں بیان کیا ہے اور عاشقان رسول خداا کو دو جہانوں میں معتبر و افضل گردانا ہے۔ شہزادؔ مجدّدی کی نعت ہمیں سیرت و صورت مصطفی سے عشق سکھاتی ہے اور آپ ا کے خلق عظیم کی بات کو ہمارے قلب و روح میں ایسے اتارتی ہے کہ ہمارے ذہن و فکر پر عشق کے معانی کھلتے جاتے ہیں۔ ہماری بصیرتوں اور بصارتوں میں رنگ، روشنی اور نور کے دروا ہوتے جاتے ہیں۔ ہمارا دامن خیرات مصطفیا سے بھر جاتا ہے اور ہم اپنے آپ کو دنیا کے بادشاہوں میں محسوس کرنے لگتے ہیں۔\n\nسہ ماہی مفیض\n(نعت تبصرہ نمبر)\n\nشمارہ ۲۷، ۲۰۰"
  },
  { "id": 94, "title": "محاسن", "description": "" }
]
